[
    {
        "by": "jclarkcom",
        "id": 8488000,
        "kids": [
            8488383,
            8488236
        ],
        "parent": 8486801,
        "text": "Looking through their most recently filed patents, it looks like their main innovation is a HMD device that uses a combination of a high speed digital zone plate, a masking device, and a traditional imaging device.<p>For each eye, there is an imaging device (720p&#x2F;1080p resolution for example) that displays an image. In front of the imaging devices there are high speed mask device (LCD?) that blocks off portions of the image that are not at the current focal depth.  The focal depth cycles quickly between 12 different values and easily driven by the z-buffer values from the renders.  The light not blocked by the mask is partially collimated and guided towards the eye via optics and then a high resolution high speed digital zone plate is used to refocus the light at different depth levels using diffraction.  The mask and zone plate update together at 12X (360Hz-720Hz) the rate of the image device (30-60Hz).  The result is that pixels that should be at different depths are actually focused near that depth and the eye blends the 12 partial frames together to form one image that has a range of depth in it.<p>I expect they are using off the shelf parts for the imaging device (and maybe mask LCD) but manufacturing their own digital zone plates since they need super high resolution and high speed for those (at least 360hz) but only on-off values not color or grayscale.  This is probably where a bit of their money is going.<p>If it works, you could get high resolution images per eye, and also see 12 buckets of depth so your eye would refocus to see things close up versus far away. This could potentially create a pretty good impression of something existing close to you, compared to existing AR where all objects are focused at a single fixed depth and there is a conflict between accommodation and stereopis cues.<p>Of course this is one of the patents filed, it could be just an idea they decided to file on, not what they are actually building.",
        "time": 1413907437,
        "type": "comment"
    },
    {
        "by": "natch",
        "id": 8488001,
        "parent": 8478902,
        "text": "This is really cool.<p>But. (Is there always a but?) it&#x27;s very unapproachable. It has no welcome mat.<p>&quot;Let&#x27;s dive in&quot; is normally an appreciated attitude, but here it makes it sound like we are coming in in the middle, and have missed the introduction. So, what is this thing? The page doesn&#x27;t really say. There&#x27;s an about page, but most people are too lazy to click. They want to see the value explained immediately, clearly, succinctly, on the landing page... or they&#x27;re gone.<p>If they do click the About page, the writing is stilted, formal. But they don&#x27;t, in most cases, I suspect.<p>When there are clickable images, it&#x27;s not clear they are clickable. The text indicates you should click, but there are these huge arrows right there, and the obvious interpretation of the text is that you&#x27;re supposed to click the arrows to see the image do its animation. Nope.<p>CPU is very jargonish as well. A better title would be something like &quot;how computers work.&quot;<p>Still, nice design, beautifully made, good chunking of stuff into bite-sized pieces.",
        "time": 1413907438,
        "type": "comment"
    },
    {
        "id": 8488002,
        "time": 1413907444,
        "type": "story"
    },
    {
        "by": "emotionalcode",
        "id": 8488003,
        "parent": 8487656,
        "text": "Aesthetics are just as much a matter of taste as they are engineering. A lot of code frankly lends itself to such verbosity&#x2F;elegance&#x2F;simplicity&#x2F;density&#x2F;readability&#x2F;(...) because of cultural:personal [preference, pedantry, experience, understanding, knowledge base].<p>Rather, I&#x27;m not so quick to have an opinion on aesthetics, because I think philosophically, beauty defines a balance between simplicity and engineering. Every part expresses itself perfectly.<p>There are ideals that work across the majority, and there are ideals that are appreciated by a niche audience. There is the Ideal, which is never achievable, and there is the expression of the Ideal, which always exists. Engineering or design, I don&#x27;t see a difference. Different content, same concept.",
        "time": 1413907445,
        "type": "comment"
    },
    {
        "by": "tantalor",
        "id": 8488004,
        "kids": [
            8488024
        ],
        "parent": 8487115,
        "text": "Some comments are pointing out how awkward this might be,<p>&gt; I don&#x27;t see a point in plugging my entire keychain (the physical keychain, with my car keys) into my laptop every time I want to log in<p>&gt; I&#x27;m not sure about having to plug it in every time<p>I&#x27;ll share my experience. I use two of these on a laptop and desktop and I have never unplugged them; there&#x27;s no reason to. They sit very flush in the USB slot. I suppose if I ever needed the extra USB slot for something else I might unplug it.",
        "time": 1413907448,
        "type": "comment"
    },
    {
        "by": "pshin45",
        "id": 8488005,
        "score": 1,
        "text": "",
        "time": 1413907474,
        "title": "Why do people love Startup School?",
        "type": "story",
        "url": "https://medium.com/@petershin45/why-do-people-love-startup-school-e168c00694a2"
    },
    {
        "by": "ggonweb",
        "id": 8488006,
        "score": 1,
        "text": "",
        "time": 1413907490,
        "title": "What happens when pmarca (Marc Andreessen) mentions your name?",
        "type": "story",
        "url": "https://medium.com/thoughts-and-dots/what-happens-when-marc-andreessen-mentions-your-name-e87221ddf6e7"
    },
    {
        "by": "pjungwir",
        "id": 8488007,
        "parent": 8484152,
        "text": "At our Portland Ruby meetup we used to have &quot;Ruby Hangman.&quot; You might enjoy working through some of the old puzzles:<p><a href=\"https://groups.google.com/forum/#!searchin/pdxruby/hangman\" rel=\"nofollow\">https:&#x2F;&#x2F;groups.google.com&#x2F;forum&#x2F;#!searchin&#x2F;pdxruby&#x2F;hangman</a><p>It is a bit like Perl Golf, although the desired number of characters is known beforehand.",
        "time": 1413907508,
        "type": "comment"
    },
    {
        "by": "gphilip",
        "id": 8488008,
        "parent": 8486596,
        "text": "Rough translation of the Preface on page 4 by the person who scanned the book. The preface is written (mostly) in Malayalam [1], the language of the state of Kerala [2] in India:<p>I bought this book in 1986 for 50 Rupees [3]. Since it was a great book, I used to read it often, and many of my friends used to borrow it. Somebody borrowed it in 2007, and I never got it back. I searched the entire world for a copy, new or old, cheap or expensive .... I couldn&#x27;t find one. Then a friend told me that if there is a copy anywhere in the world then he would buy it for me, no matter the price. He heard that it was available with Abe(?) Books in the U.S for $86, and ordered a copy. I waited for it to arrive ...... Then I got the regret message &quot;Your consignment has been missed during transit, and we have no additional copy. Your payment will be redeemed however.&quot; I kept up my search. Then I got to know that a person in Koyilandy [4] had a copy, and I took a laptop and a scanner and journeyed from one end of Kerala to the other to reach there. It took 7 hours to scan the the entire book. I converted the entire corpus into text and edited it to make it identical to the original text, and added all the line drawings using CorelDraw to get it to its current form.<p>If you ever get your hands on this, then keep in mind that so much effort went into its making. Shouldn&#x27;t I have done at least this much in return for the kindness which my good friend showed me, in offering to buy the book for me even at an exorbitant price? I offer this completed scan first to him, like a gift of the Magi [5]. I look back and think, was it worth it? Yes, absolutely.<p>[1] <a href=\"https://en.wikipedia.org/wiki/Malayalam\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Malayalam</a><p>[2] <a href=\"https://en.wikipedia.org/wiki/Kerala\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Kerala</a><p>[3] A significant sum in those days. A good meal could be had for 5 Rupees or less in those days.<p>[4] <a href=\"https://en.wikipedia.org/wiki/Koyilandy\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Koyilandy</a><p>[5] He doesn&#x27;t say &quot;gift of the Magi&quot; in so many words, but &quot;a gift of a piece of a commonly found plant in return for a piece of broken slate pencil&quot;, but I guess the idea is somewhat similar.",
        "time": 1413907520,
        "type": "comment"
    },
    {
        "by": "HCIdivision17",
        "id": 8488009,
        "parent": 8487819,
        "text": "I would have thought it obvious: it looks like a lateral thinking puzzle to some people, and it&#x27;s painfully common to have the null case be a part of the solution (in a sort of perverted aha-gotcha! attempt).<p>After all, part of the linked article&#x27;s point was how it struck him as potentially broken; if the problem seems broken, then many will heuristically start attacking the problem itself rather than the math.  And once the problem&#x27;s no longer trusted to be stated as exact and correct, well, a simple pedantic jump in meaning is a pretty small step. (I&#x27;ll concede it&#x27;s <i>possible</i> you&#x27;ve never come across a broken &#x27;clever&#x27; math word problem before, but having found enough to be wary myself - both in school and college - I&#x27;m rarely surprised at people leaping for the lateral thinking solution.)",
        "time": 1413907547,
        "type": "comment"
    },
    {
        "by": "grecy",
        "id": 8488010,
        "parent": 8484747,
        "text": "That reminds me of the story of how Walt built Disneyland.<p>When he went around asking others what they thought, every single person said he was nuts and it would never work. That made him extremely excited - and more determined than ever - because he knew he was on the path of doing something truly different.",
        "time": 1413907566,
        "type": "comment"
    },
    {
        "by": "yanonymator",
        "id": 8488011,
        "kids": [
            8488433
        ],
        "parent": 8487811,
        "text": "LOL &quot;No need for ... client software...&quot;  ... Uses ... built-in support directly into the browser&quot;.<p>So when did a browser stop being &quot;client software&quot; ?<p>Never let the truth get in the way of a good advertising claim eh?",
        "time": 1413907572,
        "type": "comment"
    },
    {
        "by": "Torgo",
        "id": 8488012,
        "parent": 8487885,
        "text": "A while back I went back and watched a bunch of commodore 64 commercials from my childhood on Youtube and was surprised to see that they almost all included girls. If that was an outlier, that&#x27;s too bad.",
        "time": 1413907579,
        "type": "comment"
    },
    {
        "by": "kissickas",
        "id": 8488013,
        "kids": [
            8488170
        ],
        "parent": 8487774,
        "text": "I&#x27;m just asking, because I have no idea how this works. I figured an assailant could more easily make use of an NFC signal than they could see the code on the front of the device in the short time it takes you to memorize or copy&#x2F;paste the code.",
        "time": 1413907580,
        "type": "comment"
    },
    {
        "by": "h4waii",
        "id": 8488014,
        "kids": [
            8488156
        ],
        "parent": 8487726,
        "text": "Looks like a very clean interfaces, though many HNers likely know how to build IP routes and per-host tables.<p>Is manual configuration an option for providers not supported?<p>What protocols are supported? OpenVPN, PPTP, L2TP?",
        "time": 1413907599,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488015,
        "parent": 8487978,
        "time": 1413907616,
        "type": "comment"
    },
    {
        "by": "pjc50",
        "id": 8488016,
        "parent": 8485761,
        "text": "My wife is still using my iPad 1, although rather lightly. Upgrading is finally being forced on us as it&#x27;s obsolete and has become rather crash-prone.",
        "time": 1413907618,
        "type": "comment"
    },
    {
        "by": "eropple",
        "id": 8488017,
        "parent": 8487074,
        "text": "Well, no. Those standards exist for a reason. For the overwhelming majority ofJVM projects, they are a wise set of choices.<p>Having seen his work, and his tendency to reinvent the wheel (his original iteration of the Minecraft website used flat files for storage, which is really weird when you&#x27;re writing Java and H2 is right there), I don&#x27;t think he&#x27;s a terribly good Java programmer. Gets stuff done, but doesn&#x27;t work Smart, to use a Spolskyism. He happened to be right in this case. And that&#x27;s cool, but throwing away best practices so contemptuously because they aren&#x27;t applicable in corner cases is at best foolish.",
        "time": 1413907621,
        "type": "comment"
    },
    {
        "by": "purpleturtle",
        "id": 8488018,
        "kids": [
            8488347,
            8488030
        ],
        "score": 6,
        "text": "",
        "time": 1413907633,
        "title": "Stripe: What the Open Source Grant was like",
        "type": "story",
        "url": "http://www.medium.com/@Shapiro/stripe-san-francisco-and-velocity-js-37575e29a51b?p=500#3"
    },
    {
        "by": "secfirstmd",
        "id": 8488019,
        "kids": [
            8488227
        ],
        "parent": 8487942,
        "text": "Agreed. Public interest is a very difficult to define - Snowden vs Celebrate gossip etc. I was being looking for a distraction and was doing a bit of a thought experiment :)",
        "time": 1413907644,
        "type": "comment"
    },
    {
        "by": "alfg",
        "id": 8488020,
        "kids": [
            8488131,
            8488119
        ],
        "parent": 8487939,
        "text": "Yes, you just need to update your nameservers from your domain registrar to use Cloudflare&#x27;s, instead of Digital Ocean.<p><a href=\"https://support.cloudflare.com/hc/en-us/sections/200038206-How-to-change-DNS-at-your-registrar-to-CloudFlare-s-nameservers\" rel=\"nofollow\">https:&#x2F;&#x2F;support.cloudflare.com&#x2F;hc&#x2F;en-us&#x2F;sections&#x2F;200038206-H...</a>",
        "time": 1413907649,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488021,
        "parent": 8487897,
        "time": 1413907706,
        "type": "comment"
    },
    {
        "by": "secfirstmd",
        "id": 8488022,
        "parent": 8487956,
        "text": "Agree. I&#x27;ve heard good stuff about them. Didn&#x27;t mean to lump them in also. Just the overall balance.",
        "time": 1413907710,
        "type": "comment"
    },
    {
        "by": "frobozz",
        "id": 8488023,
        "parent": 8486711,
        "text": "Yes, but at the potential expense of grade-bearing classes, and because grades seem to be important, grade-bearing classes tend to take a higher priority than interesting non-grade bearing ones.<p>At university, I audited several modules, and there were many that I wanted to attend, but couldn&#x27;t, either due to timetabling clashes with the classes I was supposed to attend, or because the process for attending classes in disciplines entirely unrelated to my subject was prohibitive.<p>When the workload expected of me grew too great, I reduced my participation or dropped out of my audited classes.<p>With the removal of grades (and compulsory modules) entirely, I might have dropped some of my graded modules in favour of others.",
        "time": 1413907726,
        "type": "comment"
    },
    {
        "by": "semenko",
        "id": 8488024,
        "parent": 8488004,
        "text": "Yeah, it looks like more reasonably priced U2F&#x2F;FIDO tokens are coming soon, probably to the Play Store.<p>Behind the scenes, the auth layer in Chrome is handled by a sneaky extension. There&#x27;s a <i>huge</i> listing of product IDs in the manifest, all likely to launch very soon:\n<a href=\"https://chromium.googlesource.com/chromium/src.git/+/master/chrome/browser/resources/cryptotoken/manifest.json\" rel=\"nofollow\">https:&#x2F;&#x2F;chromium.googlesource.com&#x2F;chromium&#x2F;src.git&#x2F;+&#x2F;master&#x2F;...</a><p>(And some explicit Play Store references: <a href=\"https://chromium.googlesource.com/chromium/src.git/+/c6b104c56f131bb6d1e70909f2708884f57aab9b\" rel=\"nofollow\">https:&#x2F;&#x2F;chromium.googlesource.com&#x2F;chromium&#x2F;src.git&#x2F;+&#x2F;c6b104c...</a> )",
        "time": 1413907734,
        "type": "comment"
    },
    {
        "by": "gwern",
        "id": 8488025,
        "score": 5,
        "text": "",
        "time": 1413907740,
        "title": "Mathematics in the Age of the Turing Machine",
        "type": "story",
        "url": "http://arxiv.org/abs/1302.2898"
    },
    {
        "by": "gwern",
        "id": 8488026,
        "kids": [
            8488506,
            8488339
        ],
        "score": 22,
        "text": "",
        "time": 1413907745,
        "title": "The Lyme Wars",
        "type": "story",
        "url": "http://www.newyorker.com/reporting/2013/07/01/130701fa_fact_specter?currentPage=all"
    },
    {
        "by": "jmulho",
        "id": 8488027,
        "parent": 8487268,
        "text": "Windows 7 is worse.  It is like find what you are looking for on Mt. Everest while looking through a tiny 6 inch by 3 inch view port.",
        "time": 1413907748,
        "type": "comment"
    },
    {
        "by": "gwern",
        "id": 8488028,
        "score": 1,
        "text": "",
        "time": 1413907748,
        "title": "“Publication bias in the social sciences: Unlocking the file drawer”",
        "type": "story",
        "url": "https://pdf.yt/d/ZTzcsTMzDeUPKhiq"
    },
    {
        "by": "GrantByrneApps",
        "id": 8488029,
        "kids": [
            8488351,
            8488047
        ],
        "parent": 8487306,
        "text": "4 million seems like such an odd limit for a system. I&#x27;m not sure what number that were using to store the counter for the call limit.",
        "time": 1413907755,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488030,
        "parent": 8488018,
        "time": 1413907756,
        "type": "comment"
    },
    {
        "by": "coreyja",
        "id": 8488031,
        "kids": [
            8488165
        ],
        "parent": 8487982,
        "text": "This seems to working for my. &quot;Esc&quot; closes all the examples. Mac OSX Yosemite - Chrome 38",
        "time": 1413907758,
        "type": "comment"
    },
    {
        "by": "achr2",
        "id": 8488032,
        "parent": 8487556,
        "text": "That was quite impressive. Hadn&#x27;t seen this tech before.  I wonder how well the eye&#x2F;brain can interpolate a discrete number of focal planes?",
        "time": 1413907759,
        "type": "comment"
    },
    {
        "by": "chrisBob",
        "id": 8488033,
        "kids": [
            8488116
        ],
        "parent": 8487306,
        "text": "I am going to go put the number for the local police department in my cell phone. I can always call them directly.",
        "time": 1413907771,
        "type": "comment"
    },
    {
        "by": "Kequc",
        "id": 8488034,
        "parent": 8483138,
        "text": "It has a lot of features that aren&#x27;t needed in modern application development. I just need indexible columns. Arrays were added later so you have to include a module, I mean maybe it&#x27;s just a feeling but it all feels dated.<p>More importantly it isn&#x27;t elastic. Constructing a heavy load or large database server cluster is difficult. More complicated than it should be. If there is on offer an elastic solution with simple arrays built in, I&#x27;m all over it right now.<p>Blob support in postgresql is seen as something you shouldn&#x27;t do as a best practice. If it&#x27;s a data store then what I want is to be able to use it to store data easily without a fuss. Postgresql is the king right now and I use it but I&#x27;m very open to looking at alternatives.",
        "time": 1413907781,
        "type": "comment"
    },
    {
        "by": "aroman",
        "id": 8488035,
        "parent": 8487863,
        "text": "Yes, and that&#x27;s exactly OP&#x27;s point — it&#x27;s a narrow market.",
        "time": 1413907795,
        "type": "comment"
    },
    {
        "by": "fidotron",
        "id": 8488036,
        "parent": 8487919,
        "text": "I was more struck that it misrepresented what biomimetics is.<p>There are interesting biomimetic things in display tech derived from butterly wings, which the wikipedia page conveniently mentions <a href=\"https://en.wikipedia.org/wiki/Biomimetics#Display_technology\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Biomimetics#Display_technology</a>",
        "time": 1413907823,
        "type": "comment"
    },
    {
        "by": "digi_owl",
        "id": 8488037,
        "parent": 8479565,
        "text": "Compare that mentality to trying to get a big new subsystem into the kernel.<p>Torvalds is likely to require you to hammer out all the details and debugging in a separate tree. This even more so if it is replacing a tested, stable and maintained subsystem.<p>As such, it is the Systemd proponents that should be doing a fork. And run it alongside stable for a time to demonstrate that it works. Then people can move over at their own pace.",
        "time": 1413907823,
        "type": "comment"
    },
    {
        "by": "pendilly",
        "dead": true,
        "id": 8488038,
        "score": 1,
        "text": "Creating the future has never been that simple.<p>Pendilly lets you send texts, pictures and videos which become available to the recipient at a time you choose. Before that time, the recipient will simply receive a notification that someone anonymously sent them a message with a reason why it was sent. How the content should be viewed, the name of the sender, and the type of content, are displayed when the message is received.<p>Pendilly dares to do things out of the ordinary and believes sharing differently can add more value to messages, pictures and videos. \nWe aim at empowering people to dare to create the future. We do that by using time and tags to send messages into the future with more emotions and more fun.<p>Time is a precious and powerful emotional medium which connects us on a deeper level.<p>Pendilly is a French based startup which dares day in day out to build a new temporal experience in messaging and remains laser-focused on delivering ever-increasing emotional value to its community.<p>Team Pendilly<p>www.pendilly.com",
        "time": 1413907825,
        "title": "Can it be so simple to create the future?",
        "type": "story",
        "url": ""
    },
    {
        "by": "matt_h",
        "id": 8488039,
        "score": 4,
        "text": "",
        "time": 1413907828,
        "title": "Were we contacted by aliens in 1977?",
        "type": "story",
        "url": "http://www.bbc.co.uk/guides/zqdbgk7"
    },
    {
        "by": "mtmail",
        "id": 8488040,
        "parent": 8487802,
        "text": "Summary: if the target domain is hosted by Godaddy, use their domain buying service because they might have contact information that goes beyond what WHOIS shows.",
        "time": 1413907829,
        "type": "comment"
    },
    {
        "by": "sharmi",
        "id": 8488041,
        "parent": 8487897,
        "text": "Thanks muraiki and michaelochurch.  This is a similar frustration I faced. The moocs often seem to teach you just enough that is similar to formula substitution, everything starts to crumble when you depart towards data that&#x27;s significantly different. So I have begun from the bottom starting with MIT&#x27;s Linear Algebra and Harvard&#x27;s Statistics 110. Your comments have validated my journey though this is going to be a long one.",
        "time": 1413907847,
        "type": "comment"
    },
    {
        "by": "aragot",
        "id": 8488042,
        "parent": 8487695,
        "text": "Design isn&#x27;t about us liking those tastes or not. One part is about ergonomy of course, and the other is about looking up-to-date. Just watching the colors of a website&#x2F;app, you could tell which year it was made and whether it&#x27;s well maintained or not.<p>One could ask &quot;Why do we define a fashion, given this fashion costs heaps to everyone in the industry and isn&#x27;t necessarily nice or ergonomic&quot;. Remind that for every free land, humans will populate it, define rules and laws and regulations and fashions and richness, and whether it is good or not it can only go forward, with more laws, regulations, fashions and richness.<p>And taste only tells how close you are with society and how distinct you are from uniformity. <a href=\"http://xkcd.com/915/\" rel=\"nofollow\">http:&#x2F;&#x2F;xkcd.com&#x2F;915&#x2F;</a> So you must both stick to the trend and stay peculiar. The trend is defined by very few &quot;haute couture&quot; designers in the industry and we&#x27;re only adapting it to our clients.",
        "time": 1413907877,
        "type": "comment"
    },
    {
        "by": "SmeelBe",
        "id": 8488043,
        "parent": 8487411,
        "text": "Designmodo was first <a href=\"http://designmodo.com/flat-free/\" rel=\"nofollow\">http:&#x2F;&#x2F;designmodo.com&#x2F;flat-free&#x2F;</a> \nRead the About page on Flat UI Colors.",
        "time": 1413907925,
        "type": "comment"
    },
    {
        "by": "chaghalibaghali",
        "id": 8488044,
        "parent": 8487964,
        "text": "The ground&#x27;s surface wouldn&#x27;t matter - skateboards are generally limited to (or at least work best on) flat, smooth surfaces.",
        "time": 1413907927,
        "type": "comment"
    },
    {
        "by": "MarkMc",
        "id": 8488045,
        "parent": 8484645,
        "text": "I hold the opposite view for one reason: The iPhone itself.<p>With 85% of new phones running Android [1] I think it&#x27;s only a matter of time before the &#x27;app gap&#x27; tilts in Android&#x27;s favor. At that point it will be game over for iPhone.<p>On a more personal note I have found my $420 Nexus 5 to be on par with an $869 iPhone 6 - and that can&#x27;t be good for Apple&#x27;s long-term financial health.<p>[1] <a href=\"http://bgr.com/2014/07/31/android-vs-ios-vs-windows-phone-vs-blackberry/\" rel=\"nofollow\">http:&#x2F;&#x2F;bgr.com&#x2F;2014&#x2F;07&#x2F;31&#x2F;android-vs-ios-vs-windows-phone-vs...</a>",
        "time": 1413907928,
        "type": "comment"
    },
    {
        "by": "edouardb",
        "id": 8488046,
        "score": 9,
        "text": "",
        "time": 1413907939,
        "title": "Instant Docker running on ARM cloud servers",
        "type": "story",
        "url": "http://labs.online.net/try-it"
    },
    {
        "by": "Zikes",
        "id": 8488047,
        "parent": 8488029,
        "text": "40 million, according to the article at the moment.<p>Edit: Thinking it might be because they limited the variable to a specific number of bits, I checked to see if any maxed out around that number.  25 bits max out at 33,554,431 and 26 bits at 67,108,863.",
        "time": 1413907948,
        "type": "comment"
    },
    {
        "by": "yanonymator",
        "id": 8488048,
        "kids": [
            8488181,
            8488200,
            8488086,
            8488088
        ],
        "parent": 8487115,
        "text": "Good luck plugging a USB key into your iPad, or letting your security-sensitive workplace let you plug arbitrary USB keys into your workstation, or convincing your bank that you really did not send your entire balance to Nigeria, even though you signed that transaction with a tap, etc etc...<p>Remember Mt.Gox?  That&#x27;s Yubico&#x27;s most public failure so far :-)<p>Strong authentication needs to be out-of-band, and support transaction signing, and work everywhere, or there&#x27;s no point using it.  You can&#x27;t get &quot;out of band&quot; with anything that you &quot;plug in&quot; - that&#x27;s simply connecting it directly to the same threats.<p>You also can&#x27;t get &quot;secure&quot; when less than 100% of users can enjoy it&#x27;s protection - it only needs to &quot;not work&quot; on one model of iPad, and it opens up the door to support bugs like  &quot;I can&#x27;t log in to XYZ from my iPad 2&quot; - so they need to give customers alternate access methods, like printable codes or recovery&#x2F;bypass emails etc, at which point the entire protection goes out the window because that&#x27;s just what the phishing gangs need to bypass it all.<p>Solving half the problem, even if you paint it blue and write lots of nice publicity about it, does not a secure solution make!",
        "time": 1413907951,
        "type": "comment"
    },
    {
        "by": "splintercell",
        "id": 8488049,
        "parent": 8485710,
        "text": "This demo(Clicking on &#x27;start training&#x27; button) takes me to some spanish site <a href=\"http://synaptic.juancazala.com/wiki.html\" rel=\"nofollow\">http:&#x2F;&#x2F;synaptic.juancazala.com&#x2F;wiki.html</a>",
        "time": 1413907952,
        "type": "comment"
    },
    {
        "by": "bobcostas55",
        "id": 8488050,
        "parent": 8487308,
        "text": "I don&#x27;t know, I think a lot of the design trends right now are being driven by touch interfaces. When the mode of interaction is the ridiculously inaccurate finger, you HAVE to have giant swathes of empty space, otherwise nobody is able to actually hit what they want.",
        "time": 1413907960,
        "type": "comment"
    },
    {
        "by": "ZygmuntZ",
        "id": 8488051,
        "score": 1,
        "text": "If your company is looking to hire machine learning or data science people, you might want to post an ad (free for now):<p>http:&#x2F;&#x2F;fastml.com&#x2F;jobs&#x2F;<p>FastML gets more than 10k unique visitors a month (14k in September 2014), according to Google Analytics. About one-third to one-half of them come from the US, the rest from countries like China, India, UK, Russia, Germany etc.",
        "time": 1413907974,
        "title": "Show HN: An experimental machine learning job board at fastml.com",
        "type": "story",
        "url": ""
    },
    {
        "by": "chrisdone",
        "id": 8488052,
        "parent": 8487838,
        "text": "I think if you&#x27;re the kind of user who just wants an editor that does things for you, you&#x27;d be better off sticking with what you have already chosen that satisfies your list of features. Deciding to use Emacs for its features is a bad reason.<p>If you&#x27;re interested in Emacs for its extensibility then I would consider it a worthy investment. Go through the tutorial, find out how to query docs, extend keybindings and modes and things like that, and then I would recommend my Elisp programming guide: <a href=\"https://github.com/chrisdone/elisp-guide\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chrisdone&#x2F;elisp-guide</a>",
        "time": 1413907983,
        "type": "comment"
    },
    {
        "by": "jcagalawan",
        "id": 8488053,
        "kids": [
            8488079
        ],
        "parent": 8487642,
        "text": "Slight clipping issue <a href=\"http://imgur.com/TKAk41f\" rel=\"nofollow\">http:&#x2F;&#x2F;imgur.com&#x2F;TKAk41f</a>",
        "time": 1413907994,
        "type": "comment"
    },
    {
        "by": "cmpb",
        "id": 8488054,
        "parent": 8487883,
        "text": "There are of course more functional approaches to delaying execution of code in Javascript, e.g. by using a callback (which this library supports).",
        "time": 1413908011,
        "type": "comment"
    },
    {
        "by": "nitrogen",
        "id": 8488055,
        "parent": 8486540,
        "text": "Do you use any certificate-related extensions?  If not, you may want to install one that compares certs to those seen by others, just to see if anything interesting occurs.  Also, check for any unexpected trusted CAs.  I&#x27;ve seen a system infected by malware that adds a CA that was signed by a leaked Microsoft key.",
        "time": 1413908014,
        "type": "comment"
    },
    {
        "by": "lnco",
        "id": 8488056,
        "kids": [
            8488060
        ],
        "score": 1,
        "text": "",
        "time": 1413908015,
        "title": "Display media content for your web site or app with Magneticmediajs",
        "type": "story",
        "url": "https://www.magneticmediajs.com/"
    },
    {
        "by": "pjc50",
        "id": 8488057,
        "kids": [
            8488210
        ],
        "parent": 8487928,
        "text": "Does this apply to other professional job markets?",
        "time": 1413908017,
        "type": "comment"
    },
    {
        "by": "jessedhillon",
        "id": 8488058,
        "kids": [
            8488208
        ],
        "parent": 8487883,
        "text": "Sweet Alert came up before and people made this same pedantic and unimaginative addition -- I honestly think this comment serves only to let everyone know that the commenter understands the Javascript execution model. That the thread stops while a native alert is shown is not quite a bug, but I&#x27;d argue not a desired feature either.<p>But given that window.alert has (apparently) two functions:<p>- Display a message to a user<p>- Block javascipt execution until a button is pressed<p>This is a great replacement for those who are using it for #1, which in my experience, is probably &gt;99% of its usage in the wild. If you&#x27;re using window.alert to, say, synchronize the beginning of an event with a user click this probably will work just fine too. If you need the world to stop until a button is pressed, I&#x27;d sooner guess that your application is written poorly.",
        "time": 1413908023,
        "type": "comment"
    },
    {
        "by": "kolencherry",
        "id": 8488059,
        "kids": [
            8488103
        ],
        "parent": 8487957,
        "text": "Why not use WebRTC for streaming the video?",
        "time": 1413908026,
        "type": "comment"
    },
    {
        "by": "lnco",
        "id": 8488060,
        "parent": 8488056,
        "text": "Magneticmediajs is a JavaScript jQuery based library that allows media content (images, videos, maps, HTML &amp; more) to be displayed in a memorable way. It includes several unique features like a magnifying glass tool, greatly eases the task of working with social media platforms like Youtube or Instagram and is bundled with a documented API to control your media.",
        "time": 1413908028,
        "type": "comment"
    },
    {
        "by": "benbreen",
        "id": 8488061,
        "kids": [
            8488478
        ],
        "score": 6,
        "text": "",
        "time": 1413908039,
        "title": "Does evolutionary theory need a rethink?",
        "type": "story",
        "url": "http://www.nature.com/news/does-evolutionary-theory-need-a-rethink-1.16080?WT.mc_id=TWT_NatureNews"
    },
    {
        "by": "IgorPartola",
        "id": 8488062,
        "kids": [
            8488100
        ],
        "parent": 8487874,
        "text": "First, where would I carry this key? My phone is always with me, while my keys are not. (Yes, I know I could use the exercise to go get them when I am home, etc.). I also am not fond of attaching my entire keychain to the USB port of my laptop: I have broken several USB ports on older laptops this way. Taking the USB key off the keychain will inevitably result in me losing this small item (that&#x27;s knowing me, not the same for everyone obviously).<p>Second, the GA-style 2FA works great because it&#x27;s so easy to support and so many things support it. TFA mentions more browser support. Well, I use 2FA for more than just the web. For example, ssh supports it. I am all for this becoming a standard and being more widely adopted, but the security vs usability tradeoff for me here is just not worth it. With these physical tokens I get marginally better security than with the GA app, while giving me a much worse experience.",
        "time": 1413908042,
        "type": "comment"
    },
    {
        "by": "yanonymator",
        "id": 8488063,
        "parent": 8487437,
        "text": "They pay upwards of $100k+ per year to have a seat on the board and direct the &quot;standard&quot; to suit their products.",
        "time": 1413908086,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488064,
        "time": 1413908087,
        "type": "story"
    },
    {
        "by": "vezzy-fnord",
        "id": 8488065,
        "parent": 8487790,
        "text": "As well as upower (though it still works with ConsoleKit as fallback, I think), udisks2, the Weston compositor and some other programs. Binary distros also have some pretty skewed dependency chains on systemd for packages where it&#x27;s inessential.<p>It&#x27;ll only grow, though. Most certainly.",
        "time": 1413908093,
        "type": "comment"
    },
    {
        "by": "e271828",
        "id": 8488066,
        "parent": 8486278,
        "text": "There is a geometric way to solve this, requiring only graph paper and a straight edge.<p>If x is the number of chickens sold in the morning, and y is the number sold after lunch, then the straight line x+y=10 represents all possible values of x and y for the first farmer. Of course, this allows fractional chickens, so the true set of possible values is the set of points where x and y have integer values.<p>Now you can draw parallel lines to this first line for x+y=16 and x+y=26, representing valid x and y values for the second and third farmer.<p>Now, if you take any other line that intersects these 3 lines, then that line can be represented by the equation ax+by=35, for some value of a and b. The key observation then is that if we interpret a and b as the morning and afternoon prices respectively, then the points where this line intersects each of the 3 parallel lines represents the x and y values for each farmer such that that farmer&#x27;s net earnings are $35.<p>So now the problem reduces to placing a straight edge on your paper and finding a line that passes through integer points on each of the 3 parallels.<p>This is pretty easy - start with the edge at (0,26) for farmer 3 and (1,15) for farmer 2 and see if it intersects the first line at an integer point - it doesn&#x27;t. Keep going and you&#x27;ll find a nice intersection at (0,26), (5,11) and (8,2). Unfortunately the corresponding prices don&#x27;t round nicely to cents, but you can shift the entire line to the right to get the  right answer: (1,25), (6,10) and (9,1), corresponding to prices of $3.75 and $1.25.",
        "time": 1413908109,
        "type": "comment"
    },
    {
        "by": "ig1",
        "id": 8488067,
        "kids": [
            8488198
        ],
        "parent": 8487077,
        "text": "The primary bottleneck among most top-tier VCs is partner time and travelling is a huge time-sink. Hence why most VCs tend to focus over a relatively small areas.<p>If a VC is looking at investing in a startup in a location where they have no activity then they&#x27;re going to have to do trips out just for that specific startup (for due diligence, board meetings, etc.) and they&#x27;re also going to have a harder time providing value-add (lack of local contacts, etc.)<p>Hence for a startup outside of a cluster to be worthwhile it has to be significantly better than the local dealflow and the deal has to be of a significant size. So such deals are always likely to be a rarity.<p>(Having a founder who&#x27;s already built and sold a billion dollar company also helps immensely; if you&#x27;re in that small category of people you can probably raise money regardless of where you&#x27;re based)",
        "time": 1413908110,
        "type": "comment"
    },
    {
        "by": "jonsterling",
        "id": 8488068,
        "parent": 8484905,
        "text": "Conor McBride &amp; friends have been working on Frank (here&#x27;s a recent draft paper: <a href=\"http://homepages.inf.ed.ac.uk/slindley/papers/frankly-draft-march2014.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;homepages.inf.ed.ac.uk&#x2F;slindley&#x2F;papers&#x2F;frankly-draft-...</a>).<p>Frank&#x27;s basically based on an extension of the CBPV calculus. As far as I know, Conor&#x27;s also working on extending the core Frank calculus to the dependently-typed case, though this might take a bit.",
        "time": 1413908169,
        "type": "comment"
    },
    {
        "by": "uwVelocity",
        "id": 8488069,
        "score": 1,
        "text": "",
        "time": 1413908192,
        "title": "VFF – Don’t Think You’re Ready? You’re Probably Wrong",
        "type": "story",
        "url": "http://velocity.uwaterloo.ca/2014/10/vff-dont-think-youre-ready-youre-probably-wrong/"
    },
    {
        "by": "gleenn",
        "id": 8488070,
        "score": 3,
        "text": "",
        "time": 1413908205,
        "title": "Security Key, a simpler kind of two-factor authentication",
        "type": "story",
        "url": "http://www.theverge.com/2014/10/21/7027267/google-launches-support-for-security-key-a-simpler-kind-of-two-factor"
    },
    {
        "by": "jnem",
        "id": 8488071,
        "kids": [
            8488252
        ],
        "parent": 8487892,
        "text": "Wow,you weren&#x27;t kidding, that&#x27;s unforgivably bad, especially for the &quot;UX Gods&quot; at Apple.",
        "time": 1413908225,
        "type": "comment"
    },
    {
        "by": "burke",
        "id": 8488072,
        "parent": 8487343,
        "text": "Wow, that&#x27;s a lot easier than the OS-dependent Syscall6 crap with termios from the &quot;real&quot; solutions I&#x27;ve seen.",
        "time": 1413908245,
        "type": "comment"
    },
    {
        "by": "yanonymator",
        "id": 8488073,
        "parent": 8487761,
        "text": "No, not really - if you&#x27;re a MITM, you control what the user sees, as well as what gets sent to the device, and nothing prevents those 2 things being different.\nYou might <i>SEE</i> that you&#x27;re sending $100 to Grandma, but when you tap the key, you&#x27;re authenticating your entire bank balance to some place in the Bahamas.",
        "time": 1413908255,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488074,
        "parent": 8487936,
        "time": 1413908256,
        "type": "comment"
    },
    {
        "by": "mk4p",
        "id": 8488075,
        "parent": 8487642,
        "text": "I met the most interesting guy once. He was a professor at Columbia and a consultant for Wall Street, helping design UIs for traders.<p>He explained how we process and prioritize visual cues -- how, if an element expands equally to the left AND right of our field of vision, it gets highest priority because it resembles an object heading toward our face.<p>For that reason, he avoided this design for everything except the highest-priority events.<p>Not crapping on your library -- it looks really nice :) But in general, I think it&#x27;s worth considering if it&#x27;s necessary to demand users&#x27; attention all over the place. I think information overload isn&#x27;t solely in the content we consume but how it&#x27;s presented.",
        "time": 1413908281,
        "type": "comment"
    },
    {
        "by": "coreymgilmore",
        "id": 8488076,
        "kids": [
            8488085,
            8488090
        ],
        "parent": 8487642,
        "text": "This is an eerily similar project to something posted a few weeks ago here.  Most notably, the exact same &quot;success&quot; animation.<p><a href=\"https://news.ycombinator.com/item?id=8420902\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8420902</a><p><a href=\"https://github.com/t4t5/sweetalert\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;t4t5&#x2F;sweetalert</a>",
        "time": 1413908285,
        "type": "comment"
    },
    {
        "by": "kjjw",
        "id": 8488077,
        "kids": [
            8488093
        ],
        "parent": 8487943,
        "text": "I don&#x27;t know but where can I get that jigsaw?",
        "time": 1413908285,
        "type": "comment"
    },
    {
        "by": "nemo1618",
        "id": 8488078,
        "kids": [
            8488084
        ],
        "parent": 8487943,
        "text": "Anyone have a not-dead link to the comic he&#x27;s referencing?<p>(looking forward to a future where an image&#x27;s URI is its hash and this problem evaporates)",
        "time": 1413908326,
        "type": "comment"
    },
    {
        "by": "michael_h",
        "id": 8488079,
        "parent": 8488053,
        "text": "And some alignment problems: <a href=\"http://imgur.com/a/ZT6ip\" rel=\"nofollow\">http:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;ZT6ip</a><p>Edit: firefox 24.8.0",
        "time": 1413908332,
        "type": "comment"
    },
    {
        "by": "steanne",
        "id": 8488080,
        "parent": 8487522,
        "text": "i thought xfce required systemd-logind?",
        "time": 1413908338,
        "type": "comment"
    },
    {
        "by": "igouy",
        "id": 8488081,
        "parent": 8480948,
        "text": "&gt;&gt;&quot;Unlike the Benchmarks Game, we aren’t requiring all the test programs for the same language to be identical. This is a controversial rule...&quot;&lt;&lt;<p>Benchmarks Game programs for the same language are not required to be identical. Wilfred Hughes has been asked to correct that misstatement.<p>&gt;&gt;&quot;It’s also not clear how representative the test programs are of typical performance of that language.&quot;&lt;&lt;<p>Without sampling programs &quot;in the wild&quot; how could anyone possibly claim that other programs were &quot;representative&quot;?<p>See <a href=\"http://research.microsoft.com/en-us/projects/jsmeter/\" rel=\"nofollow\">http:&#x2F;&#x2F;research.microsoft.com&#x2F;en-us&#x2F;projects&#x2F;jsmeter&#x2F;</a>",
        "time": 1413908341,
        "type": "comment"
    },
    {
        "by": "TEGames",
        "id": 8488082,
        "score": 1,
        "text": "",
        "time": 1413908342,
        "title": "How Playing Video Games Can Help You Train Your Brain",
        "type": "story",
        "url": "http://blog.totaleclipsegames.com/how-playing-games-helps-you-train-your-brain/"
    },
    {
        "by": "kanamekun",
        "id": 8488083,
        "kids": [
            8488317
        ],
        "score": 5,
        "text": "",
        "time": 1413908347,
        "title": "When It Comes to Market Leadership, Be the Gorilla",
        "type": "story",
        "url": "http://firstround.com/article/When-it-Comes-to-Market-Leadership-Be-the-Gorilla"
    },
    {
        "by": "fredsted",
        "id": 8488084,
        "kids": [
            8488387
        ],
        "parent": 8488078,
        "text": "Here you go: <a href=\"http://mu.ms/f/pxYcdb.png\" rel=\"nofollow\">http:&#x2F;&#x2F;mu.ms&#x2F;f&#x2F;pxYcdb.png</a>",
        "time": 1413908365,
        "type": "comment"
    },
    {
        "by": "michael_h",
        "id": 8488085,
        "kids": [
            8488262
        ],
        "parent": 8488076,
        "text": "Third line on the link:<p><pre><code>   This is just a clone for Bootstrap of the original SweetAlert.</code></pre>",
        "time": 1413908381,
        "type": "comment"
    },
    {
        "by": "amluto",
        "id": 8488086,
        "parent": 8488048,
        "text": "The prototype I&#x27;ve seen requires that you tap it, which is a major step forward.  And I believe that the spec allows it to show something like &quot;google.com&quot; if it had a screen.",
        "time": 1413908403,
        "type": "comment"
    },
    {
        "by": "driverdan",
        "id": 8488087,
        "parent": 8483102,
        "text": "&gt; Pin package versions<p>This is true for any packages you use, not just Docker. For example, rails gems. If you don&#x27;t pin them your app <i>will</i> break at some point on an update. Always manually update packages and test before deploying.",
        "time": 1413908409,
        "type": "comment"
    },
    {
        "by": "nyolfen",
        "id": 8488088,
        "parent": 8488048,
        "text": "were mtgox accounts using yubikeys compromised or something? all i know of was the transaction malleability thing",
        "time": 1413908444,
        "type": "comment"
    },
    {
        "by": "Kequc",
        "id": 8488089,
        "parent": 8487926,
        "text": "Well then it&#x27;s just a matter of taste, I like the nintendo-esque bright colours. If there is a bright green button, a bright blue button and a bright red button I feel what those buttons do before I even read them.",
        "time": 1413908448,
        "type": "comment"
    },
    {
        "by": "shortstuffsushi",
        "id": 8488090,
        "parent": 8488076,
        "text": "It&#x27;s a fork of the repo you mentioned, but with Bootstrap.",
        "time": 1413908452,
        "type": "comment"
    },
    {
        "by": "weiyin",
        "id": 8488091,
        "parent": 8487965,
        "text": "hi tuscany,<p>all solid points, and thanks for your support.<p>we will definitely need to think through abuse, server costs, etc. it&#x27;s a pretty lean setup but still gotta run on mac hardware :)<p>weiyin",
        "time": 1413908479,
        "type": "comment"
    },
    {
        "by": "ultramancool",
        "id": 8488092,
        "kids": [
            8488187
        ],
        "parent": 8487519,
        "text": "Indeed, I&#x27;ve went off on some anti-systemd rants, simply based on its design philsophy, but all I ever wanted was init-system flexibility. I&#x27;m just glad to see that Debian has went in the right direction with this, rather than enforced a lock-in as has been previously suggested and may be the case on many other distributions.",
        "time": 1413908521,
        "type": "comment"
    },
    {
        "by": "jerf",
        "id": 8488093,
        "kids": [
            8488140
        ],
        "parent": 8488077,
        "text": "~5 seconds: <a href=\"http://www.amazon.com/Buffalo-Games-M-C-Escher-Portrait/dp/B00BNUPTDY/ref=sr_1_2?ie=UTF8&amp;qid=1413908497&amp;sr=8-2&amp;keywords=escher+puzzle\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;Buffalo-Games-M-C-Escher-Portrait&#x2F;dp&#x2F;B...</a>",
        "time": 1413908523,
        "type": "comment"
    },
    {
        "by": "amluto",
        "id": 8488094,
        "parent": 8487856,
        "text": "Unfortunately, the FIDO Alliance seems to have forgotten to specify CCID bindings for U2F (i.e. they left out the trivial part of the protocol that would describe how to talk to one of these tokens in a smart card slot or over NFC).  The specs describe USB HID bindings.<p><a href=\"https://fidoalliance.org/specifications/download\" rel=\"nofollow\">https:&#x2F;&#x2F;fidoalliance.org&#x2F;specifications&#x2F;download</a>",
        "time": 1413908529,
        "type": "comment"
    },
    {
        "by": "computerdork",
        "id": 8488095,
        "score": 2,
        "text": "",
        "time": 1413908551,
        "title": "The Final Evolution of the Database: Fusing Java + DB",
        "type": "story",
        "url": "http://projecthierarchy.org"
    },
    {
        "by": "tormeh",
        "id": 8488096,
        "kids": [
            8488205,
            8488137
        ],
        "parent": 8487787,
        "text": "No, it&#x27;s just that asphalt isn&#x27;t worth stealing.",
        "time": 1413908558,
        "type": "comment"
    },
    {
        "by": "emotionalcode",
        "id": 8488097,
        "parent": 8487943,
        "text": "I don&#x27;t know. I like getting close to code, because I like thinking about the people that make each symbol, establish a meaning, weave that into a language, where it is either contextually derived or explicated clearly. I like watching those things change and I like figuring out why some things stay the same. I like selecting words for new concepts, which I am never really sure of whether these things are arbitrary. When I zoom out and generalize enough, everything shares the same fuzziness, these symbols are all puzzle pieces. But when I zoom in, each puzzle piece is the puzzle itself.<p>I grew up enjoying puzzles, logic puzzles, logic books, math books, piece puzzles, riddles, and all the supposedly clever things to that affect. The more involved I become in the world of programming though, I can&#x27;t really say.<p>I have the time to study the complex math and computer science theory sometimes, on the weekend, for fun, and then the code I read through ranges from deeply personalized learning to clear, uniform specifications developed over time periods I have no actual experience understanding what goes on during those time periods. I know the importance behind many theories, and I understand how to apply these things. But I don&#x27;t know why or how it grew.<p>If you want to see a puzzle pattern in code, you will see puzzles everywhere. You can see anything you want to in code, just like every other human creation. Make your own meaning and what not. Code is more art to me than &#x27;Art&#x27; is.",
        "time": 1413908563,
        "type": "comment"
    },
    {
        "by": "mikestew",
        "id": 8488098,
        "parent": 8487087,
        "text": "It could have nothing to do with Amazon being petty. A coworker was complaining of the same thing, only the Chase card that isn&#x27;t supported was some airline-branded card. The rest of his Chase cards are supported.",
        "time": 1413908563,
        "type": "comment"
    },
    {
        "by": "robomartin",
        "id": 8488099,
        "parent": 8486219,
        "text": "You are thinking locally.  Nobody cares where Tesla or Toyota build their cars.  Having your business located &quot;in the largest economy&quot; isn&#x27;t a factor for a huge number of businesses.<p>Another way to put it is:  You can build a massively successful business anywhere in the country.  There is no particular magic in California in this regard.  What is different here is that it cost more to simply exist in this state.  And there&#x27;s far more to it than wages at play.",
        "time": 1413908576,
        "type": "comment"
    },
    {
        "by": "rictic",
        "id": 8488100,
        "kids": [
            8488191
        ],
        "parent": 8488062,
        "text": "Unlike usb drives though you don&#x27;t need to leave this plugged in for more than a couple seconds, which greatly limits the danger of damaging your usb port.",
        "time": 1413908583,
        "type": "comment"
    },
    {
        "by": "asdavis",
        "id": 8488101,
        "parent": 8486587,
        "text": "I believe instead of multiplying the delta by W^t to backpropagate the error from layer l to l-1, you multiply it by a random projection B.  It&#x27;s hard to dig deeper because there doesn&#x27;t appear to be any other information on it except here: <a href=\"http://isis-innovation.com/licence-details/accelerating-machine-learning/\" rel=\"nofollow\">http:&#x2F;&#x2F;isis-innovation.com&#x2F;licence-details&#x2F;accelerating-mach...</a><p>As an aside, are they <i>really</i> trying to patent a slight twist on backpropagation?  That seems pretty counter-productive to me.",
        "time": 1413908606,
        "type": "comment"
    },
    {
        "by": "JSeymourATL",
        "id": 8488102,
        "parent": 8480548,
        "text": "As a practical matter, job boards are passive way to find a job.  Here&#x27;s a solid pro-active resource to give you ideas on a job search, <a href=\"http://www.amazon.com/What-Color-Your-Parachute-2014/dp/1607743620\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;What-Color-Your-Parachute-2014&#x2F;dp&#x2F;1607...</a>",
        "time": 1413908618,
        "type": "comment"
    },
    {
        "by": "TD-Linux",
        "id": 8488103,
        "kids": [
            8488264,
            8488248
        ],
        "parent": 8488059,
        "text": "You don&#x27;t even need to go that complicated. A WebM stream over HTTP is pretty easy and would work well for this.",
        "time": 1413908645,
        "type": "comment"
    },
    {
        "by": "Buge",
        "id": 8488104,
        "kids": [
            8488239
        ],
        "parent": 8487779,
        "text": "I have a Yubikey and it isn&#x27;t read only. You can customize how it works with software they provide.",
        "time": 1413908667,
        "type": "comment"
    },
    {
        "by": "valas",
        "id": 8488105,
        "kids": [
            8488336
        ],
        "parent": 8487943,
        "text": "Google and Facebook long ago stopped asking (or at least now they discourage their interviewers from asking) puzzle-like questions in their SWE interviews.",
        "time": 1413908669,
        "type": "comment"
    },
    {
        "by": "pseudometa",
        "id": 8488106,
        "parent": 8486172,
        "text": "The Verge has a better video on the device: <a href=\"http://www.theverge.com/2014/10/21/7025795/riding-hendos-hoverboard-levitation\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theverge.com&#x2F;2014&#x2F;10&#x2F;21&#x2F;7025795&#x2F;riding-hendos-hov...</a>",
        "time": 1413908685,
        "type": "comment"
    },
    {
        "by": "asdavis",
        "id": 8488107,
        "parent": 8486111,
        "text": "It looks like there are still reverse signals (eg., deltas), but they are multiplied by a random matrix B instead of the usual transpose of the weight matrix for that layer.  Am I misunderstanding?",
        "time": 1413908709,
        "type": "comment"
    },
    {
        "by": "decentrality",
        "id": 8488108,
        "kids": [
            8488446
        ],
        "parent": 8487642,
        "text": "This really needs to be added to <a href=\"http://jsdelivr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jsdelivr.com</a> so we can package it in with existing CDN calls.<p>There seem to be very sparse examples of how to deploy the library properly, only to implement it.<p>Visually great. Cool how there&#x27;s the ability to catch responses and work in the same modal further.",
        "time": 1413908723,
        "type": "comment"
    },
    {
        "by": "dntrkv",
        "id": 8488109,
        "parent": 8485715,
        "text": "Another difference is that many people use the iPad as a secondary machine. They have their phone with them at all times. So if the iPad is a little sluggish at times, you won&#x27;t be too bothered. But if your phone is being slow, you&#x27;re gonna want to replace it right away. I think that factor, combined with the upgrade cycle, resulted in many people buying an iPad, and except for the really hardcore Apple fans, have just kept that same iPad up until today. Again this is all based on speculation, but from what I have seen from average iPad owners (not techies in the SF bubble) they are happy with their iPad 2&#x2F;3 purchases even now.<p>Also don&#x27;t forget to consider that when the time to upgrade an iPad comes up, you can decide not to upgrade it and wait until it&#x27;s completely dead or whatever. With the iPhone, you can usually sell your 2 year old phone for at least $200 and use that for a free upgrade to the next model. Since most people are gonna keep their plans for that time frame anyway, it&#x27;s stupid not to use the subsidy.",
        "time": 1413908726,
        "type": "comment"
    },
    {
        "by": "afhammad",
        "id": 8488110,
        "kids": [
            8488448
        ],
        "score": 13,
        "text": "",
        "time": 1413908727,
        "title": "Concurrency with Actors, Goroutines and Ruby",
        "type": "story",
        "url": "https://www.igvita.com/2010/12/02/concurrency-with-actors-goroutines-ruby/"
    },
    {
        "by": "bguthrie",
        "id": 8488111,
        "kids": [
            8488184
        ],
        "parent": 8487943,
        "text": "Puzzles are a terrifically poor way of judging whether a candidate will be good at performing the most common form of programming there is: solving meaningful problems, often business or interface ones, in a simple and readable way. Your primary audience for this type of programming is other humans. I&#x27;ll take a good writer over a puzzle-solver any day. Don&#x27;t get discouraged if they aren&#x27;t for you.",
        "time": 1413908754,
        "type": "comment"
    },
    {
        "by": "nickff",
        "id": 8488112,
        "parent": 8486427,
        "text": "&gt;<i>&quot;reasonably secure government-operated authentication system&quot;</i><p>Do you believe that the government can keep private information on a need-to-know basis?  There is a lot of evidence they cannot.[1]<p>[1] <a href=\"http://en.wikipedia.org/wiki/LOVEINT\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;LOVEINT</a>",
        "time": 1413908755,
        "type": "comment"
    },
    {
        "by": "smacktoward",
        "id": 8488113,
        "kids": [
            8488278,
            8488159,
            8488406,
            8488270,
            8488196,
            8488149
        ],
        "parent": 8487943,
        "text": "<i>&gt; I’ve been programming for 18 years now.</i><p>Then congratulations, you are a programmer!<p>Despite what you&#x27;ll hear from people peddling various flavors of Kool-Aid, &quot;programmer&quot; isn&#x27;t a personality type. It&#x27;s a job description. If you program, you are a programmer, end of line, full stop. Don&#x27;t let anyone convince you otherwise.",
        "time": 1413908762,
        "type": "comment"
    },
    {
        "by": "darkFunction",
        "id": 8488114,
        "kids": [
            8488213
        ],
        "parent": 8487943,
        "text": "I dislike puzzles too. I guess because you&#x27;re just finding the creator&#x27;s predefined path, and it often feels like a pointless task. Programming is coming up with original solutions of your own, so I don&#x27;t see the two as wholly related.",
        "time": 1413908764,
        "type": "comment"
    },
    {
        "by": "fullofcrap",
        "id": 8488115,
        "parent": 8487872,
        "text": "You&#x27;ve created a nice showpiece.  However, it&#x27;s still a horrible design trend, and it&#x27;s probably the work user experience element I&#x27;ve seen used in recent years.  This is the equivalent of the animated gifs of the 90&#x27;s.  Under construction and dancing baby being the most common.  Adding distraction rather than focusing on content has never been a successful strategy, and I hope it never does.<p>It will course correct eventually.  I&#x27;m hoping sooner.",
        "time": 1413908768,
        "type": "comment"
    },
    {
        "by": "exhilaration",
        "id": 8488116,
        "parent": 8488033,
        "text": "You should do that anyway. Calling 911 from a mobile phone is likely to take you to a regional dispatch center, not your local police department [1].<p>I&#x27;ve called 911 twice from my mobile phone to report an accident I passed on the highway.  Once nobody picked up, even after several attempts with perfect service.  The second time I spoke to someone who obviously wasn&#x27;t a 911 operator but assured me she&#x27;d pass my message to right people.<p>[1] <a href=\"http://www.theverge.com/2014/10/3/6414949/911-call-failures-fcc\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theverge.com&#x2F;2014&#x2F;10&#x2F;3&#x2F;6414949&#x2F;911-call-failures-...</a>",
        "time": 1413908768,
        "type": "comment"
    },
    {
        "by": "charlesism",
        "id": 8488117,
        "parent": 8487210,
        "text": "On the internet, nobody knows you&#x27;re a dog. With flat design, nobody knows you use MS Paint.",
        "time": 1413908771,
        "type": "comment"
    },
    {
        "by": "pnhoang",
        "id": 8488118,
        "parent": 8487940,
        "text": "It depends on which AppStore country you are looking at. It would be believable in a country different than the US or UK. Being a developer myself, I really don&#x27;t believe on that number. the developer might use a strategy to advertise to his app or getting notice.",
        "time": 1413908776,
        "type": "comment"
    },
    {
        "by": "abuzafor",
        "id": 8488119,
        "parent": 8488020,
        "text": "Thanks for commenting....",
        "time": 1413908777,
        "type": "comment"
    },
    {
        "by": "zafiro17",
        "id": 8488120,
        "parent": 8484346,
        "text": "Yes!  There&#x27;s a healthy community at comp.misc where we post stuff like this article, and sci.misc where we post non comp stuff.  In fact you&#x27;ll see a healthy correlation between articles posted to Ycombinator that are subsequently posted and discussed on comp.misc and now sci.misc.  Good place to get a free Usenet account is Solani.org now that Albasani and AIOE are somewhat over-subscribed.",
        "time": 1413908798,
        "type": "comment"
    },
    {
        "by": "Eiriksmal",
        "id": 8488121,
        "parent": 8481555,
        "text": "Is that still true, Magnificent Cursors Creator? This morning, I finished it and, if I&#x27;m remembering my pre-coffee activities correctly, a few more stages after it and never reached the end.",
        "time": 1413908800,
        "type": "comment"
    },
    {
        "by": "TheMakeA",
        "id": 8488122,
        "parent": 8487957,
        "text": "We&#x27;ve actually experimented with jsmpeg for this type of thing. The problem we ran into was that jsmpeg seemed to require every frame from ffmpeg. If the browser or network slowed, the feed would fall behind the simulation, leading to several seconds of latency when interacting.<p>We&#x27;d love to use it and appreciate your hard work though. Do you have any ideas on how that problem can be solved?",
        "time": 1413908814,
        "type": "comment"
    },
    {
        "by": "malandrew",
        "id": 8488123,
        "parent": 8486684,
        "text": "After I bought my ticket. There was nothing on the site that said &quot;This price is for Argentine nationals only&quot;. I was absolutely livid when I was in the office where I had to pick up the ticket. IIRC I told them that they deserved the banking crisis meltdown for commerce shenanigans like the one they were pulling (this was about one year after those events).",
        "time": 1413908821,
        "type": "comment"
    },
    {
        "by": "xngzng",
        "id": 8488124,
        "score": 4,
        "time": 1413908823,
        "title": "Apple iPhone 6 Plus camera review",
        "type": "story",
        "url": "http://connect.dpreview.com/post/6303555427/apple-iphone-6-plus-camera-review"
    },
    {
        "by": "rictic",
        "id": 8488125,
        "kids": [
            8488189
        ],
        "parent": 8487768,
        "text": "Huh, that&#x27;s odd. I just registered a second google account with the same security key and everything seems to have gone fine. I&#x27;d recommend filing a bug and&#x2F;or posting more details here.",
        "time": 1413908825,
        "type": "comment"
    },
    {
        "by": "thisGuysAccount",
        "id": 8488126,
        "parent": 8484439,
        "text": "Depends on what&#x27;s in the file ;)",
        "time": 1413908836,
        "type": "comment"
    },
    {
        "by": "dnautics",
        "id": 8488127,
        "parent": 8486610,
        "text": "they did.  I went to such a school (<a href=\"https://en.wikipedia.org/wiki/Hb_woodlawn\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Hb_woodlawn</a>).  It was a public &#x27;magnet&#x27; or &#x27;charter before the concept of charter&#x27; school.<p>My class was 70 students.  Although being in Arlington meant &quot;solidly middle class&quot;, among some notables (modestly achieved, not super-famous) from my graduating class (1999) include:  Stephen Ridley, who is CEO of xipiter, the company making USB condoms which have been featured here.  Fabian Bouthillette, former assistant to Gore Vidal and author of &quot;Gore Vidal&#x27;s last stand&quot; (<a href=\"http://www.amazon.com/Gore-Vidals-Last-Stand-Initiation-ebook/dp/B00JVCF8FU\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;Gore-Vidals-Last-Stand-Initiation-eboo...</a>), Adam Berninger founder of a advertisement and design firm, and Naomi Uyama, world champion swing dancer and band-leader.<p>Steven and Naomi got to where they were without finishing (or in Naomi&#x27;s case ever going to) college, which is funny since H-B always was proud of its college matriculation rate.<p>5 entrepreneurs out of 70 isn&#x27;t that bad, I think!  (I&#x27;m 90% of the way to being &quot;modestly achieved&quot;)",
        "time": 1413908870,
        "type": "comment"
    },
    {
        "by": "evo_9",
        "id": 8488128,
        "score": 2,
        "time": 1413908892,
        "title": "Some Millennials – And Their Parents – Are Slow to Cut the Cord",
        "type": "story",
        "url": "http://www.npr.org/2014/10/21/356951640/some-millennials-and-their-parents-are-slow-to-cut-the-cord"
    },
    {
        "by": "delecti",
        "id": 8488129,
        "kids": [
            8488224,
            8488333
        ],
        "parent": 8487943,
        "text": "The problem isn&#x27;t with him, it&#x27;s with programmers who have an inflated view of how smart you have to be to be a programmer.<p>There are plenty of smart programmers, and there are plenty of problems that would benefit from smart programmers, but the vast majority of problems just need a spark of creativity and a lot of hard work from a person with a reasonable base of knowledge.",
        "time": 1413908897,
        "type": "comment"
    },
    {
        "by": "emodendroket",
        "id": 8488130,
        "kids": [
            8488188
        ],
        "parent": 8487642,
        "text": "Why would I use this instead of the built-in modals?  Seems like it does the same thing.",
        "time": 1413908901,
        "type": "comment"
    },
    {
        "by": "abuzafor",
        "id": 8488131,
        "parent": 8488020,
        "text": "That&#x27;s mean there is no additional configuration needed? If no configuration needed then It must be like this <a href=\"http://www.bloggingguts.com/settings-up-cloudflare-cdn-website/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloggingguts.com&#x2F;settings-up-cloudflare-cdn-websi...</a> ?<p>Thanks!!",
        "time": 1413908922,
        "type": "comment"
    },
    {
        "by": "marktangotango",
        "id": 8488132,
        "parent": 8486178,
        "text": "What does this need to be useful for real work? Ie serve html?  A network stack, file system, process mgmt?",
        "time": 1413908926,
        "type": "comment"
    },
    {
        "by": "armandososa",
        "id": 8488133,
        "parent": 8487151,
        "text": "I think that modern ui design is being approached more like package (graphic) design. That is: when your product is displaying on shelves with ten similar products you need to make it flashier and more colorful, yet similar to everything else in the same category. All cereal package design looks similar, yet, everyone tries to outflash everyone else.<p>For some reason, we designers are still designing with this mentality.",
        "time": 1413908927,
        "type": "comment"
    },
    {
        "by": "TD-Linux",
        "id": 8488134,
        "parent": 8487548,
        "text": "Works OK on Firefox OS. The base layer scrolls perfectly, but the other ones update at a lower framerate. Desktop Firefox has the same behavior when APZ is enabled.",
        "time": 1413908929,
        "type": "comment"
    },
    {
        "by": "logfromblammo",
        "id": 8488135,
        "parent": 8486186,
        "text": "I once heard a story from an old man, about wrestling at a small town school.  He was in a very light weight class, such that when the school played matches against other schools, the opposing team might not even have anyone in his class.  So rather than sit and watch, he wrestled above his weight class.  Instead of seeking to win, sought to delay the pin as long as possible.  So he practiced neck bridges, and developed the thickest neck on a skinny kid that you have ever seen.  He took his own version of victory--namely that the heavier wrestler could not score a pin on him within the match time limit--from what might otherwise be considered defeat.  There was no possibility of true victory, only the choice between aristeia--doing the best you possibly can--and resignation to defeat.<p>There was no expectation that anyone owed him a fair match.  He just tackled the challenge before him to the best of his ability, and lost every time, until he finally won.<p>And now he has an interesting story to tell, for as long as he can keep the reaper from pinning him.",
        "time": 1413908933,
        "type": "comment"
    },
    {
        "by": "area51org",
        "id": 8488136,
        "kids": [
            8488194
        ],
        "parent": 8487943,
        "text": "People tend to presume that everyone thinks the way do. In this case, everyone solves problems and thinks about programming the same way, right?<p>I&#x27;ve always had a more narrative approach to coding. Until I read some of the stuff Larry Wall (Perl) has written about how he thinks, I&#x27;d assumed I was a giant freak. Not at all.",
        "time": 1413908941,
        "type": "comment"
    },
    {
        "by": "lotsofmangos",
        "id": 8488137,
        "kids": [
            8488391
        ],
        "parent": 8488096,
        "text": "The driveway scam is generally done with stolen asphalt from roadway construction. I know this from a professional con artist who has had a long career in this kind of shenanigans.",
        "time": 1413908946,
        "type": "comment"
    },
    {
        "by": "ceras",
        "id": 8488138,
        "parent": 8486321,
        "text": "Here&#x27;s an article of how excessive cash hoarding by corporations hurts Asian economies, and what they could do to improve: <a href=\"http://www.economist.com/news/leaders/21620203-japanese-and-south-korean-firms-are-worlds-biggest-cash-hoarders-hurts-their\" rel=\"nofollow\">http:&#x2F;&#x2F;www.economist.com&#x2F;news&#x2F;leaders&#x2F;21620203-japanese-and-...</a>",
        "time": 1413908958,
        "type": "comment"
    },
    {
        "by": "ntaso",
        "id": 8488139,
        "parent": 8487792,
        "text": "It is especially terrible, if you use your mouse wheel to scroll and not a swiping gesture on a trackpad. Parallax just looks horribly with a mouse wheel.",
        "time": 1413908959,
        "type": "comment"
    },
    {
        "by": "willis77",
        "id": 8488140,
        "kids": [
            8488449
        ],
        "parent": 8488093,
        "text": "Apparently a web search is not the kind of puzzle he wanted to solve.",
        "time": 1413908963,
        "type": "comment"
    },
    {
        "by": "scott_karana",
        "id": 8488141,
        "parent": 8487944,
        "text": "Maybe the UI is nicer, but the permissions on Android are unnecessarily intrusive, which—to me—is a dealbreaker with a <i>2FA manager</i>.<p><pre><code>  Device &amp; app history\n      read sensitive log data\n  \n  Identity\n      find accounts on the device\n  \n  Camera&#x2F;Microphone\n      take pictures and videos\n  \n  Wi-Fi connection information\n      view Wi-Fi connections\n  \n  Other\n      receive data from Internet\n      access Bluetooth settings\n      pair with Bluetooth devices\n      full network access\n      view network connections\n      control vibration\n      prevent device from sleeping\n      send sticky broadcast\n\n</code></pre>\nContrast this with Google Authenticator:<p><pre><code>  Identity\n      find accounts on the device\n  \n  Other\n      control vibration\n      full network access\n      use accounts on the device\n      create accounts and set passwords\n      close other apps\n</code></pre>\n<a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2\" rel=\"nofollow\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.google.and...</a>",
        "time": 1413908963,
        "type": "comment"
    },
    {
        "by": "davvolun",
        "id": 8488142,
        "parent": 8484486,
        "text": "I don&#x27;t see where this is premature optimization. You, and the author, clearly know a lot about the field and the nature of the problem, so you&#x27;re already past the &#x27;premature&#x27; portion. If I know from the start that I&#x27;ve got a function that <i>will</i> be called 10,000 times per second, there&#x27;s no reason I should write the un-optimized version first. That&#x27;s like starting every sort off with a bubble sort; I don&#x27;t need to optimize to quick sort switching off to insertion as appropriate from the beginning of coding, but I know I can do better than bubble from the get-go.<p>Defining &quot;premature optimization&quot; as the less hyperbolic &quot;optimization before we know we need it,&quot; I think it&#x27;s clear that the problem you&#x27;ve written shows you already know you need it!",
        "time": 1413908967,
        "type": "comment"
    },
    {
        "by": "B-n-c",
        "id": 8488143,
        "kids": [
            8488313,
            8488237
        ],
        "parent": 8487813,
        "text": "I understand those are the web technologies, but how is this being run in the back? Tons of mac servers, with multiple IOS simulators on each? One running per user on the mac? Custom software to control and pass through to the socket?<p>Care to shed any light as to an overview on how the backend works? I&#x27;ve always been curious since I first saw App.io",
        "time": 1413908978,
        "type": "comment"
    },
    {
        "by": "thisGuysAccount",
        "id": 8488144,
        "parent": 8486075,
        "text": "People have gone to jail for doing exactly what this looks like it could be -- clicking on a link, sent by a friend, containing material stolen in a data breach.<p>I didn&#x27;t know what was in there. I&#x27;m not really interested in finding out what was in there, by having to talk to police about something the next time I fly somewhere.",
        "time": 1413908992,
        "type": "comment"
    },
    {
        "by": "fourstar",
        "id": 8488145,
        "score": 1,
        "text": "",
        "time": 1413909003,
        "title": "French Researchers develop quick Ebola diagnosis device",
        "type": "story",
        "url": "http://www.english.rfi.fr/africa/20141021-french-researchers-develop-quick-ebola-diagnosis-device"
    },
    {
        "by": "execat",
        "id": 8488146,
        "parent": 8487642,
        "text": "The way the alert comes in is very annoying.<p>The homepage doesn&#x27;t tell me if I can customize the animation.",
        "time": 1413909019,
        "type": "comment"
    },
    {
        "by": "tjaerv",
        "id": 8488147,
        "parent": 8487145,
        "text": "SQLite does seem to have that effect of inspiring other public domain works: <a href=\"http://unlicense.org\" rel=\"nofollow\">http:&#x2F;&#x2F;unlicense.org</a>",
        "time": 1413909032,
        "type": "comment"
    },
    {
        "by": "ntaso",
        "id": 8488148,
        "parent": 8487880,
        "text": "I tried to buy a theme from themeforest and it&#x27;s extremely hard to fine one that is NOT completely polluted with CSS animations and parallax effects. I wish you were right, but just from the top-selling themes of marketplaces like themeforest, it seems that the trend is still quite big, unfortunately.",
        "time": 1413909056,
        "type": "comment"
    },
    {
        "by": "fullofcrap",
        "id": 8488149,
        "kids": [
            8488327,
            8488365
        ],
        "parent": 8488113,
        "text": "I think there are categories, and we haven&#x27;t figured out what to call them yet or how to define them.  I see archetypes emerging over the years, and patterns.  I&#x27;ve worked with career programmers that are done at 5:00pm, and never crack a book.  They work fine in their niche, and when layoff come, they&#x27;re working tech support.  I know others that love problems but can&#x27;t seem to make their ideas become manifest, yet kludge snippets from StackOverflow to create a product.  I personally live for challenge, I learn new languages and tech as a hobby, and lead growth and change in every org I&#x27;ve worked for.  Often at the cost of health, and relationships.  We&#x27;re all programmers, but we&#x27;re not all the same.",
        "time": 1413909079,
        "type": "comment"
    },
    {
        "by": "digi_owl",
        "id": 8488150,
        "parent": 8478354,
        "text": "Ok, somebody has clearly jumped the shark!",
        "time": 1413909098,
        "type": "comment"
    },
    {
        "by": "dchichkov",
        "id": 8488151,
        "parent": 8486344,
        "text": "A somewhat unrelated question. It seems like beacons broadcasting their GPS location at 978 MHz (30cm) from altitude could be used to measure parameters of the atmosphere. Take 3 frequency-locked receivers, separated by a few meters, and it seems like, one can get the wind vector along the line of the airplane&#x2F;receiver.  Feasible?",
        "time": 1413909100,
        "type": "comment"
    },
    {
        "by": "icantthinkofone",
        "id": 8488152,
        "parent": 8487080,
        "text": "You don&#x27;t have to be older. twm is available on FreeBSD and I&#x27;m sure it can be installed on Linux.",
        "time": 1413909104,
        "type": "comment"
    },
    {
        "by": "Felecro",
        "id": 8488153,
        "score": 2,
        "text": "",
        "time": 1413909104,
        "title": "The Updatable WebView on Android 5.0 – what is it and why should you care?",
        "type": "story",
        "url": "https://www.infinum.co/the-capsized-eight/articles/the-updateable-webview-on-android-5-lollipop-what-is-it-and-why-should-you-care"
    },
    {
        "by": "jonnathanson",
        "id": 8488154,
        "parent": 8486890,
        "text": "<i>&quot;journalists are extremely lazy by default, and need their stories pre-drafted and handed to them&quot;</i><p>This seems to be a consensus opinion on HN. I have no idea if it&#x27;s a majority opinion, but it&#x27;s fairly typical. The &quot;journalists are lazy&#x2F;stupid&#x2F;inept&quot; argument generally misunderstands what journalists do, how they work, and how they pick (or, as is more often the case, how they&#x27;re assigned) their coverage. If anything, it gives some journalists <i>too much</i> credit, and for the wrong things.<p>I&#x27;m not a professional journalist, though I&#x27;ve written frequently for some major and minor publications. My typical process looks like this:<p>1. Pitch a bunch of story ideas to my editor.<p>2. Have 99% of those ideas rejected for various reasons: too narrow; too wonky; not enough meat on the bone [1]; not timely enough [2].<p>3. Settle on a topic that is somehow deemed acceptably timely, broad, approachable to general audiences, and well substantiated by some degree of data or prior coverage.<p>The astute reader will start to see how objections [1] and [2] come into direct conflict. By definition, breaking something <i>new</i> means covering ground that hasn&#x27;t been covered before (or at least not often, or not in depth). But having prior substantiation often means being able to point to pre-existing coverage, as proof that your topic is of some interest to the public. [3] Also, you have to sort this all out on a deadline: anything from the end of the day to the end of the week, per story. (As an exercise: try investigating, substantiating, and beautifully composing an in-depth story in a single working day).<p>[3] The public, as typically defined, is a <i>very</i> broad swath of readers. Even major tech sites, like TechCrunch, now have a very broad readership -- with highly varying degrees of technical sophistication, subject-matter expertise, and topical interests.<p>On the flip side, look at any of the blogs or publications that HN readers respect. Chances are, they write in greater depth. They are not afraid to get into the wonky, technical details of their coverage. They don&#x27;t just give you charts and infographics; they give you their statistical reasoning. Niche publications can do this.<p>Broad publications theoretically can, but often choose not to, out of the belief that the effort&#x2F;payoff ratio just isn&#x27;t there. It&#x27;s a lot of effort that will appeal to only a sliver of their readerships. Deep coverage, or investigative coverage, or breaking new ground, requires a shitload of hard work. It is <i>extremely</i> tough on a standard deadline. It often requires a dedicated budget, and a broadly extended deadline, just to ensure that the writer(s) can afford to develop it.<p>Bottom line: I don&#x27;t disagree with you. Most tech journalism sucks. That said, I don&#x27;t blame the writers <i>per se</i>. They are the proximate end of a very long chain. Maybe some of them are capable of writing the stories we&#x27;d want to read. Maybe not. But they don&#x27;t get the chance in the first place.<p>Before we impugn the entire field of journalism, let&#x27;s be clear which publications, and which branches of journalism, we&#x27;re impugning. It&#x27;s silly to paint the whole field with one brush.",
        "time": 1413909111,
        "type": "comment"
    },
    {
        "by": "zafiro17",
        "id": 8488155,
        "parent": 8485657,
        "text": "A slightly different target audience, but here is my Woodnotes Guide to Emacs for Writers (not Coders).  It will get you used to the editor, at least.  I use Firefox plus the &quot;It&#x27;s all text&quot; extension (configured to call emacs as its editor) for happy times on forums like this one.\n<a href=\"http://therandymon.com/index.php?/archives/197-Woodnotes-Guide-to-Emacs-for-Writers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;therandymon.com&#x2F;index.php?&#x2F;archives&#x2F;197-Woodnotes-Gui...</a>",
        "time": 1413909134,
        "type": "comment"
    },
    {
        "by": "iainkfraser",
        "id": 8488156,
        "parent": 8488014,
        "text": "I thought so, we&#x27;re using OpenVPN and policy based routing. Yes the advanced settings allows you to enter your own config file. I think other tech people found it interesting due to simplicity of UI rather than tech behind it.<p>We have other features that far more impressive technically that we will release soon. Seems like people don&#x27;t mind me posting here so I&#x27;ll continue to do so :)",
        "time": 1413909136,
        "type": "comment"
    },
    {
        "by": "joshreads",
        "id": 8488157,
        "score": 1,
        "text": "",
        "time": 1413909147,
        "title": "A peek at the code behind Facebook",
        "type": "story",
        "url": "http://www.itworld.com/article/2834760/a-peek-at-the-code-behind-facebook.htm"
    },
    {
        "by": "mkm416",
        "id": 8488158,
        "score": 6,
        "text": "",
        "time": 1413909163,
        "title": "Company directors are deep-sixing Google links citing ‘right to be forgotten’",
        "type": "story",
        "url": "http://fortune.com/2014/10/21/company-directors-deep-sixing-google-links/"
    },
    {
        "by": "raverbashing",
        "id": 8488159,
        "kids": [
            8488366
        ],
        "parent": 8488113,
        "text": "Exactly this<p>This also applies to:<p>- Having a Github page<p>- Contributing to Open Source Projects<p>- Knowing (or not) a certain language<p>- Knowing (or not) a certain technology<p>- Knowing one of the latest fads<p>Of course, this affects whether you can work on certain projects or not, but not that &quot;every programmer knows that&quot; is a fallacy (except for something really fundamental)",
        "time": 1413909171,
        "type": "comment"
    },
    {
        "by": "DesignRive",
        "dead": true,
        "id": 8488160,
        "score": 1,
        "time": 1413909182,
        "title": "Caravan – IceSoft – We Build Premium WordPress Themes and Plugins",
        "type": "story",
        "url": "http://icesoft.md/project/caravan/#.VEaKupA9fuc.hackernews"
    },
    {
        "by": "mnarayan01",
        "id": 8488161,
        "parent": 8487373,
        "text": "You can use the same spacing for the ampersands as used for the semicolons (i.e. at the end of the line).<p>That said, obviously there&#x27;s going to be different preferences...I was more wondering if there was some semantic difference.",
        "time": 1413909198,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488162,
        "parent": 8487943,
        "time": 1413909199,
        "type": "comment"
    },
    {
        "by": "kenrikm",
        "id": 8488163,
        "kids": [
            8488384
        ],
        "parent": 8487778,
        "text": "Very Difficult, I own a house in Hollywood Fl,(Well.. close enough Miramar), There&#x27;s a reason I live in the Bay Area now and rent my house.",
        "time": 1413909210,
        "type": "comment"
    },
    {
        "by": "robomartin",
        "id": 8488164,
        "parent": 8486219,
        "text": "&gt; You are welcome to move to a place that permits employees to be abused.<p>I had to reply to this one separately.<p>Sorry brother, this statement is ridiculous on the face of it.  No state, city or town in the US is characterized by having rules allowing employees to be abused.  That&#x27;s just nonsense. I suggest you might want to stop exaggerating as it does little to help one take your point of view seriously.  No law in the US allows employees to be abused.  California isn&#x27;t magical in any way in this regard.  Stop spinning.",
        "time": 1413909212,
        "type": "comment"
    },
    {
        "by": "mandeepj",
        "id": 8488165,
        "parent": 8488031,
        "text": "It is working on &quot;Primary&quot;, &quot;Info&quot; , &quot;Success&quot; etc examples but not on &quot;basic example&quot;, &quot;A title with a text under&quot;",
        "time": 1413909223,
        "type": "comment"
    },
    {
        "by": "ZaneClaes",
        "id": 8488166,
        "score": 1,
        "text": "",
        "time": 1413909227,
        "title": "Success Is an Evil Tyrant (and Makes Us All Miserable)",
        "type": "story",
        "url": "http://lifebyexperimentation.com/2014/10/success-is-a-tyrant/"
    },
    {
        "by": "paulandre",
        "dead": true,
        "id": 8488167,
        "score": 1,
        "text": "",
        "time": 1413909229,
        "title": "SmartRecruiters LinkedIn Recruiter Integration",
        "type": "story",
        "url": "https://www.smartrecruiters.com/product/linkedin/"
    },
    {
        "by": "williamldennis",
        "id": 8488168,
        "score": 1,
        "text": "",
        "time": 1413909234,
        "title": "Fog of War in Real Life",
        "type": "story",
        "url": "http://www.producthunt.com/posts/hopscotch-4"
    },
    {
        "by": "nawitus",
        "id": 8488169,
        "parent": 8487085,
        "text": "But the Rift has a very high FOV compared to what many AR applications require. If you only need to draw a relatively small AR object instead of drawing the whole FOV, 1080p goes a long way.<p>Kinda like the 1080p laptop screen in front of me is cleary enough, but stretching that to the whole FOV decreases the pixel density too much.",
        "time": 1413909273,
        "type": "comment"
    },
    {
        "by": "nyolfen",
        "id": 8488170,
        "parent": 8488013,
        "text": "it uses an OTP so even if they intercepted it, it wouldn&#x27;t be useful",
        "time": 1413909284,
        "type": "comment"
    },
    {
        "by": "the_cat_kittles",
        "id": 8488171,
        "parent": 8487943,
        "text": "there are a number of ways to be a good programmer: being a skilled puzzle solver &#x2F; algorithmist is one of them, being good at designing apis is another, deciding what even needs to be built is another.",
        "time": 1413909289,
        "type": "comment"
    },
    {
        "by": "brandonmenc",
        "id": 8488172,
        "kids": [
            8488275
        ],
        "parent": 8487943,
        "text": "Yes. I hate puzzles too, and so do most of the other programmers I actually like hanging out with.<p>I know this is a &quot;me too&quot; post, but that&#x27;s kind of what you&#x27;re looking for.",
        "time": 1413909296,
        "type": "comment"
    },
    {
        "by": "Pxtl",
        "id": 8488173,
        "parent": 8487964,
        "text": "Because hoverboard.  That&#x27;s really the beginning and the end of it.  It&#x27;s not supposed to be better at anything.  It&#x27;s a hoverboard.",
        "time": 1413909307,
        "type": "comment"
    },
    {
        "by": "freshbreakfast",
        "id": 8488174,
        "kids": [
            8488359
        ],
        "score": 10,
        "text": "",
        "time": 1413909322,
        "title": "Guide to Music Crowdfunding – Part 1: Fans with Benefits",
        "type": "story",
        "url": "http://bryank.im/fanswbenefits"
    },
    {
        "deleted": true,
        "id": 8488175,
        "parent": 8487936,
        "time": 1413909336,
        "type": "comment"
    },
    {
        "by": "jmulho",
        "id": 8488176,
        "kids": [
            8488229
        ],
        "parent": 8487910,
        "text": "The colors at flatuicolors.com are anything but easy on they eyes.  Furthermore, in the flat designs I have seen you find out that a rectangle isn&#x27;t a button when you click on it and nothing happens.",
        "time": 1413909350,
        "type": "comment"
    },
    {
        "by": "mzs",
        "id": 8488177,
        "parent": 8486563,
        "text": "-w",
        "time": 1413909354,
        "type": "comment"
    },
    {
        "by": "semenko",
        "id": 8488178,
        "parent": 8487115,
        "text": "No one has mentioned the coolest feature of U2F&#x2F;Fido auth: TLS Channel IDs.<p>Via an internal Chrome extension (&quot;cryptotoken&quot;), authentication state &amp; the handshake can be bound to a specific TLS session -- preventing cookie theft. Incredibly cool: <a href=\"http://www.browserauth.net/channel-bound-cookies\" rel=\"nofollow\">http:&#x2F;&#x2F;www.browserauth.net&#x2F;channel-bound-cookies</a>",
        "time": 1413909367,
        "type": "comment"
    },
    {
        "by": "NDizzle",
        "id": 8488179,
        "parent": 8487642,
        "text": "Just in time for Halloween! Scary, jarring alerts.",
        "time": 1413909373,
        "type": "comment"
    },
    {
        "by": "zdean",
        "dead": true,
        "id": 8488180,
        "score": 1,
        "text": "",
        "time": 1413909396,
        "title": "UT Study Finds Fish Just Wanna Have Fun",
        "type": "story",
        "url": "http://tntoday.utk.edu/2014/10/20/study-finds-fish-just-wanna-have-fun/"
    },
    {
        "by": "saganus",
        "id": 8488181,
        "parent": 8488048,
        "text": "Can you please explain or give sources on why Mt.Gox is Yubi&#x27;s most public failure?<p>I started using Yubikey some months ago and this is news to me, so any info would be appreciated.",
        "time": 1413909401,
        "type": "comment"
    },
    {
        "by": "digi_owl",
        "id": 8488182,
        "parent": 8478237,
        "text": "Looks to me like all Systemd does it move the logic from the init file itself and into a binary blob inside init.<p>And that blob is going to be harder to debug, never mind fix, on a production system. While your manager is breathing down your neck about getting it back up ASAP.",
        "time": 1413909418,
        "type": "comment"
    },
    {
        "by": "sp332",
        "id": 8488183,
        "parent": 8487943,
        "text": "<a href=\"https://news.ycombinator.com/item?id=6583580\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=6583580</a> Dear startups: stop asking me math puzzles to figure out if I can code",
        "time": 1413909425,
        "type": "comment"
    },
    {
        "by": "am391",
        "id": 8488184,
        "parent": 8488111,
        "text": "&gt; I&#x27;ll take a good writer over a puzzle-solver any day<p>Absolutely agree, but I&#x27;d extended it to good communicator. Communication touches on so much of what we do as programmers, be it talking to customers, sharing ideas amongst a team or writing code in a way that&#x27;s readable by others, that it should be a primary concern.",
        "time": 1413909436,
        "type": "comment"
    },
    {
        "by": "dEnigma",
        "id": 8488185,
        "parent": 8486922,
        "text": "Thank you for this little riddle, I like how it sounds almost like a joke until you realise what the last piece of info actually means.",
        "time": 1413909456,
        "type": "comment"
    },
    {
        "by": "Sir_Cmpwn",
        "id": 8488186,
        "parent": 8487035,
        "text": "Another option that made the rounds on HN somewhat recently:<p><a href=\"https://github.com/Russell91/sshrc/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Russell91&#x2F;sshrc&#x2F;</a>",
        "time": 1413909460,
        "type": "comment"
    },
    {
        "by": "RexRollman",
        "id": 8488187,
        "kids": [
            8488486
        ],
        "parent": 8488092,
        "text": "Would you like your Debian with Unix or Windows flavoring? ;)<p>Seriously though, I am not really sure how I feel about this. While systemd obviously has benefits, I just can&#x27;t shake the feeling that it goes against the Unix paradiam. But then again, I also prefer xterms and a window manager over a desktop environments like KDE, Xfce, and Gnome, so maybe that explains my mixed feelings.",
        "time": 1413909460,
        "type": "comment"
    },
    {
        "by": "danneu",
        "id": 8488188,
        "parent": 8488130,
        "text": "When you want a nice looking off-the-shelf feedback modal with a simple API without depending on Bootstrap JS and the entirety of jQuery.",
        "time": 1413909464,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488189,
        "parent": 8488125,
        "time": 1413909467,
        "type": "comment"
    },
    {
        "by": "karl_gluck",
        "id": 8488190,
        "parent": 8487943,
        "text": "Definitively: Yes!<p>Everyone has their own preferences. Like you, I lose interest in puzzles after a few minutes. Whatever it is that gives some people great satisfaction out of finding that one missing piece, I didn&#x27;t get it.<p>I can&#x27;t speak to your experience, but for me, I like architecture. Finding the right way to glue pieces together is actually very interesting to me. I basically implemented reflection in C++ before I even knew that&#x27;s what it&#x27;s called because I thought it would be fun. I enjoy debugging and assembly optimizations.<p>What I found is that this speaks to the difference between a prototypical Software Engineer and Computer Scientist.<p>Engineers are interested in getting stuff done efficiently, and not just in CPU cycles--time for coding, training new coders, maintenance, extensibility, and how often the code will ever be run all must be taken into account. In my experience, grabbing someone else&#x27;s solution via a package manager or using a 10-minute brute-force solution to a very hard problem can be the most &quot;efficient&quot;. Just throw comments on it and avoid the puzzle so you can get something working. Of course, be sure to isolate the code so that if it ends up being a hotspot it&#x27;s easy to fix later.<p>Computer Scientists, on the other hand, seek that efficient solution. Many of the PhD candidates I encountered were optimizing very specific cases of very hard problems (largely related to distributed computing). They enjoy spending time picking apart algorithms and understanding the problem so thoroughly that they can prove, confidently, that they have the most efficient solution to any given problem.<p>In the end, each broad category relies on its partner, and all programmers have to have some of both. Some of us just lean harder to one side than the other.",
        "time": 1413909487,
        "type": "comment"
    },
    {
        "by": "IgorPartola",
        "id": 8488191,
        "parent": 8488100,
        "text": "In my experience USB ports break when you insert&#x2F;remove plugs, not from static strain. You insert something too large, or too awkward, an suddenly you need a new motherboard.",
        "time": 1413909490,
        "type": "comment"
    },
    {
        "by": "p4bl0",
        "id": 8488192,
        "parent": 8487746,
        "text": "Ah, <i>that</i>&#x27;s cool! Thanks.",
        "time": 1413909493,
        "type": "comment"
    },
    {
        "by": "SatvikBeri",
        "id": 8488193,
        "parent": 8486484,
        "text": "An even sillier bruteforce lets you reproduce the problem almost verbatim: let a and b be the daytime and nighttime prices, let x, y, and z be the number of chickens sold during the day by each farmer.<p><pre><code>  [(a, b, x, y, z) for a in xrange(1, 500) for b in xrange(1, a) for x in xrange(1, 11) for y in xrange(1, x) for z in xrange(1, y) if 3500 == a*x + b*(10 - x) == a*y + b*(16 - y) == a*z + b*(26 - z)]</code></pre>",
        "time": 1413909514,
        "type": "comment"
    },
    {
        "by": "Kluny",
        "id": 8488194,
        "parent": 8488136,
        "text": "Has he got a blog?",
        "time": 1413909519,
        "type": "comment"
    },
    {
        "by": "krisdol",
        "id": 8488195,
        "parent": 8486863,
        "text": "Wait, what he&#x27;s saying is that it&#x27;s not obvious that View -&gt; Toolbars -&gt; Navigation Toolbar toggles the visibility of the navigation toolbar? I still have nothing but pure distaste for the current &quot;I can look like Chrome, too!&quot; UI decision of Firefox, and I&#x27;m just going to get more peeved as they kill off more features for pure stylistic sake.<p>So in the future I&#x27;ll have to browse through another 6 dozen &#x27;classic options&#x27; add-ons until I find one that is maintained, compatible, does what it claims, and hopefully doesn&#x27;t break my privacy?<p>Sounds great that the company that puts &quot;Your Privacy First&quot; finds that untrusted third parties are the best providers of core functionality that should have been in the browser to begin with.",
        "time": 1413909527,
        "type": "comment"
    },
    {
        "by": "pfortuny",
        "id": 8488196,
        "parent": 8488113,
        "text": "Yes. We need to stop thinking of programmers as artists and more as artisans. This is not a devaluation, this is exactly what it is and a very necessary job. Each shoemaker used to be proud of his shoes, even though there are not so many different ways to make them. Less so in the early modern ages.",
        "time": 1413909537,
        "type": "comment"
    },
    {
        "by": "j_baker",
        "id": 8488197,
        "parent": 8487943,
        "text": "I&#x27;d like to point out that the Google quote is not from Google&#x27;s webpage and is in fact likely a banned interview question. The facebook quote on the other hand is from their webpage on a tool that <i>is</i> used for recruiting.",
        "time": 1413909543,
        "type": "comment"
    },
    {
        "by": "LogicX",
        "id": 8488198,
        "kids": [
            8488456,
            8488380
        ],
        "parent": 8488067,
        "text": "I look forward to either disproving this, or being defeated by it. My stance is that great connectivity and communication (think google hangout) combined with cheap flights between Myrtle Beach and Boston can make it happen. Investors may be enticed by additional reasons to head to Myrtle Beach: golf, vacation, warmth.",
        "time": 1413909543,
        "type": "comment"
    },
    {
        "by": "ww520",
        "id": 8488199,
        "parent": 8487943,
        "text": "When you are young and have nothing to show, puzzle solving, like a school degree, is a way for other people to judge you.  When you have experience and track record, puzzle is like meh.  People still using puzzle to judge an experienced developer are not very good in evaluating others.",
        "time": 1413909543,
        "type": "comment"
    },
    {
        "by": "angryasian",
        "id": 8488200,
        "parent": 8488048,
        "text": "I think its pretty obvious that anything without a USB connection this probably won&#x27;t work (maybe usb otg), but would 2FA still be used as a fall back ?",
        "time": 1413909551,
        "type": "comment"
    },
    {
        "by": "declan",
        "id": 8488201,
        "parent": 8487077,
        "text": "Yep, Magic Leap is headquartered in Florida, but they didn&#x27;t get the investment until they opened an office in Palo Alto:<p><a href=\"http://recode.net/2014/10/20/look-who-else-is-joining-google-to-back-magic-leap-the-secret-augmented-reality-startup/\" rel=\"nofollow\">http:&#x2F;&#x2F;recode.net&#x2F;2014&#x2F;10&#x2F;20&#x2F;look-who-else-is-joining-google...</a>\n&quot;People familiar with the company say Magic Leap was having trouble convincing Silicon Valley types to drop everything and move to Hollywood, Fla., where it is based... So it recently opened a Palo Alto, Calif., engineering office...&quot;<p>They&#x27;re currently hiring engineers in Palo Alto:\n<a href=\"https://www.linkedin.com/jobs2/view/14797737\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;14797737</a><p>And their engineering VP for &quot;perception and core software&quot; is based in Palo Alto:\n<a href=\"http://www.linkedin.com/in/garybradski\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;garybradski</a>",
        "time": 1413909553,
        "type": "comment"
    },
    {
        "by": "gtrubetskoy",
        "id": 8488202,
        "parent": 8487979,
        "text": "There is also 925.",
        "time": 1413909601,
        "type": "comment"
    },
    {
        "by": "chintan",
        "id": 8488203,
        "kids": [
            8488382
        ],
        "parent": 8487035,
        "text": "One feedback: It would be great if you can add head&#x2F;title on your webpage. It just helpful when going through my bookmarks at a later date. Thanks again for the awesome tool!<p>&lt;head&gt;\n   &lt;title&gt;VimSwitch: Use Your Vim Settings Everwhere&lt;&#x2F;title&gt;\n &lt;&#x2F;head&gt;",
        "time": 1413909609,
        "type": "comment"
    },
    {
        "by": "mason240",
        "id": 8488204,
        "parent": 8486433,
        "text": "&gt;She also have this conspiracy theory about sport stars returning to sport 3 months after especially bad injuries - they must get stem cells, it&#x27;s impossible otherways.<p>No conspiracy, they are all using HGH. Someone did some analysis on the shortened recovery times for players with ligament tears (like ACLs) and found that while the recovery times have always been getting shorter thanks to improvements in physical therapy, but the there was a dramatic drop at about the time HGH started to be widely used.<p>The NFL just started lasting for HGH last month. The test supposedly is easy to beat, but it will be interesting to see if it has an effect on times.",
        "time": 1413909612,
        "type": "comment"
    },
    {
        "by": "DanBC",
        "id": 8488205,
        "parent": 8488096,
        "text": "Perhaps it&#x27;s a cultural thing?<p>In England there is a scam where builders go door to door offering to fix your driveway.  Part of the scam is offering to do it cheap because they have some left over asphalt from a large job and it needs to be used quick.<p>They then do a terrible job with the stolen asphalt, but cosmetically it looks okay so the householder pays and the crooks leave.",
        "time": 1413909613,
        "type": "comment"
    },
    {
        "by": "chavesn",
        "id": 8488206,
        "kids": [
            8488423
        ],
        "parent": 8487943,
        "text": "Ok, but a <i>jigsaw puzzle</i> is sooo not the kind of <i>puzzle</i> that programming is at all about, even the explicit &quot;puzzle&quot; questions that companies like Facebook dish out.<p>I can&#x27;t even think of one similarity between the two activities.",
        "time": 1413909627,
        "type": "comment"
    },
    {
        "by": "at-fates-hands",
        "id": 8488207,
        "parent": 8487880,
        "text": "One of the reasons is probably because parallax on mobile is a horrendous experience and people have started to catch on to this.<p>I&#x27;ve only seen a handful of companies who can pull it off well. This is probably one of five I feel does it well: <a href=\"http://www.extreme-sensio.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.extreme-sensio.com&#x2F;</a>",
        "time": 1413909642,
        "type": "comment"
    },
    {
        "by": "mnarayan01",
        "id": 8488208,
        "parent": 8488058,
        "text": "&gt; Sweet Alert came up before and people made this same pedantic and unimaginative addition<p>Its presented as a replacement for alert so pointing out that it&#x27;s not a drop-in replacement seems relevant to me at least. Even if most alert usages can easily be replaced by this (somewhat dubious depending on your definition of &quot;easily&quot;), additional work will still need to be done for many (most?) of them.<p>Also being able to add a &quot;blocking&quot; call in JavaScript would be a _big deal_, so noting that this does not do so seems like something worth mentioning.",
        "time": 1413909657,
        "type": "comment"
    },
    {
        "by": "philip1209",
        "id": 8488209,
        "parent": 8486236,
        "text": "I&#x27;m trying to figure out how this works - so it induces a magnetic field in a proper surface?",
        "time": 1413909658,
        "type": "comment"
    },
    {
        "by": "gmarx",
        "id": 8488210,
        "parent": 8488057,
        "text": "I read an article&#x2F;opinion piece a few years ago that posited the reason there are fewer female scientists is because scientist is, on average, a bad choice for a career. The author claimed that contrary to popular opinion, this was just a case of women making more rational choices.",
        "time": 1413909660,
        "type": "comment"
    },
    {
        "by": "drostie",
        "id": 8488211,
        "parent": 8487306,
        "text": "The actual document is available as a PDF from the FCC, here:<p><a href=\"http://transition.fcc.gov/Daily_Releases/Daily_Business/2014/db1017/DOC-330012A1.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;transition.fcc.gov&#x2F;Daily_Releases&#x2F;Daily_Business&#x2F;2014...</a><p>I do not see the &#x27;40 million&#x27; number mentioned in that document, but there are a lot of other legal documents which may be important here.<p>The key problem is that these states offloaded their 911 calls to Intrado, a company which specializes in looking up the closest actual agency which can respond (called a &quot;PSAP&quot; in the jargon). Intrado had to engineer for two time-domain multiplexed (TDM) systems, basically one normal and one legacy. The legacy system served a CAMA[1] system of 911 PSAPs, CAMA just means that the system automatically logged every number and time.<p>Because it was servicing this system which had log numbers, it wrote that CAMA&#x27;s information to some sort of database. (It&#x27;s a little more complicated than that but basically they needed to make unique IDs as part of the CAMA&#x27;s protocol.) The counter could only generate N entries. When it tried to handle more entries, some warning-level notification was raised by software, severe enough to crash the application but not severe enough to emit a warning that would alert Intrado&#x27;s IT staff. All CAMA-routed destination traffic from this Intrado server was affected.<p>It took several hours before they figured out what was wrong, in part because some other 911 system went down at the same time for an unrelated reason and they figured wrongly that they were related. Once they realized what was going on, they rerouted to a backup server which didn&#x27;t have a full log file. This second server was able to handle 911 calls while the original bug was fixed. About 6,600 calls did not make it through the system and were dropped (in the form of a busy signal?) rather than routed. They could have switched over to the backup server immediately, but (a) they missed the warnings that their software was emitting, and (b) they didn&#x27;t understand that the server was the problem.<p>[1] <a href=\"http://en.wikipedia.org/wiki/Automatic_message_accounting\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Automatic_message_accounting</a>",
        "time": 1413909660,
        "type": "comment"
    },
    {
        "by": "m52go",
        "id": 8488212,
        "parent": 8487824,
        "text": "Right, I get that. That&#x27;s why the company <i>wants</i> the capital. It&#x27;s impossible for any young company to <i>need</i> this sum of money at once. But it doesn&#x27;t justify the market giving it to them.<p>The ultimate effect is the entire market got denied a substantial amount of capital (not just ML&#x27;s competitors) in order for a single entity to gamble it.<p>That&#x27;s irresponsible of everyone, founders and investors included. Either acquire, go public, or JV to secure an opportunity. Why sap such a huge swathe of capital from the opportunistic ecosystem?",
        "time": 1413909662,
        "type": "comment"
    },
    {
        "by": "dntrkv",
        "id": 8488213,
        "parent": 8488114,
        "text": "That is exactly how I feel about puzzles. They just feel like such a waste of time, especially jigsaw puzzles. What do you even do with them once you&#x27;re done?",
        "time": 1413909679,
        "type": "comment"
    },
    {
        "by": "sbooks",
        "id": 8488214,
        "score": 1,
        "text": "",
        "time": 1413909682,
        "title": "Six Phrases That Will Change the Way You Do Customer Service",
        "type": "story",
        "url": "http://www.groovehq.com/support/customer-service-phrases"
    },
    {
        "by": "forkliftci",
        "dead": true,
        "id": 8488215,
        "score": 1,
        "text": "",
        "time": 1413909684,
        "title": "Sütlüce Kiralık Forklift Eyüp Forklift Kiralama",
        "type": "story",
        "url": "http://aceleforkliftkiralama.over-blog.com/sutluce-kiralik-forklift-kiralama-eyup.html"
    },
    {
        "by": "xorcist",
        "id": 8488216,
        "parent": 8487541,
        "text": "There are a lot of reasonable criticisms about the systemd family of utilities. I am very skeptical to the utility of binary logging for example. It makes an effort to guarantee integrity but does not make any guarantees and is useless in the face of an adversary.<p>I also have a suspicion there is a more friendly way do what PolicyKit provides, which is not at all very transparent to an administrator. You could easily trust software with privileges without realizing it. There are also concerns about the hard dependency on these utilities for GNOME, but I don&#x27;t use it myself so I don&#x27;t know if the concerns are valid or not.<p>I believe however most of the criticism centered on how udev was dropped as a separate utility, despite concerns from other developers, and the way people who tried to keep feature parity in a stand alone fork was treated. They was basically told they were regarded as downstream developers.<p>This is mostly water under the bridge now of course, but it makes cooperation a lot harder than it should be.",
        "time": 1413909687,
        "type": "comment"
    },
    {
        "by": "eka345",
        "dead": true,
        "id": 8488217,
        "score": 1,
        "time": 1413909690,
        "title": "DANIEL CORMIER || HIGHLIGHTS BEST KNOCKOUT",
        "type": "story",
        "url": "http://www.youtube.com/watch?v=TJ_VuwZ4vVo"
    },
    {
        "by": "GhotiFish",
        "id": 8488218,
        "parent": 8487285,
        "text": "cygwin does it&#x27;s job well.",
        "time": 1413909740,
        "type": "comment"
    },
    {
        "by": "grey-area",
        "id": 8488219,
        "score": 3,
        "text": "",
        "time": 1413909742,
        "title": "New Evidence of the NSA Deliberately Weakening Encryption",
        "type": "story",
        "url": "https://golem.ph.utexas.edu/category/2014/10/new_evidence_of_nsa_weakening.html"
    },
    {
        "by": "neito",
        "id": 8488220,
        "score": 1,
        "text": "",
        "time": 1413909749,
        "title": "Game Dev threatens Gabe Newell after game listed as “Early Access” during a sale",
        "type": "story",
        "url": "http://arstechnica.com/gaming/2014/10/indie-game-pulled-off-steam-after-dev-threatens-gabe-newell-on-twitter/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+arstechnica%2Findex+%28Ars+Technica+-+All+content%29"
    },
    {
        "by": "xtester",
        "id": 8488221,
        "score": 1,
        "text": "",
        "time": 1413909752,
        "title": "Tesla Model S The Car That Updates Itself",
        "type": "story",
        "url": "http://www.motortrend.com/roadtests/oneyear/alternative/1410_2013_tesla_model_s_p85_update_7/#ixzz3GnSWJw3w"
    },
    {
        "by": "ANTSANTS",
        "id": 8488222,
        "parent": 8487837,
        "text": "&gt;It&#x27;s only selfish if they had the resources from the beginning which they didn&#x27;t.<p>As the post mentions, early versions of Minecraft allocated significantly less garbage. You know, the versions programmed by one guy, before they had millions and millions of dollars and a whole team working on it.<p>Yes, Minecraft has changed quite a bit since 1.3, when Notch abdicated the development throne, but really not <i>that much</i> considering it&#x27;s been over 2 years and that Minecraft is a generation&#x27;s Mario. Most of the &quot;slew of new features&quot; came from mods (still no official modding API, either!)<p>&gt;Maybe not enough people cared about the lag vs new features? It&#x27;s not like Minecraft is a competitive FPS where lag matters a lot more.<p>You don&#x27;t understand. The &quot;lag&quot; you described is a constant delay between input and response. An example would be vsync, which in most PC implementations trades an extra frame or two of latency for smooth, tearless video. The problem I was describing is jitter, which is variable delay. One frame may take 10ms, the next may take 100ms+, due to the garbage collector. This is extremely noticeable and annoying when playing Minecraft, because the game locks up temporarily every few seconds and makes even simple actions like walking in a straight line extremely choppy and disorienting. Aside from being unpleasant and breaking &quot;immersion,&quot; it&#x27;s even gotten me killed when a GC cycle kicks in just before a jump and the game misses the jump input. It absolutely affects the experience.<p>&gt;First the Minecraft still doesn&#x27;t have heavy hardware requirements.<p>It kinda does, if you want smooth performance. You can play it on a toaster, sure, if you ratchet the draw distance down and are ok with sub-30 FPS and lots of GC-induced jitter.<p>My point was simply that if you make your game perform worse than it could, you&#x27;re pushing the cost onto the players, and while this is a normal part of the march of computing, at some point it stops being acceptable and you&#x27;re hurting the experience for the average player. IMHO, considering how ridiculously profitable Minecraft is and how little the fundamental gameplay has changed over the years, it stopped being acceptable a long time ago.<p>&gt;Second the cost of computing has been trending downward for decades.<p>That&#x27;s nice, but little kids from all backgrounds love Minecraft. You can&#x27;t just ask an elementary school kid in the projects playing Minecraft at his community center on a donated computer past its prime to upgrade.<p>&gt;Programming Java isn&#x27;t easy especially when you have an existing code base. It&#x27;s even messier when you give precedence to performance.<p>Again, the code performed reasonably well before. The new devs &quot;cleaned it up&quot; without measuring the performance impact of their style changes, and now everyone is paying for it.<p>&gt;If this is so easy, why not just make a better clone to fix the problem?<p>Ah, the old &quot;you can&#x27;t complain because I don&#x27;t see you doing any better&quot; schtick. Take it easy, I don&#x27;t think it&#x27;s so controversial to be perplexed that one of the most successful video game franchises of all time is managed so poorly; for example, you&#x27;d think hiring the Optifine guy would be a no brainer.",
        "time": 1413909783,
        "type": "comment"
    },
    {
        "by": "pepys",
        "id": 8488223,
        "score": 1,
        "text": "",
        "time": 1413909785,
        "title": "Understanding Shakespeare",
        "type": "story",
        "url": "http://labs.jstor.org/shakespeare/"
    },
    {
        "by": "raverbashing",
        "id": 8488224,
        "kids": [
            8488324,
            8488320
        ],
        "parent": 8488129,
        "text": "And then people don&#x27;t know where impostor syndrome come from...<p>With a lot of BS being spewed on the net like &quot;everybody needs to know how to unit test&quot;, &quot;everybody should learn how to use Vagrant&quot;, &quot;everybody should know Ruby&quot;, &quot;knowing the SOLID principles is essential&quot;<p>And then you ask them how to write a regular expression and they fall flat on their face. Or the basics of how to do a Fourier transform. Or how to draw something on a canvas.",
        "time": 1413909795,
        "type": "comment"
    },
    {
        "by": "dnautics",
        "id": 8488225,
        "parent": 8487791,
        "text": "that&#x27;s not what backpropagation is.  Backpropagation is best thought of as a &#x27;cheat&#x27; (algorithmic simplification) that allows you to calculate the derivative of a feed-forward neural net.  You would need to calculate the derivative of a neural net in general to optimize relative to some cost function, you could use, for example, gradient descent, but that is computationally costly.<p>For some neural nets, you still have a gradient, but the concept of back or forward propagation is not defineable.  Based on the topology and structure of biological neural nets, what would you think is the case?",
        "time": 1413909823,
        "type": "comment"
    },
    {
        "by": "robomartin",
        "id": 8488226,
        "parent": 8486240,
        "text": "Sorry, you misunderstood, my fault.  I was only reacting to the comment about California being a place where employees are not abused.  One could very well argue that CA abuses everyone, not just employees.  How much do you pay in taxes, all taxes, not just income tax?  It&#x27;s huge.  Take a a look at our freeways, they are utterly destroyed and being maintained badly.  There&#x27;s a portion of the 5 I travel every day where you have about two miles of seriously messed up road.  The two right lanes are kidney killing.  This is a tax.  How?  Your car gets beat up and your cost of maintenance goes up.  Where is all that money we pay in taxes to maintain our highways?  Stolen to pay ridiculous pensions to government workers.<p>With regards to the phone ruling.  Well, I&#x27;ve been paying a portion of my employee&#x27;s phone bills for, well, I don&#x27;t know, two decades.  Didn&#x27;t know we had to legislate common sense and decency.",
        "time": 1413909823,
        "type": "comment"
    },
    {
        "by": "pooper",
        "id": 8488227,
        "parent": 8488019,
        "text": "if (anthonyWeiner.status == published)\n{\n    publish(JenniferLawrenceStory);\n}<p>Many have expressed doubt that the media reaction would be the same if Kristen Stewart&#x27;s photos were leaked instead.",
        "time": 1413909830,
        "type": "comment"
    },
    {
        "by": "DanBC",
        "id": 8488228,
        "parent": 8487144,
        "text": "Drop a strong magnet down a copper tube - it&#x27;s freaky the first few times you do it.<p><a href=\"http://youtu.be/keMpUaoA3Tg\" rel=\"nofollow\">http:&#x2F;&#x2F;youtu.be&#x2F;keMpUaoA3Tg</a><p>Copper is a bit expensive! I&#x27;d love to know where to get a bit of pipe like that.",
        "time": 1413909844,
        "type": "comment"
    },
    {
        "by": "dntrkv",
        "id": 8488229,
        "parent": 8488176,
        "text": "Well if you can&#x27;t tell if something is a button or not, that is a poor design. If you design consistently, and treat all elements of the same type the same way, there would be no second guessing. It&#x27;s not even hard to do, just requires a bit of planning.",
        "time": 1413909859,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488230,
        "parent": 8487943,
        "time": 1413909860,
        "type": "comment"
    },
    {
        "by": "supster",
        "id": 8488231,
        "score": 1,
        "text": "",
        "time": 1413909862,
        "title": "Thoughts on Public and Private Market Investing",
        "type": "story",
        "url": "http://sapan.svbtle.com/musings-on-markets"
    },
    {
        "by": "semenko",
        "id": 8488232,
        "parent": 8487557,
        "text": "For Google domains, this is handled by an internal Chrome extension called &quot;cryptotoken&quot;. See, e.g. <a href=\"https://chromium.googlesource.com/chromium/src.git/+/master/chrome/browser/resources/cryptotoken\" rel=\"nofollow\">https:&#x2F;&#x2F;chromium.googlesource.com&#x2F;chromium&#x2F;src.git&#x2F;+&#x2F;master&#x2F;...</a><p>For all other domains, there&#x27;s an open-source, pre-release Chrome extension that handles the site&lt;-&gt;token handshakes: <a href=\"https://github.com/google/u2f-ref-code\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;google&#x2F;u2f-ref-code</a>",
        "time": 1413909865,
        "type": "comment"
    },
    {
        "by": "WestCoastJustin",
        "id": 8488233,
        "score": 5,
        "text": "",
        "time": 1413909866,
        "title": "Channel-Bound Cookies",
        "type": "story",
        "url": "http://www.browserauth.net/channel-bound-cookies"
    },
    {
        "by": "kenrikm",
        "id": 8488234,
        "parent": 8487482,
        "text": "I grew up in Fort Lauderdale, I worked there for a while after I finished college and own a house there. (Now in Bay Area) It&#x27;s not just the wages they will have issues with: even if they pay SV rates the talent just is not there. Maybe they go after some Disney people however aside from a limited pool up in the Orlando Area, I&#x27;m pretty sure they are going to need to import a big chunk of the talent and that gets expensive.",
        "time": 1413909895,
        "type": "comment"
    },
    {
        "by": "uselessdguy",
        "id": 8488235,
        "kids": [
            8488487,
            8488385,
            8488372,
            8488435,
            8488466,
            8488390,
            8488440,
            8488389
        ],
        "score": 33,
        "text": "",
        "time": 1413909896,
        "title": "Why pro-systemd and anti-systemd people will never get along",
        "type": "story",
        "url": "http://uselessd.darknedgy.net/ProSystemdAntiSystemd/"
    },
    {
        "by": "leoc",
        "id": 8488236,
        "parent": 8488000,
        "text": "It does seem almost certain they&#x27;re aiming for realistic accommodation, whatever display technology they&#x27;ve chosen to go for.<p><a href=\"http://www.roadtovr.com/what-we-know-about-magic-leap-rumored-500m-investment-funding/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.roadtovr.com&#x2F;what-we-know-about-magic-leap-rumore...</a><p><a href=\"http://www.nytimes.com/2014/07/15/science/taking-real-life-sickness-out-of-virtual-reality.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2014&#x2F;07&#x2F;15&#x2F;science&#x2F;taking-real-life-s...</a>",
        "time": 1413909900,
        "type": "comment"
    },
    {
        "by": "13",
        "id": 8488237,
        "kids": [
            8488315
        ],
        "parent": 8488143,
        "text": "&gt; Tons of mac servers, with multiple IOS simulators on each?<p>Maybe a modified iOS Simulator binary that can run hundreds of instances on a single powerful server, would be by best bet.",
        "time": 1413909910,
        "type": "comment"
    },
    {
        "by": "john_b",
        "id": 8488238,
        "parent": 8487942,
        "text": "&quot;Public interest&quot; in this context is not the same thing as &quot;the interest of the public&quot;. The former is a fairly objective (though difficult to measure) thing which concerns itself with the welfare of the populace [1]. This is historically what was meant by &quot;public interest,&quot; though the newer meaning of &quot;whatever interests the public&quot; has muddied the meaning of the phrase somewhat.<p>[1] <a href=\"http://dictionary.reference.com/browse/public+interest\" rel=\"nofollow\">http:&#x2F;&#x2F;dictionary.reference.com&#x2F;browse&#x2F;public+interest</a>",
        "time": 1413909911,
        "type": "comment"
    },
    {
        "by": "fluidcruft",
        "id": 8488239,
        "parent": 8488104,
        "text": "The attack requires replacing the firmware. As far as I know yubikeys have never been able to update firmware after they&#x27;ve left the factory. In the forums you will see yubico people offering to swap devices because of problems related to outdated firmware.<p>There was also a blog post by yubico confirming that the badusb attack is irrelevant on yubikeys. <a href=\"https://www.yubico.com/2014/08/yubikey-badusb/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.yubico.com&#x2F;2014&#x2F;08&#x2F;yubikey-badusb&#x2F;</a><p>I think the take away is that all the devices are read only except the Neo and the Device Firmware Upgrade (DFU) implementation on the Neo &quot;requires the new firmware image to be signed by [yubico]. Yubico does not endorse nor support use of DFU for users&quot;<p>The Neo also has javacard capability that lets you load applets. In the latest devices unless you purchase the developer editions, the javacard apps cannot be updated.* Setting parameters in the device is different than replacing the firmware. Older Neo&#x27;s allowed you to build and load your own javacard apps.<p>* I&#x27;m not entirely sure about whether in the latest Neos the javacard apps can be updated to new official signed yubikey versions or whether the javacard apps cannot be updated at all...",
        "time": 1413909957,
        "type": "comment"
    },
    {
        "by": "rip747",
        "id": 8488240,
        "parent": 8486801,
        "text": "read the article, visited their website, watched their video.<p>still haven&#x27;t a clue of what they are doing. maybe i&#x27;m a moron. can someone shed some light on what _exactly_ they are getting $542M for?",
        "time": 1413909965,
        "type": "comment"
    },
    {
        "by": "e7620",
        "id": 8488241,
        "parent": 8487645,
        "text": "Here is the message:<p><i>There has been no General Resolution amongst debian package maintainers.\nRed Hat has instituted a regulatory capture of the &quot;bug squashing&quot; committee\nwithin debian (the &quot;Technical Committee&quot;) by having current or former (but\nstock holding) employees moonlight in debian and gradually gain membership\nin that comittie.<p>Once their numbers were sufficient they proceeded to file a bug report on\nthe fact that systemd was not standard in debian.<p>This is illicit abuse of process and they need to be prosecuted.<p>Debian is an unincorporated association. It has bylaws, trade\npractices, and dealings\nby which it was governed. The RedHat associated members of the\nTechnical Committee have illegally and in bad faith abused their\npositions in-order to\nrealize financial and strategic gain for their employer.</i><p>Do you really believe this is hate speech? Hate speech attacks a person or group on the basis of attributes such as gender, ethnic origin, religion, race, disability, or sexual orientation.",
        "time": 1413909972,
        "type": "comment"
    },
    {
        "by": "stal",
        "id": 8488242,
        "score": 1,
        "text": "",
        "time": 1413909988,
        "title": "ConsoleKit is not unmaintained",
        "type": "story",
        "url": "http://www.reddit.com/r/linux/comments/2jwhsn/consolekit_is_not_unmaintained/"
    },
    {
        "by": "yawn",
        "id": 8488243,
        "parent": 8487943,
        "text": "A programmer is one who programs.  You are a programmer.<p>There are many reasons people program.  For me personally, it&#x27;s to make stuff and put it out there.  Companies have to have methods of weeding people out, and some of them pick those puzzles.",
        "time": 1413910001,
        "type": "comment"
    },
    {
        "by": "eitally",
        "id": 8488244,
        "parent": 8486116,
        "text": "Perhaps they don&#x27;t have the homegrown ability, but when they restrict access to a market of 1b+ consumers, that helps &quot;convince&quot; a lot of companies to do it for them.  You probably remember this: <a href=\"http://www.heydary.com/publications/Inside-the-Rim-Decrypting-the-Blackberry.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.heydary.com&#x2F;publications&#x2F;Inside-the-Rim-Decryptin...</a>",
        "time": 1413910006,
        "type": "comment"
    },
    {
        "by": "DanBC",
        "id": 8488245,
        "score": 2,
        "text": "",
        "time": 1413910014,
        "title": "Webcam sex with fake girl Sweetie leads to sentence",
        "type": "story",
        "url": "http://bbc.co.uk/news/technology-29688996"
    },
    {
        "by": "chrisdone",
        "id": 8488246,
        "parent": 8487943,
        "text": "I feel the same way about games that he feels about jigsaws. They&#x27;re fun enough but they&#x27;re inherently contrived and produce no real value. I read books and watch movies for narrative experiences. While there&#x27;s a growing minority of games that have real emotional, sophisticated and even literature-level narratives, at the end of the day, most games require you to solve contrived puzzles to advance the narrative.<p>On the other end, there are games like that one where you build pieces from blocks and it&#x27;s a little world, people have expressed their artistic side with whole castles with automations and calculators. These are more like LEGO, Meccano or other tool; they&#x27;re a substrate, like a programming language, something you build on. I wouldn&#x27;t call them games.<p>Although I will grant that games that pit you against or collaborate with other human beings is worth it to some degree, because you&#x27;re spending time with people (which is why Chess is bloody boring and pointless to play against the computer), it&#x27;s all noughts-and-crosses with bells and whistles.<p>Coming back to his point about jigsaws, while it is satisfying to complete one, personally, any time spent putting in active effort (as opposed to passive effort, like in the case of a novel or movie or theatre), I&#x27;d prefer to be doing something actually constructive; to produce something real, either artistically (I paint canvases), or technologically (I&#x27;m a programmer). Rather than maintaining these “farms” and cyberpet-style games, or the games where you&#x27;re digging for gold and collecting resources, I&#x27;d rather maintain my bike, go grab some materials from the store and do some DIY in my apartment, plant some things in my garden, etc. Whenever one of my gamer friends explains a game to me, I&#x27;m thinking more about how I&#x27;d make that than how I&#x27;d play it. I&#x27;m not saying people who like to spend time doing these things are wasting their time, just that I don&#x27;t share that desire at all.<p>Puzzles in a job interview are a poor idea. People don&#x27;t solve puzzles on their job, with their manager watching them do it. They don&#x27;t get sacked for failing to solve the puzzle (which failing a job interview is tantamount to; your career depends on it). And if they can&#x27;t solve a puzzle in 15 minutes, they spend all day on it. Or all week. They ask their colleagues for help. If it&#x27;s too hard, the product manager considers breaking the problem down. Asking contrived puzzles is such a silly idea that I&#x27;m biased against companies that try to ask them for job interviews.",
        "time": 1413910020,
        "type": "comment"
    },
    {
        "by": "bch",
        "id": 8488247,
        "parent": 8487145,
        "text": "Richard Hipp went on to say he wishes he didn&#x27;t use public domain, because of its ambiguity.<p>see: <a href=\"https://web.archive.org/web/20120510151444/http://methodlogic.net/BSDFossil.html\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20120510151444&#x2F;http:&#x2F;&#x2F;methodlogi...</a>",
        "time": 1413910029,
        "type": "comment"
    },
    {
        "by": "weiyin",
        "id": 8488248,
        "parent": 8488103,
        "text": "we did some testing using compressed video, but ended up finding single frames to be more performant. also, the setup can handle much higher framerate and quality but we&#x27;ve kept things fairly lean for the demo :) can easily handle 15fps w&#x2F; high quality images. thanks again for the questions and comments.",
        "time": 1413910032,
        "type": "comment"
    },
    {
        "by": "Thevet",
        "id": 8488249,
        "score": 1,
        "text": "",
        "time": 1413910043,
        "title": "Behind the Scenes at the Smithsonian Marine Mammals Collection",
        "type": "story",
        "url": "http://www.atlasobscura.com/articles/behind-the-scenes-at-the-smithsonian-marine-mammals-collection"
    },
    {
        "by": "dntrkv",
        "id": 8488250,
        "parent": 8487905,
        "text": "Removing functionality is not &quot;flat design&quot; that&#x27;s just bad design.",
        "time": 1413910047,
        "type": "comment"
    },
    {
        "by": "chrishepner",
        "id": 8488251,
        "kids": [
            8488310
        ],
        "parent": 8487756,
        "text": "Unfortunately, I don&#x27;t think it&#x27;s as simple as &quot;just use the &#x27;url&#x27; and &#x27;email&#x27; input types for their respective fields.&quot;<p>Using the &quot;url&quot; input type can be a problem, due to strict validation - the validator requires a URI as specified by RFC 3986, meaning that if the user enters &quot;example.com&quot; rather than &quot;<a href=\"http://example.com&quot;\" rel=\"nofollow\">http:&#x2F;&#x2F;example.com&quot;</a>, the browser considers this invalid, blocks the form submission, and displays an error like &quot;Please enter a URL&quot;.<p>This effectively breaks the form for most users, on mobile or not, so you&#x27;d need to disable HTML5 input validation on this form or field.",
        "time": 1413910070,
        "type": "comment"
    },
    {
        "by": "Igglyboo",
        "id": 8488252,
        "kids": [
            8488294
        ],
        "parent": 8488071,
        "text": "This is a good example of it done extremely well, also from Apple.<p><a href=\"http://www.apple.com/imac-with-retina/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.apple.com&#x2F;imac-with-retina&#x2F;</a><p>It&#x27;s even more impressive when you inspect it and see how it&#x27;s done.",
        "time": 1413910083,
        "type": "comment"
    },
    {
        "by": "gknoy",
        "id": 8488253,
        "kids": [
            8488447
        ],
        "parent": 8487374,
        "text": "I don&#x27;t follow why you&#x27;re subtracting `c`, or multiplying by the size of the decreased price.  Can you elaborate on how you came to that?",
        "time": 1413910085,
        "type": "comment"
    },
    {
        "by": "vr000m",
        "id": 8488254,
        "score": 1,
        "time": 1413910093,
        "title": "Identifiers for WebRTC's Statistics API",
        "type": "story",
        "url": "http://www.w3.org/TR/2014/WD-webrtc-stats-20141021/"
    },
    {
        "by": "BruceIV",
        "id": 8488255,
        "parent": 8487840,
        "text": "Looks useful; I just symlink into a folder on my dropbox, which accomplishes much the same thing with about the same effort.",
        "time": 1413910142,
        "type": "comment"
    },
    {
        "by": "acqq",
        "id": 8488256,
        "kids": [
            8488496
        ],
        "parent": 8487991,
        "text": "OK, so I guess I understand now your view, you always assumed <i>passive eavesdropping</i> and ignored that my claim was from the start about the MTM:<p><a href=\"http://en.wikipedia.org/wiki/Man-in-the-middle_attack\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Man-in-the-middle_attack</a><p>&quot;The man-in-the-middle attack (often abbreviated MITM, MitM, MIM, MiM, MITMA) in cryptography and computer security is a form of <i>active eavesdropping</i> in which <i>the attacker makes independent connections with the victims and relays messages between them, making them believe that they are talking directly to each other over a private connection, when in fact the entire conversation is controlled by the attacker.</i> The attacker must be able to intercept all messages going between the two victims and inject new ones, which is straightforward in many circumstances.&quot;<p>At the moment we write this on the fist page of HN there is an article about the MTM currently used by Chinese:<p><a href=\"https://news.ycombinator.com/item?id=8482119\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8482119</a><p>Where they don&#x27;t even bother to remain undetected. I didn&#x27;t think it would be much more complicated for the government which already does MTM to do the real-time query through the victim&#x27;s SMS. The queries of the SMS would happen very rarely and need much less resources compared to the internet traffic.<p>Reading the conversation before I joined the discussion, I&#x27;ve also believed that worklogin also worried about the MTM as he wrote, many messages before: &quot;With SMS-based 2FA, the token is sent via insecure channels to the user BEFORE auth, which is an opportunity for state actors and telecom to intercept it before use.&quot; I believed he wouldn&#x27;t need to discuss when the token is sent otherwise and that his &quot;intercept&quot; was in the MTM-implied meaning &quot;to take, seize, or halt (someone or something on the way from one place to another); cut off from an intended destination:\nto intercept a messenger.&quot;<p>So, per your discussion, the existence of 2FA is irrelevant as soon as the internet is MTM-ed, that is, as soon as somebody plugs in your TLS session? I honestly have never considered how irrelevant it is then. Thanks. I still have some other view of the 2FA ultimate goals.<p>Like, there is this: <a href=\"https://news.ycombinator.com/item?id=8487115\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8487115</a> on the first page now where Google exactly tries to avoid the SMS channel. I can imagine that you&#x27;d consider that more than 2FA which you discuss, it&#x27;s also OK.",
        "time": 1413910146,
        "type": "comment"
    },
    {
        "by": "kstenerud",
        "id": 8488257,
        "parent": 8487943,
        "text": "Evaluating a programmer by how well he solves a logic puzzle makes about as much sense as evaluating a race car driver by how well he rides a horse.",
        "time": 1413910147,
        "type": "comment"
    },
    {
        "by": "pkulak",
        "id": 8488258,
        "parent": 8484924,
        "text": "<a href=\"http://amzn.com/B005DU0M64\" rel=\"nofollow\">http:&#x2F;&#x2F;amzn.com&#x2F;B005DU0M64</a><p>If I had to do it again, though, I&#x27;d get a smaller one. Something that can make a 1-pound loaf. My family doesn&#x27;t go through 1.5 pounds in a day, and when you have a bread maker, keeping day-old bread is not an option.",
        "time": 1413910175,
        "type": "comment"
    },
    {
        "by": "muraiki",
        "id": 8488259,
        "parent": 8487539,
        "text": "I also had RSI which progressed to the point where I was starting to worry if I&#x27;d be able to keep using a keyboard at all. A standing desk had helped for some time, but it was reaching the point where I&#x27;d stand for 3&#x2F;4ths of the day, come home, and simply lie down.<p>I went to physical therapy, which identified problems with my neck and shoulders, and then we began working on those muscle groups and some of my core. I should note that these exercises were very gradual, such as using no weights or 1-2lb weights -- I didn&#x27;t go straight to lifting!<p>After a few months of this, most of my symptoms have disappeared (I only went to phys therapy for about 1.5 months; afterwards I was able to keep doing the exercises at home). Also, my wife has noticed that my posture has naturally improved as a result of the exercises, such as my shoulders no longer rolling inwards.<p>I still have some remaining long term problems that I&#x27;ve had for a decade, but now I can sit and use a computer the whole day with very few problems. Of course, everybody&#x27;s situation is different: physical therapy, surgery, and &quot;The Mindbody Prescription&quot; mentioned elsewhere have not helped a friend of mine. But at least in my case, it was a bit humbling to realize that all I really needed to do was exercise (and I&#x27;m not overweight, either).<p>Something else that helped me was getting a quality mechanical keyboard with low actuation and learning how to use it without bottoming out. The model that I like (CM Storm Quickfire Rapid) is unfortunately no longer made, but it uses Cherry MX Brown switches (not loud, but still has an actuation point) and has no numeric keypad, so I can keep the mouse close by without having to stretch my shoulder. I use blue switches at home, which have a more clear actuation point and thus are probably better for a mechanical keyboard novice, but they are probably too loud to use in an open office environment. This guide is very helpful for understanding the how &amp; why of mechanical keyboards: <a href=\"http://www.overclock.net/t/491752/official-mechanical-keyboard-guide\" rel=\"nofollow\">http:&#x2F;&#x2F;www.overclock.net&#x2F;t&#x2F;491752&#x2F;official-mechanical-keyboa...</a>",
        "time": 1413910223,
        "type": "comment"
    },
    {
        "by": "chasing",
        "id": 8488260,
        "parent": 8487943,
        "text": "I like making things. If I want to make something and I don&#x27;t know how, I&#x27;ll figure it out. Call that &quot;solving a puzzle,&quot; but it&#x27;s a very different activity than solving a literal jigsaw puzzle or answering some arbitrary question about rickety bridges.<p>If you enjoy making things with software, you&#x27;ll be a decent programmer. If you enjoy puzzles for their own sake, go check out some Martin Gardner books. Those two enjoyments can overlap, but they&#x27;re not necessarily dependent upon one another.",
        "time": 1413910233,
        "type": "comment"
    },
    {
        "by": "tilfintiy",
        "id": 8488261,
        "score": 1,
        "text": "Example:<p># ip route show 0&#x2F;0 dev wlp0s26u1u5<p>default via 192.168.0.1  metric 303<p># ip route show default dev wlp0s26u1u5<p>default via 192.168.0.1  metric 303<p>192.168.0.0&#x2F;24  proto kernel  scope link  src 192.168.0.191  metric 303",
        "time": 1413910236,
        "title": "Ask HN: In iproute2, why is “0/0” handled differently from “default”?",
        "type": "story",
        "url": ""
    },
    {
        "by": "coreymgilmore",
        "id": 8488262,
        "parent": 8488085,
        "text": "Wow...my eyes must be going.",
        "time": 1413910238,
        "type": "comment"
    },
    {
        "by": "kakakiki",
        "id": 8488263,
        "parent": 8487943,
        "text": "My life story! Relieved to see similar people :)",
        "time": 1413910242,
        "type": "comment"
    },
    {
        "by": "cbhl",
        "id": 8488264,
        "kids": [
            8488413
        ],
        "parent": 8488103,
        "text": "It&#x27;s worth noting that Chrome Remote Desktop uses VP8 (which is the video codec used in WebM):<p><a href=\"http://googleblog.blogspot.com/2012/05/next-step-in-chrome-os-journey.html\" rel=\"nofollow\">http:&#x2F;&#x2F;googleblog.blogspot.com&#x2F;2012&#x2F;05&#x2F;next-step-in-chrome-o...</a><p>If you&#x27;re having performance issues with it, you just have the video codec tuned wrong.",
        "time": 1413910242,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488265,
        "time": 1413910245,
        "type": "story"
    },
    {
        "by": "jrochkind1",
        "id": 8488266,
        "parent": 8487972,
        "text": "Wikipedia says:<p>&gt; Currently cruise missiles are among the most expensive of single-use weapons, up to several million dollars apiece. One consequence of this is that its users face difficult choices in targeting, to avoid expending the missiles on targets of low value.<p>That&#x27;s one distinction.  What makes drones scary is how they can be, and are being, used to terrorize entire populations, in ways that cruise missiles have not been and are unlikely to be.<p>Not that cruise missiles aren&#x27;t terrifying too, but the affordability and perceived &#x27;precision&#x27; of drones is leading to an entirely new scale of un-manned warfare.<p>Also, drones increasing autonomy, in a way that cruise missiles have not been and are unlikely to ever be, is another distinction.<p>There are in fact a variety of clear differences.",
        "time": 1413910285,
        "type": "comment"
    },
    {
        "by": "incanus77",
        "id": 8488267,
        "parent": 8487943,
        "text": "Love this. I like puzzles (and scifi) and definitely fit the more traditional model of a programmer, though I&#x27;m entirely self-taught and didn&#x27;t take CS in school. I really don&#x27;t like algorithms that much. What I do enjoy is API design, writing elegant code that is maintainable, and solving the macro, human-scale problems.",
        "time": 1413910294,
        "type": "comment"
    },
    {
        "by": "skybrian",
        "id": 8488268,
        "parent": 8487943,
        "text": "This discussion is going to be mostly meaningless because everyone has a different idea of what a puzzle is. Whether or not something is a puzzle depends on what you know. To a beginner, writing fizzbuzz is a puzzle. To someone with ordinary programming skill, it&#x27;s not.<p>The question I usually ask in a job interview is an adapted version of something I actually had to solve, and if you don&#x27;t know how to either use pointers or how to build and print a tree then you might think it&#x27;s a puzzle. If you do then it&#x27;s just applying your skills to the task at hand.<p>Maybe there are other questions I could ask, but it&#x27;s a job interview; how else are you going to find actual programmers?",
        "time": 1413910311,
        "type": "comment"
    },
    {
        "by": "millisecond",
        "id": 8488269,
        "score": 1,
        "text": "Our product: <a href=\"https://goroost.com\" rel=\"nofollow\">https:&#x2F;&#x2F;goroost.com</a><p>Hiring all stripes: front-end, back-end, full-stack.<p>Tech: jQuery, Backbone, Underscore, Java, AWS cloud services.<p>Benefits: the usual great startup package.<p>BS: very low.<p>Get in touch: casey@goroost.com",
        "time": 1413910337,
        "title": "Roost (YC S14) hiring web devs in NYC",
        "type": "job",
        "url": ""
    },
    {
        "by": "serve_yay",
        "id": 8488270,
        "parent": 8488113,
        "text": "Ditto if you don&#x27;t like Star Wars, XCKD, comic books, etc.",
        "time": 1413910355,
        "type": "comment"
    },
    {
        "by": "mineshaftgap",
        "id": 8488271,
        "score": 4,
        "time": 1413910361,
        "title": "NASA Rover Opportunity Views Comet Near Mars",
        "type": "story",
        "url": "http://www.nasa.gov/jpl/mer/nasa-rover-opportunity-views-comet-near-mars/"
    },
    {
        "by": "pjungwir",
        "id": 8488272,
        "parent": 8487840,
        "text": "Very nice! This is something I&#x27;ve always meant to set up but never bothered with. He mentions installing different subsets of your dotfiles on different machines. To do that easily and have it &quot;written down&quot;, I&#x27;d put a Makefile into the dotfiles directory with .PHONY targets for each machine, and have those targets run the right `stow` commands for me.",
        "time": 1413910363,
        "type": "comment"
    },
    {
        "by": "mtkane0",
        "id": 8488273,
        "score": 1,
        "text": "",
        "time": 1413910370,
        "title": "100 little programming excercises",
        "type": "story",
        "url": "https://go-left.com/blog/programming/100-little-programming-exercises/"
    },
    {
        "deleted": true,
        "id": 8488274,
        "time": 1413910382,
        "type": "story"
    },
    {
        "by": "daddykotex",
        "id": 8488275,
        "parent": 8488172,
        "text": "Same thing for me, I could recognize me while reading your post...<p>The definition of a &quot;programmer&quot; is very subjective.",
        "time": 1413910384,
        "type": "comment"
    },
    {
        "by": "ikawe",
        "id": 8488276,
        "kids": [
            8488277
        ],
        "score": 3,
        "text": "",
        "time": 1413910391,
        "title": "WIP: Discuss California Voting Guide",
        "type": "story",
        "url": "http://michaelkirk.github.io/discuss_voting/"
    },
    {
        "by": "ikawe",
        "id": 8488277,
        "parent": 8488276,
        "text": "This is a quick hack (started 2 hours ago) combining a pdf-&gt;html translation of the CA state voting guide and an inline commenting system.<p>Does it have promise?",
        "time": 1413910407,
        "type": "comment"
    },
    {
        "by": "silverbax88",
        "id": 8488278,
        "kids": [
            8488533,
            8488376
        ],
        "parent": 8488113,
        "text": "This. So much this.<p>I&#x27;m a programmer who loves &#x27;building the brain&#x27;. I&#x27;ve been coding professionally for about 16 years.<p>I&#x27;ve written some code I&#x27;m really proud of. A couple of specific pieces of code are actually used in a LOT of major websites you probably use. Like almost every health care site or major retailer site. I actually find most code written by &#x27;whiz&#x27; startups - even successful ones - to be incredibly simplistic. Not a knock on them, just stating this for reference - I have even written some encryption code that gave me headaches to understand but is still in use by a few major financial corporations years after I wrote it. I know I can write some serious code. I studied and work with AI programming in my spare time.<p>I don&#x27;t have a GitHub page, nor do I have an interest in having one. I barely have a StackOverflow profile. I post on Hacker News now and again but that&#x27;s about it.<p>I don&#x27;t care about hackathons or solving puzzles.<p>I hate the term &#x27;nerd&#x27; or &#x27;geek&#x27;. I am neither and I find the terms insulting. I&#x27;m just smart and I like to code. I am not socially awkward. I&#x27;m introverted, but I&#x27;m not shy. I played football and basketball <i>and</i> I played chess. These concepts are not mutually exclusive.",
        "time": 1413910410,
        "type": "comment"
    },
    {
        "by": "pmelendez",
        "id": 8488279,
        "parent": 8487943,
        "text": "Correlation is not causation :)",
        "time": 1413910411,
        "type": "comment"
    },
    {
        "by": "leephillips",
        "id": 8488280,
        "score": 1,
        "time": 1413910416,
        "title": "Seeing the Glass of Milk as All Empty",
        "type": "story",
        "url": "http://physics.aps.org/synopsis-for/10.1103/PhysRevLett.113.173901"
    },
    {
        "by": "creutzfeldt",
        "dead": true,
        "id": 8488281,
        "score": 1,
        "text": "",
        "time": 1413910425,
        "title": "Haftbefehl – Russisch Roulette. Alle Infos Zum Neuen Hafti Album",
        "type": "story",
        "url": "http://www.malafama.de/haftbefehl-russisch-roulette.html"
    },
    {
        "by": "codercraig",
        "id": 8488282,
        "kids": [
            8488300
        ],
        "score": 3,
        "text": "",
        "time": 1413910439,
        "title": "Learning from the Lyft, Uber and GetAround Referral Programs",
        "type": "story",
        "url": "http://www.referralsaasquatch.com/3-examples-ride-sharing-customer-referral-programs/"
    },
    {
        "by": "tptacek",
        "id": 8488283,
        "parent": 8486427,
        "text": "I&#x27;m not a libertarian (for HN, in fact, I qualify as a statist) and I have a problem with universal identification. I thought we had a decent balance struck before Hiibel.",
        "time": 1413910446,
        "type": "comment"
    },
    {
        "by": "alecbenzer",
        "id": 8488284,
        "parent": 8487943,
        "text": "&gt; Coming up with algorithms is the programmer’s version of puzzle solving.<p>I&#x27;m not really seeing the connection. Are they both just things you don&#x27;t like?",
        "time": 1413910446,
        "type": "comment"
    },
    {
        "by": "hangonhn",
        "id": 8488285,
        "parent": 8487777,
        "text": "That would be quite awesome.",
        "time": 1413910467,
        "type": "comment"
    },
    {
        "by": "gknoy",
        "id": 8488286,
        "parent": 8486573,
        "text": "As much as I love Emacs, that sounds like it&#x27;s a bug to assume that one&#x27;s prompt will follow a convention (ends-in-$).  The convention is useful and good, but it seems strange to blame someone for breaking your tool&#x27;s expectations when they had made a valid prompt.",
        "time": 1413910471,
        "type": "comment"
    },
    {
        "by": "spatten",
        "id": 8488287,
        "score": 1,
        "text": "",
        "time": 1413910477,
        "title": "Raptor: a new ruby web-server for faster app deployment",
        "type": "story",
        "url": "http://www.rubyinside.com/raptor-a-new-ruby-web-server-for-faster-app-deployment-6168.html"
    },
    {
        "by": "FrankenPC",
        "id": 8488288,
        "parent": 8487943,
        "text": "Programming is a pyramid.  Each strata building on the other.  Anyone can join in on any level to contribute.  I enjoy living on the framework and data levels.  I really don&#x27;t like front end or bare iron work.  That certainly kills some job opportunities, but I&#x27;d rather be happy.",
        "time": 1413910479,
        "type": "comment"
    },
    {
        "by": "cliotta",
        "id": 8488289,
        "parent": 8487588,
        "text": "This is really cool stuff. It&#x27;s amazing what you can do with all these new front end libraries. Keep up the god work. Looking forward to the next read!",
        "time": 1413910488,
        "type": "comment"
    },
    {
        "by": "etimberg",
        "id": 8488290,
        "parent": 8487283,
        "text": "Some of them I like as colours, some I don&#x27;t (bright teal for instance is just horrendous)",
        "time": 1413910512,
        "type": "comment"
    },
    {
        "by": "miguelrochefort",
        "id": 8488291,
        "parent": 8487809,
        "text": "Make it work with Xamarin (Windows).",
        "time": 1413910522,
        "type": "comment"
    },
    {
        "by": "CapitalistCartr",
        "id": 8488292,
        "parent": 8487943,
        "text": "I could have written this; It&#x27;s me to a T.  I build things.  I like building things.  It&#x27;s fine with me if it&#x27;s not completely original. I can ride around my city and point to the parts I helped build.  I like that.<p>When I program I bring order from chaos.  I can do that best by using the discoveries of others, and building them up.  I&#x27;m glad there are creative people who love mathematics enough to figure out original algorithms; I appreciate their work.  I&#x27;m not one of them.  It doesn&#x27;t change the quality of what I build.",
        "time": 1413910535,
        "type": "comment"
    },
    {
        "by": "_nedR",
        "id": 8488293,
        "parent": 8486533,
        "text": "Wow, that is interesting and disturbing. India is not quite there yet.. But I would put it down to bureaucratic inertia rather than lack of intention.",
        "time": 1413910538,
        "type": "comment"
    },
    {
        "by": "daddykotex",
        "id": 8488294,
        "parent": 8488252,
        "text": "Hell yeah, thanks for sharing!",
        "time": 1413910549,
        "type": "comment"
    },
    {
        "by": "phkahler",
        "id": 8488295,
        "parent": 8487574,
        "text": "&gt;&gt; &gt; It&#x27;s just designers trying to justify their own salary.<p>&gt;&gt; Seems a little unfair.<p>Not when you&#x27;ve been using computers for 35 years and have seen it migrate from flat to nice to gratuitous and now back to flat.<p>The original bevels on buttons were a nice indicator that it was in fact a thing you could push. Lots of subtle cues were added in the late 90&#x27;s and UI probably reached a high point. Then the graphics hardware got awesome and compositing with lots of effects became possible. These were used because they looked neat at first glance. Designers wanted to stand out and went crazy with bling. Then there was backlash, and now the trend is toward flat, simple, and frankly - in many cases - ugly UI. The pendulum is swinging too far back the other way IMHO. But not to worry, it will go back in time and we&#x27;ll eventually have another high point. Probably better than the previous high since touch and swipe and all kinds of new things will be properly part of the picture.",
        "time": 1413910551,
        "type": "comment"
    },
    {
        "by": "ASquare",
        "id": 8488296,
        "score": 2,
        "text": "",
        "time": 1413910552,
        "title": "The Fastest User Interface",
        "type": "story",
        "url": "http://tomtunguz.com/voice-interface-of-the-future/?utm_source=HackerNews&utm_medium=@anujadhiya&utm_campaign=http://planitwide.com"
    },
    {
        "by": "tptacek",
        "id": 8488297,
        "parent": 8486277,
        "text": "You addressed the &quot;apart from the fact&quot; point in my comment, but not the meat of it. I point that out because someone else already brought up the measurement cost issue; my point was that there are other concerns.<p>Also, my comment directly addressed the notion of a lowest- common- denominator sleep.<p>I think maybe you meant to respond to a different comment?",
        "time": 1413910555,
        "type": "comment"
    },
    {
        "by": "jiggy2011",
        "id": 8488298,
        "kids": [
            8488507
        ],
        "parent": 8487056,
        "text": "The barrier to implementing this would surely be teaching resources, how do you teach a class if all students are at different stages in the course material? You would need to have very small class sizes.",
        "time": 1413910558,
        "type": "comment"
    },
    {
        "by": "dead10ck",
        "id": 8488299,
        "parent": 8487943,
        "text": "As many others have already said, if you&#x27;ve been programming for 18 years, then yes, you are a programmer. I wouldn&#x27;t say you&#x27;re crazy for not liking puzzles, but I would say you&#x27;re crazy for not liking puzzles <i>and</i> pursuing a Ph.D in (what I assume is) Computer Science, since that is invariably what most research involves, and what most Ph.D level jobs are going to involve.",
        "time": 1413910570,
        "type": "comment"
    },
    {
        "by": "codercraig",
        "id": 8488300,
        "kids": [
            8488420
        ],
        "parent": 8488282,
        "text": "Ride-Sharing apps are no strangers to world of referral programs.\nThey’re leading the way in the sharing economy and injecting life into cities across the world. Harnessing the power of word-of-mouth is crucial for the success of these companies.\nCheck out how they approach building their referral programs after the jump.",
        "time": 1413910573,
        "type": "comment"
    },
    {
        "by": "thelinuxkid",
        "id": 8488301,
        "score": 2,
        "text": "",
        "time": 1413910579,
        "title": "Minimalistic Go package manager",
        "type": "story",
        "url": "https://gist.github.com/thelinuxkid/c57ddaf9ddbdce2f30b9"
    },
    {
        "by": "tsenkov",
        "id": 8488302,
        "parent": 8485662,
        "text": "40 years without turning your back on a project... probably &quot;heroic&quot; is one of the words describing it.<p>I suppose the biggest &quot;bottleneck&quot; in the progress of such work is testing.<p>What is the current state of computer simulations of bio systems? Is OpenWorm the biggest project in this direction? If I remember correctly, they weren&#x27;t exactly simulating completely down to the cellular organelle (or atomic) level, but instead simulated starting from higher level of abstraction (muscle contraction etc.).",
        "time": 1413910582,
        "type": "comment"
    },
    {
        "by": "DigitalSea",
        "id": 8488303,
        "kids": [
            8488539,
            8488517,
            8488445,
            8488444,
            8488436,
            8488428
        ],
        "parent": 8487943,
        "text": "This is what really irks me about the industry as a whole. Large companies like Facebook and Google have hiring processes in place that aim to weed out the strong from the weak by making them solve complex algorithmic puzzles and solve them on a whiteboard, and for larger companies like Facebook or Google who have massive troves of data, this kind of makes sense to me, but only if you&#x27;re hiring a programmer to work with your data, not make things pretty or interface with existing services.<p>However, what does not make sense to me is the asinine requirement that a web developer needs to know or understand algorithms. A front-end developer working with HTML, CSS and Javascript will never EVER need to know how to write an algorithm. In my 12 years as a developer thus far I have never needed to solve a complex math problem or write an algorithm to markup some HTML, the closest I get to math problems is simplistic operations in Javascript like calculating the scroll distance from the top of a page or mathematically moving an element around the page in a particular way and I generally use a calculator for these problems.<p>The problem is many startups try and replicate the likes of Google and have the attitude of, &quot;Well, if Google require you to solve complex math puzzles on a whiteboard in 30 minutes, then that is what we will do too&quot; - reality check: A developer working with HTML, CSS and Javascript does not need to know algorithms whatsoever. Only a developer working with data or writing an algorithm to sort it should need to know that stuff. You are not Google, so stop pretending you only hire smart developers who know how to solve unrealistic math problems that they will never encounter.<p>I have heard from friends and experience a couple of times myself, broken recruiting processes that ask you to solve non-realistic problems and complex math puzzles (which I always fail myself). My policy is unless I am going for a job working and sorting through data, I should not need to know how to write an algorithm on a whiteboard.<p>The only skill I think all developers should know regardless of whether you are a front-end developer or writing complex algorithms to sort through billions of rows of privately collected American data through a secret Government program is regular expressions. I do not know regular expressions extremely well, but I know them enough to be useful with them and I think this is one area where most developers fail. You might know the latest tools, heck, you might even know how to write an algorithm to sort through a large set of data, but if you can not write a regular expression (even for the most basic of tasks), then I think we have a problem.<p>The interview process for most developers should be simple like this: Can you write regular expressions? (yes) or (no) - if (yes) then write me a regular expression to get the value between two curly braces in my Node.js application and you have got the job.<p>There are always going to be companies out there with this unrealistic inflated image of how smart a developer should be. To be quite honest, I would not call myself an overly smart person. A lot of the problems I solve on a daily basis are merely following simplistic troubleshooting steps with a combination of Google and reading the documentation. Most of my day job is simply just common sense. Web developers in particular are over-glorified Googler&#x27;s with an eye for detail and a large bottle of strong adhesive used for gluing different pieces together. And you know what? There is nothing wrong with that, it is the truth, because I am one of those people.",
        "time": 1413910583,
        "type": "comment"
    },
    {
        "by": "cubancigar11",
        "id": 8488304,
        "parent": 8487827,
        "text": "I don&#x27;t get it. If you think supreme court judgement is &#x27;one source&#x27; then you cannot be argued with. And complaining about &#x27;long paragraph&#x27;... hmm... I think you are just angry and without argument.<p>Regarding second paragraph, the citation is not handy right now, but this is what Indian feminists actually write. You know, the ones actually involved in drafting government policies. There was a similar article by NCW I read around 3 months ago. You can also talk to the head of <a href=\"http://samajsevasamithy.org/\" rel=\"nofollow\">http:&#x2F;&#x2F;samajsevasamithy.org&#x2F;</a> regarding it (I volunteer there).",
        "time": 1413910584,
        "type": "comment"
    },
    {
        "by": "Excavator",
        "id": 8488305,
        "parent": 8487073,
        "text": "&gt; Is it possible to learn what user likes and then make suggestions based on likes - is this one of the use cases?<p>In the Neural Networks for Machine Learning course on Coursera¹ the Netflix Prize² was brought up as an example that does this.<p>1: <a href=\"https://www.coursera.org/course/neuralnets\" rel=\"nofollow\">https:&#x2F;&#x2F;www.coursera.org&#x2F;course&#x2F;neuralnets</a><p>2: <a href=\"http://en.wikipedia.org/wiki/Netflix_Prize\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Netflix_Prize</a>",
        "time": 1413910589,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488306,
        "parent": 8487860,
        "time": 1413910596,
        "type": "comment"
    },
    {
        "by": "eitally",
        "id": 8488307,
        "parent": 8486189,
        "text": "My guess is that he meant &quot;dictatorship&quot; rather than &quot;monarchy&quot;.  You took umbrage with his mistake rather than forgiving that and recognizing his intent, which is that the PM role in India has way too much power.",
        "time": 1413910621,
        "type": "comment"
    },
    {
        "by": "cbhl",
        "id": 8488308,
        "parent": 8487449,
        "text": "You should go contribute patches to the browser of your choice. ;)",
        "time": 1413910635,
        "type": "comment"
    },
    {
        "by": "yarrel",
        "id": 8488309,
        "parent": 8487943,
        "text": "Optimizing out inefficiency and waste is part of good programming. So yes.",
        "time": 1413910639,
        "type": "comment"
    },
    {
        "by": "MrMike",
        "id": 8488310,
        "parent": 8488251,
        "text": "Good point, however, I&#x27;m not sure I can recall a time during which someone intended to collect a URL from me  but allowed just &quot;example.com&quot; as a valid input. I&#x27;d venture to guess that the validation enforced more often than not actually helps the site owner achieve their intended goal.",
        "time": 1413910639,
        "type": "comment"
    },
    {
        "by": "EmanueleAina",
        "id": 8488311,
        "parent": 8486314,
        "text": "To be fair, udev communicates over netlink. :)<p>Only in the future it may use kdbus for <i>some</i> purposes (eg. uploading firmware blobs), but this will only affect internal interfaces.<p>On the other hand, systemd does <i>not</i> require the D-Bus daemon when you&#x27;re launching systemctl it as root, the D-Bus daemon is only needed to route the call when used by unprivileged users. When used as root, systemctl connects to the PID1 socket directly and D-Bus is basically just a serialization protocol (and systemd does not depend on libdbus either).",
        "time": 1413910640,
        "type": "comment"
    },
    {
        "by": "mmastrac",
        "id": 8488312,
        "score": 3,
        "time": 1413910641,
        "title": "Redis Sentinel properties and fail scenarios",
        "type": "story",
        "url": "http://antirez.com/news/80"
    },
    {
        "by": "weiyin",
        "id": 8488313,
        "kids": [
            8488349
        ],
        "parent": 8488143,
        "text": "Hey B-n-c, \nYou are pretty much spot on with everything you mentioned.<p>Apparently app.io had some setup w&#x2F; VMs running on lightweight hypervisors (<a href=\"https://macstadium.com/casestudies\" rel=\"nofollow\">https:&#x2F;&#x2F;macstadium.com&#x2F;casestudies</a>), but we found we didn&#x27;t have to have all that overhead to run multiple simulators per machine.<p>And you&#x27;re exactly right about the small piece of custom code to pass controls and send frames. We&#x27;re big fans of socket.io - pretty powerful stuff!<p>Happy to answer follow-ups if we missed something.<p>Thanks, \nweiyin",
        "time": 1413910645,
        "type": "comment"
    },
    {
        "by": "latitude",
        "id": 8488314,
        "kids": [
            8488471
        ],
        "parent": 8487979,
        "text": "I went through the whole stack of SMTP RFCs just this week and the takeaway was this.<p><pre><code>  TCP&#x2F;25 if you are talking directly to the recipient&#x27;s mail server,\n  though it&#x27;s discouraged if you are not a mail server yourself.\n\n  TCP&#x2F;587 - the same as above, but you are a mail client. In particular,\n  it&#x27;s the port for talking to &quot;your&quot; server, which you are tasking with\n  relaying your email to the destination.\n\n  * If you have username&#x2F;password and want to &quot;login&quot;, you want TCP&#x2F;587.\n</code></pre>\nOn the other hand<p><pre><code>  TCP&#x2F;465 is a deprecated way of *securing* an SMTP connection.\n</code></pre>\nIt&#x27;s just SMTP over TLS. Deprecated, discouraged, but still widely supported. Functionally it can be either TCP&#x2F;25 or TCP&#x2F;587, depending on the setup at the server end.<p>To secure 25&#x2F;587, you first speak a bit of SMTP and then initiate the TLS handshake with STARTTLS command. It&#x27;s all actually really simple. <i>Much</i> simpler than it seems when you are looking at the SMTP configuration UI in a typical mail client :)<p><pre><code>  --\n</code></pre>\n(Re-edit) Nevermind. Let&#x27;s keep it on-topic.",
        "time": 1413910652,
        "type": "comment"
    },
    {
        "by": "B-n-c",
        "id": 8488315,
        "parent": 8488237,
        "text": "Maybe, but then launching multiples and capturing the screen of them to send off through the sockets seems like there must be something in between. I wonder if its able to see where the session windows are on the screen and screenshotting them to send through, or if they somehow hooked directly in to pull the screen?",
        "time": 1413910655,
        "type": "comment"
    },
    {
        "by": "sjLonghorn",
        "id": 8488316,
        "parent": 8487840,
        "text": "You might also checkout <a href=\"https://github.com/andsens/homeshick\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;andsens&#x2F;homeshick</a>.  Similar idea, but tailored for dotfiles.",
        "time": 1413910662,
        "type": "comment"
    },
    {
        "by": "bsbechtel",
        "id": 8488317,
        "parent": 8488083,
        "text": "&gt;Gorillas are the market leaders. They are easy to spot because they promote the efficacy of their approach to grow their market.<p>Is this in terms of describing how simple or great the product is? I&#x27;m struggling to understand an example of this in action.",
        "time": 1413910668,
        "type": "comment"
    },
    {
        "by": "teleclimber",
        "id": 8488318,
        "kids": [
            8488398
        ],
        "parent": 8487892,
        "text": "An example of Apple doing parallax right is the new iMac page:\n<a href=\"http://www.apple.com/imac-with-retina/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.apple.com&#x2F;imac-with-retina&#x2F;</a>\nAt least the top image effect is very well done IMO and does a very good job conveying the central premise of the new iMac: looottts of pixels.<p>Having said that I really dislike what happens lower on the page where the iMac image stays pinned on the left and the descriptions scroll normally on the right. It&#x27;s totally jarring to me. It seems unnatural that some of the contents would move with the scrollbar (as expected) and other significant elements would not. It immediately pulls me away from the content and leaves me trying to analyze what in the world is going on.<p>We experience parallax in the real world every day and are  completely wired up to find it normal and expected. But real parallax involves objects at different distances. When you force objects that are in the same plane to move as if they were in different planes, you get the &quot;funhouse&quot; effect.<p>I suspect that like many other cute effects somebody will eventually do some serious AB tests and figure out that this kind of thing reduces conversions.",
        "time": 1413910671,
        "type": "comment"
    },
    {
        "by": "coreymgilmore",
        "id": 8488319,
        "score": 1,
        "time": 1413910688,
        "title": "The Best Beer in the Country",
        "type": "story",
        "url": "http://www.popularmechanics.com/technology/gadgets/news/the-best-beer-in-the-country-just-got-better-17316585?click=pm_latest"
    },
    {
        "by": "philangist",
        "id": 8488320,
        "parent": 8488224,
        "text": "Programmers SHOULD know how to write tests for their code. And how to write clean, well designed code (even if they don&#x27;t call it SOLID). And they should know how to use regexps as well. These are skills that are transferrable whether you&#x27;re doing frontend work for a small ad agency or crunching numbers for the NSA.",
        "time": 1413910690,
        "type": "comment"
    },
    {
        "by": "nathanb",
        "id": 8488321,
        "parent": 8487943,
        "text": "The most challenging aspect of programming, for me, is the ability to turn something over in my head to look at it mentally. To be honest, I can only do that for any length of time on a good day. Writing stuff down is laggy and sometimes lossy, so I am only at my most productive when I can take a complex problem with a lot of little fiddly bits, ingest it mentally, and keep a holistic model in my head.<p>Puzzles provide a good first-order estimation of this ability. Not solving puzzles, per se, but at least analyzing them. A good puzzle requires you to use a part of your brain as &quot;scratch space&quot; to hold hypotheses which are applied to other parts of the puzzle. Can I solve it this way? What if I tweak this part over here? Does this assumption simplify the path to a solution, or miss out on an important subtlety? I think the thing I tried previously was more correct; can I remember how to get back to it?<p>I&#x27;m actually not that great at this. Many of my peers are better. Fortunately, I can compensate in other areas (I&#x27;m glad to see writing skills called out in the comments, as I like to think I&#x27;m a good communicator). I have developed some coping mechanisms (the ability to identify which details in a problem can be succinctly written down and which subset can be stored in my head -- I refer to my notebook as swap space), but I do see the value of puzzle-type questions for evaluating a candidate&#x27;s ability to do this sort of thing.<p>Does this mean that if you can&#x27;t do it, you aren&#x27;t a programmer? Of course not. I happen to be a kernel developer, so I write a lot of code that communicates with other modules, doesn&#x27;t have much of a UI, and has a multi-dimensional rather than flat structure. Different types of programming need different sets of skills. Find your niche, and don&#x27;t fret about how you don&#x27;t fit into other niches as well as you fit into yours.<p>(I interviewed at Google seven years ago and was rejected for being weak at algorithm design. A few years ago I had an aha! moment where I found a simple, elegant, and easy solution to the problem I completely bombed in the interview. Apparently my subconscious had been chewing away at it for literally years. I think solving a question in four years or so is sub-optimal from Google&#x27;s perspective so I&#x27;m sure they were right to reject me, and my inability to do it faster speaks to the deficiencies I mention above. But in the ensuing years I have become reasonably successful in my current line of work, which I enjoy completely. My failure at Google does not keep me up at night.)<p>TL;DR: Puzzles only measure a single axis, so find which axis your greatness lies on and optimize for that.",
        "time": 1413910702,
        "type": "comment"
    },
    {
        "by": "dserodio",
        "id": 8488322,
        "parent": 8426360,
        "text": "Encryption avoids a lot of problems, but this has _nothing_ to do with encryption",
        "time": 1413910713,
        "type": "comment"
    },
    {
        "by": "MeoMix420",
        "id": 8488323,
        "score": 1,
        "text": "I saw some discussions earlier today surrounding http:&#x2F;&#x2F;flatuicolors.com&#x2F; and http:&#x2F;&#x2F;www.flatuicolorpicker.com&#x2F;. This got me thinking about my color choices and I wanted to get some opinions.<p>I use several of the colors listed on Flat UI: alizarin, nephritis, and sun flower. I often need a lighter&#x2F;darker variant of the colors. To do this, I apply LESS&#x27; &quot;lighten&quot; and &quot;darken.&quot; My colors end up looking like:<p><pre><code>    @baseBlue: rgb(78,166,234);\n    @lightBaseBlue: lighten(@baseBlue, 30%);\n    @darkBaseBlue: darken(@baseBlue, 10%);\n\n    &#x2F;&#x2F;  http:&#x2F;&#x2F;flatuicolors.com&#x2F;\n    @nephritis: rgb(39,174,96);\n    @lightNephritis: lighten(@nephritis, 30%);\n    @alizarin: rgb(231,76,60);\n    @lightAlizarin: lighten(@alizarin, 30%);\n    @darkAlizarin: darken(@alizarin, 10%);\n    @sunFlower: rgb(241, 196, 15);\n</code></pre>\nIs there any psychological benefit associated with lightening&#x2F;darkening each color by consistent percentages? Sometimes I feel like a color looks &#x27;off&#x27; when lightened. For instance, lightNephritis feels like it has a bit too much blue in it, but I&#x27;m happy with nephritis. However, I also feel weird about just choosing a new &#x27;lightGreen&#x27; color instead of lightening my base color.<p>Thoughts?",
        "time": 1413910721,
        "title": "Ask HN: Is there any psychology behind consistently lightening color choices?",
        "type": "story",
        "url": ""
    },
    {
        "by": "arenaninja",
        "id": 8488324,
        "parent": 8488224,
        "text": "Yea I also think people mistake the tools for the trade. The fact is, two programmers can exist who know nothing of about each other&#x27;s toolset, and they aren&#x27;t necessarily better or worse, simply in different domains.<p>Vagrant is (can be) great if you need heavily spec&#x27;d out VMs, but with python I believe virtualenv would suffice. In the end, they are only tools",
        "time": 1413910723,
        "type": "comment"
    },
    {
        "by": "electromagnetic",
        "id": 8488325,
        "kids": [
            8488419,
            8488458
        ],
        "parent": 8487665,
        "text": "Maybe if you&#x27;re lying about your app and policies, it&#x27;s probably not a good idea to bring a newspaper into your offices! Especially when its blatently obvious you&#x27;re looking to use your app to either blackmail or leak this information for your own gain.<p>The Guardian is a newspaper, it acted exactly how it should have.<p>If I knowingly invite a cop into my house and I&#x27;ve got a pound of cocaine on my coffee table. Is it unethical for the cop to arrest me? No. They&#x27;re a fucking cop!<p>If you don&#x27;t want people knowing shady parts of your business, don&#x27;t invite people who make a living publishing stories about shady goings on!",
        "time": 1413910744,
        "type": "comment"
    },
    {
        "by": "phmagic",
        "id": 8488326,
        "parent": 8487809,
        "text": "I&#x27;m not sure what problem this solves but it&#x27;s technically cool.",
        "time": 1413910748,
        "type": "comment"
    },
    {
        "by": "smacktoward",
        "id": 8488327,
        "parent": 8488149,
        "text": "<i>&gt;  We&#x27;re all programmers, but we&#x27;re not all the same</i><p>Which is a rebuttal to something I didn&#x27;t actually say, but OK.<p>Look, <i>obviously</i> there are all different kinds of programmers. Millions and millions of people program computers today, so there&#x27;s no end to the ways you can slice them apart. There are kernel programmers and GUI programmers, mainframe programmers and mobile programmers, Lisp programmers and BASIC programmers, elite programmers and n00b programmers.<p>But <i>they are all programmers,</i> was my point. They all do the work of wrestling with, as one of the people in Tracy Kidder&#x27;s classic <i>The Soul of a New Machine</i> (<a href=\"http://www.amazon.com/The-Soul-A-New-Machine/dp/0316491977\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;The-Soul-A-New-Machine&#x2F;dp&#x2F;0316491977</a>) called it, &quot;La Machine.&quot;<p>In this respect, being a programmer is a lot like being a coal miner: you become one by <i>doing the work.</i> Sure, some miners are handier with a pickaxe than others, and some can stand being down in a dark hole for longer. But regardless of that, everyone who puts on a hard hat with a lamp on it and goes into the mountain <i>is</i> a coal miner. The only thing you have to do to earn the designation is <i>show up and do the work.</i><p>Now for the part of my comment where I (respectfully) challenge your conclusions.<p>You want to divide &quot;programmers&quot; further, into (essentially) &quot;programmers,&quot; who are lazy 9-to-5 stumblebums, and &quot;REAL programmers,&quot; who code with burning fury 23.5 hours a day (the other .5 hours they spend on HN). And then tell the people outside the &quot;REAL programmers&quot; category that, sure, they&#x27;re &quot;programmers,&quot; but they&#x27;re not <i>programmer</i> programmers.<p>But that has a value judgment embedded in it, namely that 23.5-hour-a-day Burning Fury programming is Good Programming, and 9-to-5 programming is Bad Programming. But those positions aren&#x27;t good or bad, they&#x27;re just embraces of different sets of tradeoffs. You note yourself that the Burning Fury programmer sacrifices her health and relationships to get to that level. The 9-to-5 person is just someone who has decided against making that sacrifice. Maybe that limits their career growth, but it lets them hold on to those things. Maybe you&#x27;ve decided to let those things go in order to accomplish more in your work.<p>And both those decisions are fine! I&#x27;m not here to tell you how to live your life. I&#x27;m just saying that your way of being a programmer is not the <i>only</i> way of being a programmer. There are <i>lots</i> of ways to be a programmer. The only thing they all require is that you <i>do the work.</i>",
        "time": 1413910782,
        "type": "comment"
    },
    {
        "by": "mwhuss",
        "id": 8488328,
        "score": 1,
        "text": "",
        "time": 1413910785,
        "title": "Fun with Yosemite and your iPhone",
        "type": "story",
        "url": "http://mwhuss.com/fun-with-yosemite-and-your-iphone"
    },
    {
        "by": "netgainhosting",
        "id": 8488329,
        "score": 2,
        "text": "",
        "time": 1413910797,
        "title": "What Is the Flex-IT Act and Why Should I Care?",
        "type": "story",
        "url": "http://blog.netgainhosting.com/what-is-the-flex-it-act-and-why-should-i-care"
    },
    {
        "by": "rossiben",
        "id": 8488330,
        "score": 1,
        "text": "",
        "time": 1413910805,
        "title": "Do you know about the hidden cloud in your business?",
        "type": "story",
        "url": "http://www.information-age.com/technology/cloud-and-virtualisation/123458576/do-you-know-about-hidden-cloud-your-business"
    },
    {
        "by": "douglogue",
        "id": 8488331,
        "score": 1,
        "text": "",
        "time": 1413910818,
        "title": "AMA with Mattan Griffel on Growth Hacking",
        "type": "story",
        "url": "http://growthhackers.com/questions/show-gh-ama-ask-me-anything-w-mattan-griffel-ceo-of-one-month-930a-pst-1230p-est/"
    },
    {
        "by": "GhotiFish",
        "id": 8488332,
        "parent": 8487714,
        "text": "I can&#x27;t believe you got downvoted for that.",
        "time": 1413910830,
        "type": "comment"
    },
    {
        "by": "Arcanum-XIII",
        "id": 8488333,
        "parent": 8488129,
        "text": "Whats more, I question the validity of equating smartness with puzzle solving abilities. It&#x27;s a bit like equating quality work with having academic credential : no obvious link. \nBeing able to discriminate the worker quality is still a non solved problem - at least not with number. Good judge of character are still way better at that - and well, they&#x27;re pretty exceptional.",
        "time": 1413910852,
        "type": "comment"
    },
    {
        "by": "netgainhosting",
        "id": 8488334,
        "score": 1,
        "text": "",
        "time": 1413910854,
        "title": "Webinar Performance in the Cloud Managing the Risk in Outsourcing",
        "type": "story",
        "url": "http://go.netgainhosting.com/webinar-performance-in-the-cloud-managing-the-risk-in-outsourcing"
    },
    {
        "by": "tarof",
        "id": 8488335,
        "score": 2,
        "text": "",
        "time": 1413910862,
        "title": "We Just Thought, 'This Is How You Start a Company in America' AnyPerk (YC W12)",
        "type": "story",
        "url": "http://www.forbes.com/sites/groupthink/2014/10/21/we-just-thought-this-is-how-you-start-a-company-in-america/"
    },
    {
        "by": "jeffreyrogers",
        "id": 8488336,
        "parent": 8488105,
        "text": "That&#x27;s true. I think the OP is talking about puzzles in the more general sense (e.g. designing novel algorithms). It seems to me that it takes a specific type of mental state to enjoy theoretical CS and math, since much of your time there is spent banging your head against things until everything clicks into place.",
        "time": 1413910896,
        "type": "comment"
    },
    {
        "by": "lisper",
        "id": 8488337,
        "parent": 8487001,
        "text": "Awesome!  But that information needs to be <i>on the TNaCL web page</i>, not in an HN comment.",
        "time": 1413910898,
        "type": "comment"
    },
    {
        "by": "geographomics",
        "id": 8488338,
        "parent": 8485793,
        "text": "Interesting thing from reading the paper was that they deliberately didn&#x27;t purify the olfactory ensheathing cells from the olfactory mucosa (OM) biopsy, as other work has shown it to be less effective if purified. So there may be other cell types or molecular factors at play here as well.<p>Another group has previously found some mesenchymal stem cells (MSCs) in the OM - or at least, cells with known MSC markers - so that&#x27;s also a possibility for aiding repair. Very much looking forward to seeing where this research heads anyway.",
        "time": 1413910905,
        "type": "comment"
    },
    {
        "by": "Alex3917",
        "id": 8488339,
        "kids": [
            8488461
        ],
        "parent": 8488026,
        "text": "The unfortunate reality is that both the CDC and the patient advocacy groups are lying their asses off. On the CDC side, all the recommendations are based around lyme when, as this article points out, there are dozens of tickborne infections including probably many that haven&#x27;t even been discovered yet. So the &#x27;official&#x27; clinical guidelines around treating tickborne illnesses make no sense. And in general many of the recommendations just seem to be deeply epistemologically flawed.<p>Whereas on the patient advocacy side, if you look at their (ILADS) reports, many of the footnotes go to random people&#x27;s blogs, and if you follow the footnote trail long enough it just ends up where many of their recommendations basically just originate with random people making up shit.",
        "time": 1413910930,
        "type": "comment"
    },
    {
        "by": "makomk",
        "id": 8488340,
        "parent": 8487549,
        "text": "I know the systemd developers are now planning on making udev depend on systemd in the near future, and that&#x27;s pretty essential for desktop&#x2F;server Linux.",
        "time": 1413910939,
        "type": "comment"
    },
    {
        "by": "allannjoroge",
        "id": 8488341,
        "score": 1,
        "text": "",
        "time": 1413910948,
        "title": "Bugatti Veyron Grand Sport Vitesse 1 of 1 – investment or a toy for the rich?",
        "type": "story",
        "url": "http://www.v8.autorgy.com/motor-trends/blog/car-news/bugatti-veyron-grand-sport-vitesse"
    },
    {
        "by": "skempe",
        "dead": true,
        "id": 8488342,
        "score": 1,
        "text": "",
        "time": 1413910959,
        "title": "Accelerating Internet of Things Analytics",
        "type": "story",
        "url": "http://www.dataversity.net/accelerating-internet-things-analytics/"
    },
    {
        "by": "bestnoodles",
        "id": 8488343,
        "parent": 8485755,
        "text": "this is great just ordered",
        "time": 1413910964,
        "type": "comment"
    },
    {
        "by": "arenaninja",
        "id": 8488344,
        "parent": 8487840,
        "text": "Thank the programming deities for this one. I&#x27;ve been doing a balancing act with VMs lately and I was about to push my dotfiles to github, but it just seemed like a really bad idea",
        "time": 1413910976,
        "type": "comment"
    },
    {
        "by": "finknotal",
        "id": 8488345,
        "score": 12,
        "text": "",
        "time": 1413910985,
        "title": "Drip coffee 101: Secrets to brewing the perfect cup",
        "type": "story",
        "url": "http://www.cnet.com/news/drip-coffee-101-essential-lessons-learned-testing-home-coffeemakers/"
    },
    {
        "by": "hangonhn",
        "id": 8488346,
        "parent": 8487943,
        "text": "I think some of it comes from our notion of human intelligence being universally applicable to all problems.  Puzzles and chess are often used as a proxy for that.  The thinking goes is that if you&#x27;re smart then you&#x27;ll be good at puzzle solving.  If you&#x27;re smart then you&#x27;ll be a good programmer.  It&#x27;s not really something that has a lot of evidence for.  One of the best career advice I&#x27;ve received is to interview with lots of companies but do it in the order of least wanted job first so by the time you&#x27;re interviewing for the job you really want, you have had lots of practice.  It works pretty well.  Puzzle solving and programming are both skills that you get good at with practice.<p>Someone else already commented that if you program then you&#x27;re a programmer.  I think that&#x27;s really the only definition you should use.  Everything else are just proxies, mostly bad ones, for if you&#x27;re a good programmer or not.",
        "time": 1413911016,
        "type": "comment"
    },
    {
        "by": "purpleturtle",
        "id": 8488347,
        "parent": 8488018,
        "text": "OP here if anyone has questions. Stripe plans to do another one of these.",
        "time": 1413911017,
        "type": "comment"
    },
    {
        "by": "cubancigar11",
        "id": 8488348,
        "parent": 8487722,
        "text": "I am not sure what issues you are talking about. I was talking about how external type of education (western in this case), in general, and specially when conducted over generations, completely changes our moral compass and understanding, by using specific example of dowry.",
        "time": 1413911023,
        "type": "comment"
    },
    {
        "by": "B-n-c",
        "id": 8488349,
        "kids": [
            8488375
        ],
        "parent": 8488313,
        "text": "The one piece that puzzles me is how the frames are being captured from the iOS simulator. Are you launching multiples per user account, where each one is a different session at a different portion of the screen, and essentially screenshotting each? Or did you modify the simulator somehow and are hooking in to grab the screen, so that way its irrelevant of their position on screen?<p>Thanks!",
        "time": 1413911028,
        "type": "comment"
    },
    {
        "by": "erickhill",
        "id": 8488350,
        "score": 1,
        "text": "",
        "time": 1413911030,
        "title": "Why I say yes to Twitter",
        "type": "story",
        "url": "http://scripting.com/2014/10/21/whyISayYesToTwitter.html"
    },
    {
        "by": "coldcode",
        "id": 8488351,
        "parent": 8488029,
        "text": "Who the hell would design a system involving 911 calls with a limit that could be reached in a couple years of calls? I can&#x27;t imagine how I would go about being stupid enough to not understand the nature of the requirement to not have 911 calls fail. This isn&#x27;t cobol with a fixed field limit of N digits someone specified in 1964.",
        "time": 1413911045,
        "type": "comment"
    },
    {
        "by": "ANTSANTS",
        "id": 8488352,
        "parent": 8485601,
        "text": "The person who wrote this post is the developer of OptiFine, a Minecraft mod that significantly improves and stabilizes performance by optimizing the game at many levels. In order to make it, they absolutely needed to understand the game engine at a level comparable to the Mojang developers.",
        "time": 1413911060,
        "type": "comment"
    },
    {
        "by": "cturhan",
        "id": 8488353,
        "score": 1,
        "text": "",
        "time": 1413911080,
        "title": "Deconstructing and restyling D3 visualizations",
        "type": "story",
        "url": "http://dl.acm.org/citation.cfm?id=2647411"
    },
    {
        "by": "ciupicri",
        "id": 8488354,
        "parent": 8487979,
        "text": "I had to use port 465 for the Outlook that comes with the Lumia phone.",
        "time": 1413911112,
        "type": "comment"
    },
    {
        "by": "Aardwolf",
        "id": 8488355,
        "parent": 8487254,
        "text": "It took me a while to figure out you could scroll down.<p>Many of those fancy scroll effect websites have that problem.<p>If there is text or something else chopped off at the bottom, then it&#x27;s obvious you can scroll.<p>But this kind of page looks like it&#x27;s everything there is, and only if you discover that you can scroll down anyway, you will do so.",
        "time": 1413911113,
        "type": "comment"
    },
    {
        "by": "lostcolony",
        "id": 8488356,
        "kids": [
            8488407
        ],
        "parent": 8487943,
        "text": "Interview questions you don&#x27;t like&#x2F;fail shouldn&#x27;t be viewed as reflective of you, but reflective of your fit at that company.<p>They asked a puzzle-y question you couldn&#x27;t solve? Either their problems are puzzle-y, or they have terrible criteria for evaluating people; either way, do you really want to work there?<p>They asked a hard algorithmic problem, the kind that was someone&#x27;s PhD thesis 30 years ago, and which you&#x27;d only get the optimal result to if you&#x27;d seen it before? Either they really do expect you to know stuff like that off the top of your head, or they expect you to behave a certain way when confronted with stuff you don&#x27;t know; either way, do you really want to work in an environment with those kinds of expectations?<p>They asked you to code something hard withing a short time limit, and while you can code it, you failed the time limit; do you really want to work somewhere where speed is -the- criteria to optimize, rather than quality&#x2F;maintainability&#x2F;whatever (or at least where they&#x27;re selecting for that rather than those other attributes)?<p>Etc.<p>In general, as others have said, if you program, you&#x27;re a programmer. What specific roles you&#x27;re a fit for is largely orthogonal to that.<p>If you don&#x27;t pass a company&#x27;s test, view it as having dodged a bullet, not having &#x27;failed&#x27;; either they expect you to have something from day one that you don&#x27;t have, or they are terrible at testing for what they really want, and so their culture, codebase, etc, is likely miserable. In neither case do you want to work for them.<p>You want to work for a place whose expectations for what you have on day one fits what you actually have (whatever they may be), -and- whose interview process tests for that (even if it&#x27;s a little flaky), so both you and they can expect, going into the job, that you can handle it.<p>Remember, too, that there are false positives and false negatives even when they&#x27;re testing specifically for what they want. Failure to figure out a puzzle doesn&#x27;t even mean the person isn&#x27;t good at figuring out puzzles; just that in this case, in this contrived, high stress set of circumstances (an interview), they were unable to come up with an answer in the time limit.",
        "time": 1413911136,
        "type": "comment"
    },
    {
        "by": "DannyBee",
        "id": 8488357,
        "parent": 8487768,
        "text": "I have the same security keys registered with three completely different google accounts (two completely unrelated domain accounts and one gmail account), so i&#x27;m not sure what&#x27;s going on for you.",
        "time": 1413911160,
        "type": "comment"
    },
    {
        "by": "leoc",
        "id": 8488358,
        "parent": 8486972,
        "text": "The consensus seems to be that the &quot;cinematic reality not augmented reality&quot; message probably refers to the realistic accommodation - virtual objects being in focus at the correct focal depth - which Magic Leap is apparently aiming for and which other 3D display systems don&#x27;t offer. If that message seems confusing, especially in light of the fact that neither 2D nor (standard) 3D cinema offer realistic accommodation, let&#x27;s just say that Magic Leap&#x27;s PR operation has not always been the tightest ship: <a href=\"https://www.youtube.com/watch?v=w8J5BWL8oJY\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=w8J5BWL8oJY</a> .",
        "time": 1413911182,
        "type": "comment"
    },
    {
        "by": "freshbreakfast",
        "id": 8488359,
        "kids": [
            8488431
        ],
        "parent": 8488174,
        "text": "Hey all, I wrote this thing.  And since Svbtle doesn&#x27;t have a commenting feature, I&#x27;ll probably be hanging here all day if you have any questions, feedback, or violent disagreements about the post.  I could talk about this topic all day, so shoot!",
        "time": 1413911182,
        "type": "comment"
    },
    {
        "by": "nemo",
        "id": 8488360,
        "parent": 8487943,
        "text": "I really like certain types of puzzles - figuring out the causes of bugs, figuring out how to implement something in code cleanly and elegantly, figuring out how to make sure something is designed maintainably and intelligibly to spare future grief, figuring out the mysterious ways of programmers who wrote code I now maintain.<p>I also like figuring out and implementing the right algorithms for a problem, but it&#x27;s a pretty small part of what I do at work, and if it&#x27;s complex, it&#x27;s something I like to take some time to think through and sometimes read up on to make sure I really understand what I&#x27;m getting into, so I really don&#x27;t like playing the logic puzzle games they use in interviews at some places.  Being quick with an algorithmic answer is a nice skill, but being a good programmer is a craft that involves more than cleverness with algorithms.",
        "time": 1413911261,
        "type": "comment"
    },
    {
        "by": "adestefan",
        "id": 8488361,
        "kids": [
            8488526,
            8488408
        ],
        "parent": 8487833,
        "text": "&#x2F;etc&#x2F;systemd&#x2F;journald.conf<p>ForwardToSyslog=True<p>or<p>systemd.journald.forward_to_syslog=True on the kernel command line.<p>Is it just cool to not read documentation anymore?",
        "time": 1413911274,
        "type": "comment"
    },
    {
        "by": "herman5",
        "id": 8488362,
        "score": 2,
        "text": "",
        "time": 1413911290,
        "title": "Departed Braintree founder starts $100M venture company",
        "type": "story",
        "url": "http://www.builtinchicago.org/blog/departed-braintree-founder-bryan-johnson-starts-100-million-venture-fund-focused-core-issues"
    },
    {
        "by": "jbaskette",
        "id": 8488363,
        "parent": 8487943,
        "text": "It is well known that the ability to solve mathematical puzzles was used as a screening tool at places like Google to screen new hires.  It seems to me that this practice was based on the belief that there was an affinity or correlation between the interest and ability to solve mathematical puzzles and programming.  I suspect there is such a correlation, but it is a weak one and is not useful as a screen tool for hiring which is why the practice has been dropped.  But, jigsaw puzzles are not mathematical puzzles, so there may be no correlation at all there.  I love mathematical puzzles, but I am bored with jigsaw puzzles.<p>So, since it is not the case that loving jigsaw puzzles implies &quot;ability and desire to be a programmer&quot;, then the fact that you hate jigsaw puzzles implies nothing with respect to your status as a programmer.",
        "time": 1413911296,
        "type": "comment"
    },
    {
        "by": "slg",
        "id": 8488364,
        "kids": [
            8488429,
            8488402
        ],
        "parent": 8487665,
        "text": "The Guardian acted perfectly ethically as a news organization.<p>The Guardian acted completely unethically as a business partner.<p>Another reason why introducing profit motives into a news organization is a recipe for trouble.  Conflicts of interest like this are just too common.",
        "time": 1413911308,
        "type": "comment"
    },
    {
        "by": "vlunkr",
        "id": 8488365,
        "parent": 8488149,
        "text": "The best programmer I&#x27;ve ever worked with is done at 5. He has lots of other hobbies. But at work he&#x27;s incredible efficient and solves really hard problems in brilliant ways. You don&#x27;t have to give up your whole life to be a good programmer, contrary to what many people on HN seem to think. This mentality drives me crazy.",
        "time": 1413911330,
        "type": "comment"
    },
    {
        "by": "TheRealWatson",
        "id": 8488366,
        "kids": [
            8488519
        ],
        "parent": 8488159,
        "text": "Many companies have a hiring process that favors hiring very similar engineers. Hiring different types of programmers would increase their diversity, which for me is a great quality of a team. The challenge here is to identify the competent engineers when you can&#x27;t use cookie cutter assessment tactics.",
        "time": 1413911331,
        "type": "comment"
    },
    {
        "by": "geographomics",
        "id": 8488367,
        "parent": 8485843,
        "text": "I assume at least some of the downvotes were given simply that he was off topic. The ethical issues of using embryonic stem cells are hardly applicable to grafting one&#x27;s own cells from one part of the body to another.",
        "time": 1413911347,
        "type": "comment"
    },
    {
        "by": "coldcode",
        "id": 8488368,
        "parent": 8487799,
        "text": "All I remember is that Webvan attracted ridiculous investment as well and look how well that turned out. Google can waste billions on utter speculation and never notice the blip. If you can attract such enormous funds why not, the worst that happens is you fail.",
        "time": 1413911362,
        "type": "comment"
    },
    {
        "by": "codegeek",
        "id": 8488369,
        "kids": [
            8488479
        ],
        "score": 2,
        "text": "We love to talk about PHP, Ruby&#x2F;Rails, Python (Django&#x2F;Flask) etc for web applications. But what are your thoughts on using Microsoft stack specially given the advancements they have made so far with the whole ASP.NET MVC stuff.<p>I am asking because I have a SAAS project for which I need a technical co-founder and ended up taling to my brother who is excellent at MS stack (he does it for a living). of course he is biased and for every question I had for him (can it handle sessions well, ORM etc), he had an answer.<p>I know that stackoverflow is a huge MS shop but anyone else doing it at a large scale?<p>To give you more background, this SAAS project will involve latest web functionalities including drag drop builders, lot of client side javascripting (jquery etc)<p>For me, it is critical that the technical co-founder knows the stack more than what I think is good (i personally love to play with Flask btw:). So I am leaning towards giving him a go ahead but I know there are shit load of licenses to buy :)",
        "time": 1413911372,
        "title": "Ask HN: Microsoft Shop (ASP.NET MVC 4/5) for a New SAAS Web Project",
        "type": "story",
        "url": ""
    },
    {
        "by": "malyk",
        "id": 8488370,
        "parent": 8487967,
        "text": "There is nightlife and such in the east bay...",
        "time": 1413911375,
        "type": "comment"
    },
    {
        "by": "brianbreslin",
        "id": 8488371,
        "parent": 8487077,
        "text": "@logicX would love tot alk to your friend Paul. I run RefreshMiami, the largest startup community in South Florida, we&#x27;d love to get someone from MagicLeap to give a talk.",
        "time": 1413911386,
        "type": "comment"
    },
    {
        "by": "hk__2",
        "id": 8488372,
        "kids": [
            8488550
        ],
        "parent": 8488235,
        "text": "Could someone ELI5 this pro-systemd&#x2F;anti-systemd thing?",
        "time": 1413911390,
        "type": "comment"
    },
    {
        "by": "taf2",
        "id": 8488373,
        "parent": 8480313,
        "text": "Mysql does have a much better durability solution -galera cluster IMO... Does Postgres have something similar?",
        "time": 1413911395,
        "type": "comment"
    },
    {
        "by": "e7620",
        "id": 8488374,
        "parent": 8487528,
        "text": "Not really, remember daemontools? There are almost a hundred init systems very superior technically compared to sysv and systemd, the truth is that sysv has NEVER been considered the best.",
        "time": 1413911419,
        "type": "comment"
    },
    {
        "by": "weiyin",
        "id": 8488375,
        "parent": 8488349,
        "text": "We wrote some custom OS X code to capture frames from individual processes. That way the simulators don&#x27;t need to be positioned in any way or even visible. Cheers.",
        "time": 1413911428,
        "type": "comment"
    },
    {
        "by": "emotionalcode",
        "id": 8488376,
        "parent": 8488278,
        "text": "I&#x27;m socially awkward and proud of it! If I wasn&#x27;t, I don&#x27;t think I&#x27;d be being me.",
        "time": 1413911450,
        "type": "comment"
    },
    {
        "by": "riseupgames",
        "id": 8488377,
        "parent": 8486811,
        "text": "Thank you!<p>1) I&#x27;ll see about tweaking the hit size of the MF control\n2) Yep, that&#x27;s definitely on my to-do list. No ETA on when it&#x27;ll come (I am still learning Apple&#x27;s APIs), but it&#x27;s something I do want to add :)",
        "time": 1413911455,
        "type": "comment"
    },
    {
        "by": "jryan49",
        "id": 8488378,
        "parent": 8487840,
        "text": "I&#x27;ve been doing this for a year or two with dropbox. I&#x27;ve tried vcsh and others and stow has been by far the best so far.",
        "time": 1413911458,
        "type": "comment"
    },
    {
        "by": "cebka",
        "id": 8488379,
        "score": 1,
        "text": "",
        "time": 1413911470,
        "title": "Show HN: Hpenc – high performance encryption command line utility",
        "type": "story",
        "url": "https://github.com/vstakhov/hpenc"
    },
    {
        "by": "jianshen",
        "id": 8488380,
        "parent": 8488198,
        "text": "Strangely enough, the kind of immersive experience technology that Magic Leap is developing might just help with that problem.",
        "time": 1413911495,
        "type": "comment"
    },
    {
        "by": "siyer",
        "id": 8488381,
        "score": 1,
        "text": "",
        "time": 1413911509,
        "title": "A Consensus on the Brain Training Industry from the Scientific Community",
        "type": "story",
        "url": "http://longevity3.stanford.edu/blog/2014/10/15/the-consensus-on-the-brain-training-industry-from-the-scientific-community/"
    },
    {
        "by": "priomsrb",
        "id": 8488382,
        "parent": 8488203,
        "text": "Ahh. Thank you for reminding me. It&#x27;s been added now.",
        "time": 1413911510,
        "type": "comment"
    },
    {
        "by": "bentcorner",
        "id": 8488383,
        "parent": 8488000,
        "text": "&gt; In front of the imaging devices there are high speed mask device (LCD?) that blocks off portions of the image that are not at the current focal depth.<p>It would be interesting to see how this works in practice.  The eye can&#x27;t focus on something that close.  For an example, imagine a speck of dirt on your glasses - it shows up as a blob in your vision, not as a dot.",
        "time": 1413911518,
        "type": "comment"
    },
    {
        "by": "brianbreslin",
        "id": 8488384,
        "parent": 8488163,
        "text": "Its going to be very difficult for them to hire such specialized skill sets ANYWHERE. They need to find very high end optics and microprocessor experience, and thats tough to find either in palo alto or hollywood, fl",
        "time": 1413911532,
        "type": "comment"
    },
    {
        "by": "FreakyT",
        "id": 8488385,
        "kids": [
            8488434
        ],
        "parent": 8488235,
        "text": "Interesting discussion! I would have liked it if the author had provided some background information (for the uninitiated) about some of the other related issues mentioned.  For example, what was meant by &quot;the horrors of PulseAudio&quot;, &quot;the udev debacle&quot;, and why was HAL bad?<p>I realize that I could probably find out &quot;bad things about HAL&quot; via internet searching, but it would be more interesting to see the author&#x27;s take on the issues in the context of the article.",
        "time": 1413911544,
        "type": "comment"
    },
    {
        "by": "taf2",
        "id": 8488386,
        "parent": 8480294,
        "text": "How is this correct, mysql has synchronous replication.  does Postgres have something equivalent to galera?",
        "time": 1413911547,
        "type": "comment"
    },
    {
        "by": "TallboyOne",
        "id": 8488387,
        "parent": 8488084,
        "text": "Lol, this made me laugh out loud.",
        "time": 1413911553,
        "type": "comment"
    },
    {
        "by": "funkyy",
        "id": 8488388,
        "parent": 8487106,
        "text": "Seems cooler? Magic Leap didnt even properly presented their technology, so how can you know?<p>If they gave $500 million to this company it must mean it is either better or have better perspective. As simple as that.",
        "time": 1413911567,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488389,
        "parent": 8488235,
        "time": 1413911582,
        "type": "comment"
    },
    {
        "by": "Aardwolf",
        "id": 8488390,
        "parent": 8488235,
        "text": "I think most of it is ok, such as the init system, except the logging. Why did they have to touch logging, and change everything about it, and put it in a non-text format...",
        "time": 1413911593,
        "type": "comment"
    },
    {
        "by": "tormeh",
        "id": 8488391,
        "parent": 8488137,
        "text": "Yeah, that lowers cost considerably. Copper is attractive even when it needs to be cut out of signal cables. The Norwegian railroad authority is switching to aluminum cables in certain parts of the country to avoid it.",
        "time": 1413911603,
        "type": "comment"
    },
    {
        "by": "digitalcreate",
        "id": 8488392,
        "score": 4,
        "text": "",
        "time": 1413911630,
        "title": "Product Hunt Gets Social with Twitter-Like Profiles, Following, Notifications",
        "type": "story",
        "url": "http://techcrunch.com/2014/10/21/product-hunt-gets-social-with-twitter-like-user-profiles-following-features-and-notifications/"
    },
    {
        "by": "troyastorino",
        "id": 8488393,
        "parent": 8485866,
        "text": "Ah, didn&#x27;t realize that there was this dimension to the debate. Sorry for the hasty&#x2F;inaccurate comment, and thanks for correcting me.",
        "time": 1413911632,
        "type": "comment"
    },
    {
        "by": "techieinafrica",
        "dead": true,
        "id": 8488394,
        "score": 1,
        "text": "",
        "time": 1413911633,
        "title": "Lean Startup Machine Johannesburg Ticket Giveaway",
        "type": "story",
        "url": "http://us5.campaign-archive2.com/?u=b5c77b5d9fe8557cd2e26f469&id=6ce3855d0f&e=[UNIQID]"
    },
    {
        "by": "tovogueorbust",
        "dead": true,
        "id": 8488395,
        "score": 1,
        "text": "",
        "time": 1413911646,
        "title": "How to Style Pastel Coats",
        "type": "story",
        "url": "http://www.tovogueorbust.com/2014/10/london-calling-eluxe-connected-collection-collaboration.html"
    },
    {
        "by": "popforms",
        "dead": true,
        "id": 8488396,
        "score": 1,
        "text": "",
        "time": 1413911663,
        "title": "We're building the perfect notebook: Kickstarter, goals, and lessons learned",
        "type": "story",
        "url": "https://popforms.com/spark-notebook-kickstarter-update/"
    },
    {
        "by": "dannieb",
        "id": 8488397,
        "score": 5,
        "text": "",
        "time": 1413911669,
        "title": "How Pinterest drives significant user growth through signups",
        "type": "story",
        "url": "http://engineering.pinterest.com/post/100594540604/lessons-in-growth-and-increasing-signups"
    },
    {
        "by": "davedx",
        "id": 8488398,
        "parent": 8488318,
        "text": "The pinning is actually buggy: it pins the Mac to the wrong vertical offset when you scroll past the threshold the pin hits. At least on Chrome on my Macbook Air it does, anyway. Maybe it works correctly at other resolutions or browsers.<p>So not really &quot;parallax right&quot; if you&#x27;re counting the whole page from top to bottom. I like the images a lot though, they&#x27;re very nice.",
        "time": 1413911701,
        "type": "comment"
    },
    {
        "by": "taf2",
        "id": 8488399,
        "parent": 8480319,
        "text": "Mysql is fast and easy to scale and make durable, what features of database do you really use that is not met by, fast, durable and scalable... Sounds more like perhaps some sort of belief rather than data?",
        "time": 1413911701,
        "type": "comment"
    },
    {
        "by": "danschumann",
        "id": 8488400,
        "kids": [
            8488528,
            8488411
        ],
        "parent": 8487943,
        "text": "Best stick to the shallow end of the pool if you can&#x27;t swim.<p>Do you program?  Then you are a programmer.  However, in some circles, where extremely complex problems need to be solved, they would say, &quot; No &quot;, because you can&#x27;t do any of the programming required, and you&#x27;d be as useful to them as a rock, only less useful because you take air and food.<p>I play volleyball occasionally, but if I went to the olympic men&#x27;s team, they would tell me I don&#x27;t really play volleyball, I&#x27;ve not yet earned the right to say that I have.<p>It&#x27;s a matter of skills and standards.  In the right context I can call myself a car mechanic.. like if my car needs air the tires, but beyond that I&#x27;m not.<p>If you can program simple things on the web you can get away with calling yourself a programmer until you run into problems that make you realize you&#x27;re not, like complex graphics algorithms.<p>I can cook food at home, but if I walk into a 3 michelin star restaurant and try to get a job, it&#x27;s not like I&#x27;m going to write an article if they don&#x27;t like my food. Boo hoo, they made me cook for them, how dare they?  Whatever they&#x27;re doing, it&#x27;s working, so why knock the process that produces success when you can mimic it?",
        "time": 1413911704,
        "type": "comment"
    },
    {
        "by": "rasz_pl",
        "id": 8488401,
        "parent": 8485495,
        "text": "Trouble with single pixel thermal imaging is inertia - thermopiles have thermal mass, you cant  take 1000 readings per second, you cant even take 100 readings per second. So while 1 pixel  camera in visible light spectrum can work thanks to hi speed acquisition, thermal one will be beyond useless.<p>not to mention the wave of extremely cheap thermal imagers we got this year -Flir one, seek thermal, all in ~$200 price range.",
        "time": 1413911710,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488402,
        "parent": 8488364,
        "time": 1413911724,
        "type": "comment"
    },
    {
        "by": "dr_",
        "id": 8488403,
        "score": 1,
        "text": "",
        "time": 1413911733,
        "title": "Health Care Accelerators Evolve Towards Specialization [pdf]",
        "type": "story",
        "url": "http://www.chcf.org/~/media/MEDIA%20LIBRARY%20Files/PDF/S/PDF%20SurvivalFittestAccelerators.pdf"
    },
    {
        "by": "kryptiskt",
        "id": 8488404,
        "parent": 8487942,
        "text": "It&#x27;s not about what the public want but what they need.",
        "time": 1413911745,
        "type": "comment"
    },
    {
        "by": "JosephRedfern",
        "id": 8488405,
        "parent": 8487809,
        "text": "Yo, dawg... <a href=\"http://i.imgur.com/Ib0WUeT.png\" rel=\"nofollow\">http:&#x2F;&#x2F;i.imgur.com&#x2F;Ib0WUeT.png</a>",
        "time": 1413911747,
        "type": "comment"
    },
    {
        "by": "panarky",
        "id": 8488406,
        "kids": [
            8488425,
            8488418
        ],
        "parent": 8488113,
        "text": "Once upon a time I was a programmer, building CRUD apps for enterprises. I hated puzzles, too.<p>Then I discovered quicksort, and graph search, and Bayesian inference, and Dijkstra, and Karatsuba.<p>I&#x27;m still a programmer, but now I love puzzles, too.",
        "time": 1413911770,
        "type": "comment"
    },
    {
        "by": "rdtsc",
        "id": 8488407,
        "parent": 8488356,
        "text": "Agreed on all points.<p>But how would you interview a candidate? I see what not to do.<p>Here is what I do:<p>* Ask about their previous work. Dig into something they are excited or proud of.<p>* Try to solve a problem together. Usually a simplified version problem I am actually solving at the moment at work.<p>* If it is a new grad. I will ask them some simple questions about data structures, school projects.<p>* If there is any sample code, anywhere, I like to see it and it is a big + sometimes.<p>* See if and what kind of questions they ask.<p>Does that work? What would you add&#x2F;remove?<p>I try not be a &quot;dick&quot; and take the approach of &quot;ok, let&#x27;s work on this together&quot; approach because that is how things work here.<p>Another approach (which I don&#x27;t like as much) is to go by the &quot;we want to hire smart people&quot; mantra. &quot;smart&quot; here is is nebulous of course. So how do you do it? IQ tests. Oh but those are illegal, so just write a tests that looks like one without calling it an &quot;IQ test&quot;. That involves puzzles usually too. So I think that is how puzzles became popular.",
        "time": 1413911774,
        "type": "comment"
    },
    {
        "by": "e7620",
        "id": 8488408,
        "parent": 8488361,
        "text": "To say that this is not fair would be an understatement. systemd-journald is only one component, there are more than 50!",
        "time": 1413911776,
        "type": "comment"
    },
    {
        "by": "taf2",
        "id": 8488409,
        "parent": 8479002,
        "text": "I agree and perhaps see if you can shard between multiple servers.",
        "time": 1413911815,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488410,
        "time": 1413911822,
        "type": "story"
    },
    {
        "by": "general_failure",
        "id": 8488411,
        "kids": [
            8488438
        ],
        "parent": 8488400,
        "text": "I have to admit, I don&#x27;t understand what you are trying to say.<p>Are you saying puzzles are somehow the higher level of programming? You are completely wrong.",
        "time": 1413911824,
        "type": "comment"
    },
    {
        "by": "gamechangr",
        "id": 8488412,
        "score": 1,
        "text": "",
        "time": 1413911824,
        "title": "African Countries pass on hosting Soccer Championship – fear Ebola",
        "type": "story",
        "url": "http://qz.com/284807/soccer-is-now-a-conduit-for-ebola-fears-in-africa/"
    },
    {
        "by": "weiyin",
        "id": 8488413,
        "parent": 8488264,
        "text": "definitely a possibility :)<p>we&#x27;ll check that out, thanks for the heads up.",
        "time": 1413911835,
        "type": "comment"
    },
    {
        "by": "Blahah",
        "id": 8488414,
        "parent": 8487943,
        "text": "I personally dislike puzzles (of the toy&#x2F;jigsaw variety), riddles, and so on. But I love solving problems when programming. A programming problem abstracted to a word problem is no longer fun - you&#x27;ve taken away half the toolset I have for tackling the problem. It&#x27;s the synergy between mind and machine that gives me deep joy when programming - the fact that the tedious repetitive parts of mental gymnastics are turned into creative problem solving, which in turn leaves me more time for creative solutions to the problems that weren&#x27;t repetitive.",
        "time": 1413911844,
        "type": "comment"
    },
    {
        "by": "seanflyon",
        "id": 8488415,
        "parent": 8485442,
        "text": "That&#x27;s the exact strategy that worked for Amazon.",
        "time": 1413911847,
        "type": "comment"
    },
    {
        "by": "gogomanny",
        "id": 8488416,
        "score": 5,
        "text": "",
        "time": 1413911863,
        "title": "Sweat the Product: Jack Groetzinger",
        "type": "story",
        "url": "http://www.sweattheproduct.com/jack-groetzinger?jack=1"
    },
    {
        "by": "ryanpardieck",
        "id": 8488417,
        "parent": 8481513,
        "text": "This thread has included some interesting discussion of how everyone handles the different tasks of a) committing individual units of work, b) saving works-in-progress, c) syncing files, d) backing up files, and e) persistent undo editor features.<p>I thought I&#x27;d toss out what my setup is right now on my personal machine, for a bit of reflection&#x2F;discussion...<p>- I compulsively save to disk after nearly every edit, so I&#x27;m a big fan of editors that provide some kind of persistent undo functionality. Right now I&#x27;m using live-archive inside the Atom editor, and it is wonderful. I hit cmd-shift-y and it pops the current buffer open in a live-archive interface that includes VCR-like with rewind&#x2F;fast-forward buttons, etc. It leaves me feeling quite free to mess with code a little more dangerously that I would otherwise. Whereas before I might briefly comment out a line while I try something out, now I&#x27;ll just delete it and hack away. Anything that was there is just a cmd-shift-y away.<p>live-archive is actually maybe the foremost reason I&#x27;m still using Atom. I&#x27;ll probably switch away from it eventually, but I&#x27;m grown to like the customized little hole I&#x27;ve built for myself, inside that particular editor. I might try out a JetBrains IDE next, sometime ...<p>- I don&#x27;t do a lot of work-in-progress saving. Maybe I should be better about this? I&#x27;m not a fan of git histories that read like &quot;went to lunch,&quot; &quot;stuck, think on this--&quot; etc. Even when I&#x27;m the only one that&#x27;s going to be seeing them. I keep a gitignored text file where I tend to scribble down notes like this, but maybe I should play around with WIP commits.<p>- For syncing I have an hourly cron job that does a rsync -av --delete-after for my important directories to several different locations. This is mostly meant as a true sync and not backup, but I do find myself using it as a way to lose no more than an hour&#x27;s work at a time. I might change this to running every 30 or 20 minutes since it doesn&#x27;t seem to tax the machine too much.<p>- For backup I have crashplan backing everything up to a local external drive and then their cloud service too. I haven&#x27;t put a terrible amount of thought into this. It only runs when I sleep. I want to play around with using arq and amazon glacier eventually.<p>For git I just do small unit-of-work commits for myself, and then cleaning up when necessary.",
        "time": 1413911880,
        "type": "comment"
    },
    {
        "by": "general_failure",
        "id": 8488418,
        "kids": [
            8488451
        ],
        "parent": 8488406,
        "text": "Algorithms and puzzles are different things.<p>If I asked someone what is an algorithm and they replied &#x27;it&#x27;s a puzzle where you solve...&quot;, I would laugh my ass off.",
        "time": 1413911902,
        "type": "comment"
    },
    {
        "by": "tomp",
        "id": 8488419,
        "parent": 8488325,
        "text": "It doesn&#x27;t really need to be a cop&#x2F;reporter. If you&#x27;re doing something unethical&#x2F;illegal, don&#x27;t show nor tell me, period! If you do, count on me reporting on it, if nothing else to save my ass. Unless you&#x27;re a really good friend, that is, and even in that case there would be a big ethical dilemma (I would probably still report on you if you harm another person).",
        "time": 1413911920,
        "type": "comment"
    },
    {
        "by": "tiffanyricks",
        "id": 8488420,
        "parent": 8488300,
        "text": "The incentives are nice but the &quot;True&quot; ride-sharing organizations would take offense to calling Uber and Lyft a ride share.  They are currently defined as a TNC- Transportation Network company.",
        "time": 1413911922,
        "type": "comment"
    },
    {
        "by": "GFischer",
        "id": 8488421,
        "parent": 8485968,
        "text": "Are you sure you rewrote a &quot;system&quot;? Or a program?<p>Fred Brooks makes a distinction between a program, a product, a system, and a &quot;programming system product&quot; (what I believe Joel was thinking about when he was talking about Netscape)<p>&quot;A product (more useful than a program):<p>can be run, tested, repaired by anyone<p>- usable in many environments on many sets of data.<p>- must be tested<p>- documentation<p>Brooks estimates a 3x cost increase for this.<p>To be a component in a programming system (collection of interacting programs like an OS):<p>- input and output must conform in syntax, semantics to defined interfaces<p>- must operate within resource budget<p>- must be tested with other components to check integration (very expensive since interactions grows exponentially in n).<p>Brooks estimates that this too costs 3x.<p>A combined programming system product is 9x more costly than a program.<p><a href=\"http://www.cs.usfca.edu/~parrt/course/601/lectures/man.month.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cs.usfca.edu&#x2F;~parrt&#x2F;course&#x2F;601&#x2F;lectures&#x2F;man.month...</a><p><a href=\"http://books.cat-v.org/computer-science/mythical-man-month/tmmm.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;books.cat-v.org&#x2F;computer-science&#x2F;mythical-man-month&#x2F;t...</a>",
        "time": 1413911924,
        "type": "comment"
    },
    {
        "by": "ForHackernews",
        "id": 8488422,
        "score": 1,
        "text": "",
        "time": 1413911936,
        "title": "Uber Rival Gett Increases Driver Compensation to $0.70/minute",
        "type": "story",
        "url": "http://www.slate.com/blogs/moneybox/2014/10/15/gett_challenges_uber_says_it_will_pay_drivers_double_what_uber_lyft_offer.html"
    },
    {
        "by": "bentcorner",
        "id": 8488423,
        "parent": 8488206,
        "text": "As far as jigsaw puzzles go, it would be interesting to see if there are unique ways to optimize your piece search.<p>There&#x27;s the edge pieces and sorting by color.  I&#x27;ve found that sub-sorting by pegs&#x2F;holes can dramatically help - I had a &quot;picture made up of pictures&quot; puzzle which allowed me to correctly orient the pieces.  Knowing even just two of the required slots, combined with the color, reduced the search to a reasonable brute-force search.  Plus, by sorting the pieces you could actually do a brute-force without feeling like you might have missed a piece.",
        "time": 1413911942,
        "type": "comment"
    },
    {
        "by": "bloody0815",
        "id": 8488424,
        "score": 3,
        "text": "",
        "time": 1413911977,
        "title": "Android L is for lockdown",
        "type": "story",
        "url": "http://www.xda-developers.com/android/android-l-lockdown/"
    },
    {
        "by": "rdtsc",
        "id": 8488425,
        "kids": [
            8488508,
            8488490
        ],
        "parent": 8488406,
        "text": "&gt; Then I discovered quicksort, and graph search, and Bayesian inference, and Dijkstra, and Karatsuba.<p>I would guess most &quot;discovered&quot; those because they had to interview. The % of programmers who need to Karatsuba or Bayesian inference to finish their project is very much smaller than the % of programmers who thought &quot;oh shit, I better learn this because Google and Facebook keep asking about graph theory&quot;.<p>It it is perhaps an interesting secondary effect. CS concepts become useful not just because they are useful (and they are) but also because recruiters at many companies think they are.  If tomorrow juggling skills somehow become popular during Google interviews. You&#x27;d see a lot of juggling programmers out there.",
        "time": 1413911982,
        "type": "comment"
    },
    {
        "by": "wslh",
        "id": 8488426,
        "score": 1,
        "text": "",
        "time": 1413912010,
        "title": "Firefox 'Metro' app abandoned because no one wants Microsoft's Modern UI",
        "type": "story",
        "url": "http://www.techradar.com/news/software/applications/firefox-metro-app-abandoned-as-microsoft-s-modern-ui-proves-unpopular-1234176"
    },
    {
        "by": "jozi9",
        "id": 8488427,
        "score": 1,
        "text": "Does it make any sense being a real full-stack engineer? Client-side JS is getting more and more complex with all that AngularJS&#x2F;React etc stuff, it really pushes the limits of the one-man show approach for web development. How many JS do you know as a web&#x2F;backend developer?",
        "time": 1413912013,
        "title": "Ask HN: How much JavaScript do you know as a Python/Ruby dev?",
        "type": "story",
        "url": ""
    },
    {
        "deleted": true,
        "id": 8488428,
        "kids": [
            8488502
        ],
        "parent": 8488303,
        "time": 1413912013,
        "type": "comment"
    },
    {
        "by": "pcrh",
        "id": 8488429,
        "parent": 8488364,
        "text": "The link below seems to be the pre-existing relationship between The Guardian and Whisper. It&#x27;s not exactly a business relationship in the terms of investment, for example.<p><a href=\"http://www.theguardian.com/commentisfree/2014/jun/17/iraq-war-veterans-isis-stories\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theguardian.com&#x2F;commentisfree&#x2F;2014&#x2F;jun&#x2F;17&#x2F;iraq-wa...</a>",
        "time": 1413912016,
        "type": "comment"
    },
    {
        "by": "Cherian",
        "id": 8488430,
        "score": 5,
        "text": "",
        "time": 1413912016,
        "title": "The top 10 Indian Startups",
        "type": "story",
        "url": "http://mashable.com/2014/10/21/indian-tech-startups/#:eyJzIjoiZiIsImkiOiJfZDVoNmc5eDZyY3p1bGV2ZyJ9"
    },
    {
        "by": "alabut",
        "id": 8488431,
        "kids": [
            8488532
        ],
        "parent": 8488359,
        "text": "Dude, congrats on the hustle! How did you land your first artist and convince them to crowdfund? Was it a weird experiment for them or totally natural?",
        "time": 1413912030,
        "type": "comment"
    },
    {
        "by": "vidarh",
        "id": 8488432,
        "parent": 8486886,
        "text": "Consider this somewhat similar to booting up an 8-bit home-computer and get thrown into a BASIC prompt. It&#x27;s a fun toy and a great experiment. It&#x27;s not a &quot;product&quot;.<p>Play with it if you want to experiment with Lua and&#x2F;or experiment with a simple OS built around a higher level language. Don&#x27;t play with it if you want something to build your next app on.",
        "time": 1413912040,
        "type": "comment"
    },
    {
        "by": "wmf",
        "id": 8488433,
        "parent": 8488011,
        "text": "<i>So when did a browser stop being &quot;client software&quot;?</i><p>Around the time Netscape relegated Windows to a bunch of device drivers?",
        "time": 1413912041,
        "type": "comment"
    },
    {
        "by": "uselessdguy",
        "id": 8488434,
        "parent": 8488385,
        "text": "I kind of stitched this essay together haphazardly, and it certainly does require some background knowledge to fully understand.<p>Nonetheless, &quot;the udev debacle&quot; refers to systemd merging udev into its codebase, along with tying it to systemd&#x27;s shared files, the recent &quot;debug&quot; parameter fiasco and the rather blunt statement by Lennart concerning migrating the transport to kdbus: <a href=\"http://lists.freedesktop.org/archives/systemd-devel/2014-May/019657.html\" rel=\"nofollow\">http:&#x2F;&#x2F;lists.freedesktop.org&#x2F;archives&#x2F;systemd-devel&#x2F;2014-May...</a><p>PulseAudio (originally PolypAudio) is a networked sound server most often used in Linux systems coming with a variety of centralized features (see here: <a href=\"http://www.freedesktop.org/wiki/Software/PulseAudio/About/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freedesktop.org&#x2F;wiki&#x2F;Software&#x2F;PulseAudio&#x2F;About&#x2F;</a>), which proved to be highly controversial initially and less so to this day. People realized it was buggy and unstable, and different factors were blamed: poor integration, sloppy ALSA drivers, or PulseAudio itself. The most common narrative these days is &quot;PulseAudio was bad because Ubuntu rushed it&quot;, but I haven&#x27;t studied things in enough detail to pinpoint exact reasons.<p>As for HALd, it did solve problems at the time, but I&#x27;ll quote the Ubuntu wiki: <a href=\"https://wiki.ubuntu.com/Halsectomy\" rel=\"nofollow\">https:&#x2F;&#x2F;wiki.ubuntu.com&#x2F;Halsectomy</a>",
        "time": 1413912048,
        "type": "comment"
    },
    {
        "by": "erhardm",
        "id": 8488435,
        "kids": [
            8488516,
            8488472
        ],
        "parent": 8488235,
        "text": "I see the whole pro&#x2F;anti systemd as a philosophical debate. Basically each part is arguing where the complexity should be in the system and how dense it should be distributed.\nI think we need <i>two</i> competing init systems to really know maybe in 5-10 years what the best trade-offs are. A <i>modern</i> sys V init and systemd.",
        "time": 1413912070,
        "type": "comment"
    },
    {
        "by": "Ntrails",
        "id": 8488436,
        "kids": [
            8488503
        ],
        "parent": 8488303,
        "text": "RegEx is just ludicrous a general requirement to &quot;program&quot; as anything else.  I&#x27;ve never particularly wanted it to write the mathematical models I work with.  I can think of just a single instance where I&#x27;ve used one in the last year and that was to display integers as ordinal numbers (hardly a sizeable task).<p>Every job needs a spec.  Every spec should inform the interviewer and the interviewee of the skills and competencies expected by the role, and therefore what will be brought up in the interview.  Adding &quot;everyone should be able to <i>criteria unrelated to role</i>&quot; is madness",
        "time": 1413912076,
        "type": "comment"
    },
    {
        "by": "samerbuna",
        "id": 8488437,
        "score": 1,
        "text": "",
        "time": 1413912076,
        "title": "Stop it with the sign up landing page and VALIDATE your idea with a Demo",
        "type": "story",
        "url": "http://sms.sendfront.com/"
    },
    {
        "by": "danschumann",
        "id": 8488438,
        "parent": 8488411,
        "text": "Lol.. How can you say I am wrong when you don&#x27;t understand what I am saying?",
        "time": 1413912082,
        "type": "comment"
    },
    {
        "by": "jey",
        "id": 8488439,
        "score": 3,
        "text": "",
        "time": 1413912083,
        "title": "UC Berkeley AMP Camp 5 Big Data Bootcamp (Nov 20-21)",
        "type": "story",
        "url": "https://amplab.cs.berkeley.edu/event/amp-camp-5-big-data-bootcamp-nov-20-21-registration-now-open/?hn"
    },
    {
        "by": "burtonator",
        "id": 8488440,
        "parent": 8488235,
        "text": "emacs is the one true editor...<p>same thing all over again :-P",
        "time": 1413912090,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488441,
        "time": 1413912093,
        "type": "story"
    },
    {
        "by": "jusuchin",
        "id": 8488442,
        "parent": 8487184,
        "text": "Yep... used to design anime sites with that all the time, font was 04b03. Size 10 with 2 pix border (black text, white border!)",
        "time": 1413912095,
        "type": "comment"
    },
    {
        "by": "atomical",
        "id": 8488443,
        "score": 1,
        "text": "",
        "time": 1413912105,
        "title": "GameSpy SDK",
        "type": "story",
        "url": "https://github.com/nitrocaster/GameSpy"
    },
    {
        "by": "phkahler",
        "id": 8488444,
        "parent": 8488303,
        "text": "&gt;&gt; However, what does not make sense to me is the asinine requirement that a web developer needs to know or understand algorithms. A front-end developer working with HTML, CSS and Javascript will never EVER need to know how to write an algorithm. In my 12 years as a developer thus far I have never needed to solve a complex math problem or write an algorithm to markup some HTML, the closest I get to math problems is simplistic operations in Javascript like calculating the scroll distance from the top of a page or mathematically moving an element around the page in a particular way and I generally use a calculator for these problems.<p>Perhaps some folks want to automate your job. That&#x27;s not to say you&#x27;re obsolete, just that some people want the machine to do absolutely everything automatically and that often means algorithmically. That&#x27;s probably more effort than its worth in many cases, but sometimes it&#x27;s well worth it.<p>A facebook feed or Google news have a fairly consistent layout, but what content goes into it is definitely chosen by an algorithm (IMHO a poor one at facebook) and the layout is probably tweaked by algorithms.",
        "time": 1413912108,
        "type": "comment"
    },
    {
        "by": "chavesn",
        "id": 8488445,
        "parent": 8488303,
        "text": "This idea that you have repeated several times...<p>&gt; A front-end developer working with HTML, CSS and Javascript will never EVER need to know how to write an algorithm.<p>&gt; In my 12 years as a developer thus far I have never needed to ... write an algorithm to markup some HTML<p>&gt; A developer working with HTML, CSS and Javascript does not need to know algorithms whatsoever.<p>&gt; Only a developer working with data or writing an algorithm to sort it should need to know that stuff.<p>This is either a <i>spectacularly</i> narrow view of what an algorithm is or it is totally wrong.<p>I&#x27;ve done both front-end and back-end&#x2F;data for years.  I frequently write &quot;algorithms&quot; on the front-end.  Several of these were recent:<p>- Retry method for AJAX form submission<p>- Distribute assorted icons evenly among primary keys in a table.<p>- Dependency chain to check and execute asynchronously fetched scripts in the right order<p>- Even CSS can be somewhat algorithmic, as when I optimized by about 100X the hiding and showing of a huge amount of table rows with cascading style rules instead of JS<p>I don&#x27;t think I need to go on, but the point is that if you think front-end developers don&#x27;t need algorithms, then you are doing something wrong.  I would check your assumptions about whether hiring for this is actually helpful.  The companies you are talking about are leaders in both front-end and back-end technology.  How do you think that came to be?",
        "time": 1413912109,
        "type": "comment"
    },
    {
        "by": "dangrossman",
        "id": 8488446,
        "parent": 8488108,
        "text": "Anyone can add something to jsDelivr, not just the library author. You can add it yourself if you&#x27;d like them to host it.",
        "time": 1413912110,
        "type": "comment"
    },
    {
        "by": "Grue3",
        "id": 8488447,
        "parent": 8488253,
        "text": "Suppose x is the price before lunch, y - after. Then we get the following equations:<p>ax + (10-a)y = 3500; bx + (16-b)y = 3500; cx + (26-c)y = 3500<p>Which is equivalent to (assuming x = y + d):<p>ad + 10y = 3500; bd + 16y = 3500; cd + 26y = 3500",
        "time": 1413912115,
        "type": "comment"
    },
    {
        "by": "chao-",
        "id": 8488448,
        "parent": 8488110,
        "text": "As someone who has been teetering on both the Ruby&#x2F;Elixir fence and the Ruby&#x2F;Clojure fence, I have to admit to not looking close enough at Goroutines. A glances left me feeling like they were an abstraction at the wrong level, at least for the type of concurrency I want to write. But I&#x27;ll have to take a look in order to play with Agent. Does anyone have a favorite guide&#x2F;overview to Goroutines?<p>Beyond that, the big conceptual takeaway&#x2F;conclusion for me was this line, and which is definitely going in my quotes file:<p><i>&quot;So, the question is not whether threads need to exist, but rather, whether they actually make for the best high-level interface to write, test, and manage code that requires concurrency, regardless of runtime.&quot;</i><p>It reminds me of listening to JavaScript Jabber&#x27;s episode with David Nolen on ClojureScript and Om. Amidst discussion of how Om leverages ClojureScript&#x27;s immutability to have a performance advantage over standard React.js [0], there was a discussion (admission?) that <i>&quot;our immutable data structures, the reason they’re so fast is because under the hood we do use mutation. That’s why they’re so fast.&quot;</i>.<p>So to use Ilya&#x27;s words as a template: Like threads, it isn&#x27;t a question of whether mutability needs to exist, but rather, whether it actually makes for the best high-level interface to write, test, and manage code.<p>[0] Is it a slight one? I don&#x27;t want to misspeak or oversell it. JSJ is transitioning to a new site design that currently makes the transcript hard to read and find the exact quote on performance: <a href=\"http://devchat.tv/js-jabber/107-jsj-clojurescript-om-with-david-nolen\" rel=\"nofollow\">http:&#x2F;&#x2F;devchat.tv&#x2F;js-jabber&#x2F;107-jsj-clojurescript-om-with-da...</a>",
        "time": 1413912115,
        "type": "comment"
    },
    {
        "by": "eric_h",
        "id": 8488449,
        "parent": 8488140,
        "text": "He&#x27;s better at jigsaws.",
        "time": 1413912127,
        "type": "comment"
    },
    {
        "by": "acebarry",
        "id": 8488450,
        "parent": 8486265,
        "text": "&gt; Do current browsers entirely prevent a connection to untrusted certs when HSTS is set?\nYes. HSTS would not do much to prevent active MiTM. HSTS just tells the browser that it should only connect to the site over HTTPS. It does not mention which certificates are trusted.<p>It seems like you are hinting towards certificate pinning (<a href=\"https://en.wikipedia.org/wiki/Transport_Layer_Security#Certificate_pinning\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Transport_Layer_Security#Certi...</a>). Pinning would prevent rouge CA&#x27;s from signing bad certificates, but pinning is hard to do on the web. It is mainly used with mobile applications from what I have seen.<p>Edit: Here is a list of pinned sites in Chrome, if you are curious. (<a href=\"https://src.chromium.org/viewvc/chrome/trunk/src/net/http/transport_security_state_static.json\" rel=\"nofollow\">https:&#x2F;&#x2F;src.chromium.org&#x2F;viewvc&#x2F;chrome&#x2F;trunk&#x2F;src&#x2F;net&#x2F;http&#x2F;tr...</a>)",
        "time": 1413912129,
        "type": "comment"
    },
    {
        "by": "seanflyon",
        "id": 8488451,
        "parent": 8488418,
        "text": "Algorithms are not puzzles, they are solutions to puzzles.",
        "time": 1413912138,
        "type": "comment"
    },
    {
        "by": "mikeh1010",
        "id": 8488452,
        "parent": 8487665,
        "text": "Scary to see so many journalists piling onto other journalists who are actually doing their jobs in the public interest (but against corporate interests). Reminds me of the &quot;journalists&quot; who were so fast to criticize Glenn Greenwald for his NSA reporting.",
        "time": 1413912152,
        "type": "comment"
    },
    {
        "by": "buckbova",
        "id": 8488453,
        "parent": 8487943,
        "text": "Only puzzles I enjoy are researching a bug and reading through code to find the bug and propose a fix. I enjoy this more than writing new code, even if the codebase is completely foreign to me.",
        "time": 1413912166,
        "type": "comment"
    },
    {
        "by": "anuraj",
        "id": 8488454,
        "parent": 8485857,
        "text": "India is a nanny state trying to save its gullible illiterate masses from cyber influences deemed bad in culture. It is not the cyber surveillance capabilities that is the problem (which is coarse anyway), but the condescending attitude of bureaucracy who can send people to jail without bail for a Facebook like or retweet.",
        "time": 1413912185,
        "type": "comment"
    },
    {
        "by": "baddox",
        "id": 8488455,
        "parent": 8487943,
        "text": "The author should probably at least take a stab at defining his usage of &quot;puzzle.&quot; There&#x27;s a big difference between a jigsaw puzzle and, say, the Portal games. In fact, jigsaw puzzles are a <i>very</i> different endeavor than logic&#x2F;programming puzzles and many puzzle video games.",
        "time": 1413912187,
        "type": "comment"
    },
    {
        "by": "ig1",
        "id": 8488456,
        "parent": 8488198,
        "text": "I think you&#x27;re focusing on the wrong things.<p>VCs (largely) want solid personal relationships with their companies and that&#x27;s something that&#x27;s not happening over skype&#x2F;hangout anytime soon. A few thousand dollars on flights also isn&#x27;t a big deal when you&#x27;re investing millions; time is much more important than money.<p>Your best bet would probably be to:<p>(1) Get solid local VCs who other (non-local) VCs are happy to co-invest with.<p>(2) Build thematic clusters, because a partner at a VC who&#x27;s interested in multiple companies in an area is much more likely to fly out then for an individual company.",
        "time": 1413912203,
        "type": "comment"
    },
    {
        "by": "higherpurpose",
        "id": 8488457,
        "kids": [
            8488544
        ],
        "parent": 8487665,
        "text": "So the Guardian was unethical because it exposed Whisper&#x27;s unethical ways?",
        "time": 1413912206,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488458,
        "parent": 8488325,
        "time": 1413912229,
        "type": "comment"
    },
    {
        "by": "steffoz",
        "id": 8488459,
        "score": 1,
        "text": "",
        "time": 1413912231,
        "title": "Show HN: Real-time remote presence tool built in 48 hours",
        "type": "story",
        "url": "http://www.higuys.io/"
    },
    {
        "by": "sciurus",
        "id": 8488460,
        "score": 1,
        "text": "",
        "time": 1413912244,
        "title": "Unveiling the Microsoft Cloud Platform System",
        "type": "story",
        "url": "http://blogs.technet.com/b/windowsserver/archive/2014/10/20/unveiling-the-microsoft-cloud-platform-system-powered-by-dell.aspx"
    },
    {
        "by": "jobu",
        "id": 8488461,
        "parent": 8488339,
        "text": "It wasn&#x27;t until after having a kid and getting very conflicting advice from different doctors for the same issues that I realized doctors are mostly making educated guesses on treatment.<p>Fortunately, there&#x27;s a significant placebo effect for nearly any treatment from a doctor, so even when doctors make guesses it often ends up helping.",
        "time": 1413912245,
        "type": "comment"
    },
    {
        "by": "philip1209",
        "id": 8488462,
        "parent": 8487561,
        "text": "If you share the same FIDO U2F key between services, does that mean that one service could spoof tokens for a different service?<p>e.g. foo gets compromised, so attackers can generate codes for google apps.",
        "time": 1413912245,
        "type": "comment"
    },
    {
        "by": "AceJohnny2",
        "id": 8488463,
        "kids": [
            8488498
        ],
        "parent": 8487840,
        "text": "&gt; but many&#x2F;most dotfiles reside at the top-level of your home directory, where it wouldn&#x27;t be a good idea to initialize a VCS repository.<p>Right. Which is why I use git with a workspace detached from the git directory. The git directory is in ~&#x2F;dotfiles&#x2F;.git, with &quot;git config core.worktree ~&quot;, and I set an alias &quot;dgit=git --git-dir ~&#x2F;dotfiles&#x2F;.git&quot;. The advantage of this method is that there are no symlinks to maintain, however initial clone is a bit painful, since you have to move the files and set the config.<p>It&#x27;s not perfectly straightforward, but it&#x27;s as close to it as I could get it.",
        "time": 1413912247,
        "type": "comment"
    },
    {
        "by": "pathikrit",
        "id": 8488464,
        "parent": 8486278,
        "text": "Math teacher:<p>* Step 1: Disguise unsolved problem as homework assignment and give it Terry&#x27;s son to solve.<p>* Step 2: Muhahahaha",
        "time": 1413912283,
        "type": "comment"
    },
    {
        "by": "MrQuincle",
        "id": 8488465,
        "parent": 8487943,
        "text": "I definitely agree with this sentiment. Recently someone dropped by for a job interview and revealed how much he loved to solve puzzles. Not that this influenced my decision in any way, but it made me reflect how different I felt w.r.t. this.<p>For me, it is not design either, it is something different.<p>I hate puzzles that are created by other people, where you have to follow the &quot;hidden variable&quot; which is in that case the brain of the maker of the puzzle. They already know the solution! I feel utterly useless solving a puzzle that has been already solved thousands of times by others. What&#x27;s the point!? After 3 sudoku games I&#x27;m done with them. The same with IQ tests on national television. Why would I feel any reward in being able to crawl into the brain of a television writer concocting questions for a general audience? I think there are many much more interesting people in the world, than these guys. Their &quot;puzzles&quot; suck.<p>I also have never enjoyed solving mathematical problems in text books. I love math, and I read a lot of text books, although university is years ago. I think for people like me there should be different ways to teach them.<p>What makes me going is to find new things that haven&#x27;t been known before. After I get some understanding of a field, I love to make up my own problems and solve these. The boundaries of such a problem are vague, it is not even known if it can be solved, but I am happy. Even if it turns out that I solve something that has been solved in the 13th century, I can&#x27;t care less.<p>This is just a personal story, but perhaps someone can relate.",
        "time": 1413912287,
        "type": "comment"
    },
    {
        "by": "pessimizer",
        "id": 8488466,
        "parent": 8488235,
        "text": "I have none of these objections to systemd. My objection is that it&#x27;s both pervasive and unauditable. I can accept one or the other.<p>I don&#x27;t have to rely on &#x27;many eyes&#x27; to tell me what&#x27;s going on with init scripts, I can just look. systemd is sprawling, has no particular philosophy that I can notice, and all of its internal systems are heavily interconnected; this leads me to expect that very few people will be auditing the code that don&#x27;t work for redhat, because very few will understand it. I expect it to increase the vulnerability of the entire system to accidental or intentionally inserted bugs by an order of magnitude. Therefore, I&#x27;d like to see it in the wild for 5 or so years before personally using it - but it looks as if to continue using many linux applications I have to switch to it <i>while it is being written</i>.<p>I don&#x27;t get the point (other than cgroups and boot times), I don&#x27;t get the hurry, and I don&#x27;t get the animosity to alternate and legacy init systems, and to alternate Unices.",
        "time": 1413912290,
        "type": "comment"
    },
    {
        "by": "beastfromeast",
        "id": 8488467,
        "score": 7,
        "text": "",
        "time": 1413912294,
        "title": "Customer Service as Reality Distortion",
        "type": "story",
        "url": "http://blog.socialrank.com/2014/10/21/customer-service-as-reality-distortion/"
    },
    {
        "by": "mercurialshark",
        "id": 8488468,
        "kids": [
            8488489
        ],
        "score": 2,
        "text": "",
        "time": 1413912307,
        "title": "Testing NLP content screening and summarization platform (pre-release)",
        "type": "story",
        "url": "http://3o05b.intellibutler.com"
    },
    {
        "by": "tsenkov",
        "id": 8488469,
        "parent": 8487004,
        "text": "I guess I just haven&#x27;t seen one of these (such specific or probably any Physical Requirements for a job) before and imaging all of it together, there was this comic vision, in my mind, of what will that person actually do on such a job. :)<p>I definitely didn&#x27;t want to offend anyone and I hope I didn&#x27;t.",
        "time": 1413912323,
        "type": "comment"
    },
    {
        "by": "iosjailbreak",
        "dead": true,
        "id": 8488470,
        "score": 1,
        "time": 1413912346,
        "title": "Apple Releases iOS 8.1 and Free Download iOS 8.1 jailbreak",
        "type": "story",
        "url": "http://ios8jailbreak.biz/apple-releases-ios-8-1-ready-jailbreak-ios-8-1/#.VEaV__NmazI.hackernews"
    },
    {
        "by": "josho",
        "id": 8488471,
        "parent": 8488314,
        "text": "And for those that still aren&#x27;t familiar with TLS yet, think of it as simply SSL but newer and better. So, even though SMTP starts unencrypted the STARTTLS command initiates an encrypted session.<p>Most mail servers these days use TLS. So, there is a good chance that the email you send with your confidential pricing lists is being sent encrypted over the network. Unfortunately, there really isn&#x27;t a good way to tell if that happened (at best you can view the mail headers which some servers add headers that show a TLS session was used between mail servers).",
        "time": 1413912360,
        "type": "comment"
    },
    {
        "by": "fbt2lurker",
        "id": 8488472,
        "kids": [
            8488495
        ],
        "parent": 8488435,
        "text": "Why two? As many as people would write. There is already a bunch of em.",
        "time": 1413912372,
        "type": "comment"
    },
    {
        "deleted": true,
        "id": 8488473,
        "parent": 8487979,
        "time": 1413912380,
        "type": "comment"
    },
    {
        "by": "erjiang",
        "id": 8488474,
        "parent": 8487809,
        "text": "I&#x27;d be willing to pay money for this, seriously. I&#x27;ve followed you on Twitter - let me know if anything happens.<p>We were using and enjoying app.io[0] until they decided to pivot and stop serving us.<p>[0] they didn&#x27;t support pinch gestures, which made using a map impossible",
        "time": 1413912383,
        "type": "comment"
    },
    {
        "by": "maccman",
        "id": 8488475,
        "score": 3,
        "text": "",
        "time": 1413912392,
        "title": "Scoring sales leads programmatically",
        "type": "story",
        "url": "http://blog.clearbit.co/leadscoring"
    },
    {
        "by": "3838",
        "id": 8488476,
        "parent": 8487399,
        "text": "there are other countries apart from the uk and spain in europe",
        "time": 1413912396,
        "type": "comment"
    },
    {
        "by": "warble",
        "id": 8488477,
        "kids": [
            8488493
        ],
        "parent": 8487642,
        "text": "I&#x27;ve been seeing a few of these libs pop up on HN lately. Apparently there&#x27;s some sort of need here that people are trying to fill, it&#x27;s just not clear to me what it is.<p>There are legitamite suggestions that blocking UI paradigms are bad, but they&#x27;re very useful at times. I&#x27;m not arguing either, as I think each has their place (although I tend to avoid blocking personally if I can)<p>My real question is why now?",
        "time": 1413912398,
        "type": "comment"
    },
    {
        "by": "czr80",
        "id": 8488478,
        "parent": 8488061,
        "text": "The Yes side on this comes across as trying to elevate  important but minor elaborations into major disagreements, seemingly just to raise the status of their work.",
        "time": 1413912433,
        "type": "comment"
    },
    {
        "by": "Someone1234",
        "id": 8488479,
        "kids": [
            8488536
        ],
        "parent": 8488369,
        "text": "We use Microsoft&#x27;s MVC stack at work, it is wonderful, particularly combined with Entity Framework.<p>Off the top of my head the biggest issue with using Microsoft&#x27;s MVC is not within the framework itself, it is within the wider Microsoft ecosystem.<p>If you use MVC you now need Microsoft Servers (which cost more), maybe CALs, and you&#x27;ll eventually need to pay for MSDN (for the latest Visual Studio and tooling, TS Online is wonderful however).<p>For us it made sense since we&#x27;re in education so Microsoft gives us tons of stuff for either free or at a massive discount.<p>If I myself started a small business (with a limited budget) I&#x27;d likely look at something which offered a similar experience but without the dependencies (namely Ruby on Rails).<p>But I&#x27;d rate the MVC 5&#x2F;Entity Framework 6&#x2F;MS SQL setup alone very favorably. It definitely helps your productivity hugely and if done within the MVC-style will help maintainability somewhat (although you can write anything badly).<p>It is just the dependencies. That&#x27;s really the only major downside.<p>PS - Speed wise it is pretty similar to compiled Java. Faster than [most] PHP (compiled or not).<p>PPS - If you go this route check out Stack Overflow&#x27;s wonderful Miniprofiler. Great tool for SQL development (it work with anything Entity Framework can connect to including non-MS SQL servers like Oracle SQL).",
        "time": 1413912446,
        "type": "comment"
    },
    {
        "by": "marxdeveloper",
        "id": 8488480,
        "parent": 8487809,
        "text": "Needs landscape! Overall very awesome service.",
        "time": 1413912485,
        "type": "comment"
    },
    {
        "by": "_nedR",
        "id": 8488481,
        "parent": 8486031,
        "text": "&gt;&gt;Expressing Nazi ideas is prohibited in Germany because of what following Nazi ideas can lead to, not just to avoid conflict.<p>Yes. Expressing Nazi ideas can lead to violence, extremism, racial and religious discrimination, anti-democratic activity among other things. That&#x27;s pretty much what the OP said, and is also the original motivation behind India&#x27;s censorship laws. I am of the  opinion that the case for censorship is more justified in India than in Germany. As the Gujarat 2002 riots and Assam 2012 riots (where Indian govt. temporarily throttled sms traffic to prevent spread of rumours) have pretty much proven - tactless media coverage or the spreading of rumours during tense situations could result in the deaths of thousands.<p>Of course whether those laws are being abused (in ways including the one you described) is a whole nother question.",
        "time": 1413912489,
        "type": "comment"
    },
    {
        "by": "josho",
        "id": 8488482,
        "parent": 8487979,
        "text": "Since we are making progress to use secure mail transports, why are we not seeing more use of S&#x2F;MIME to secure the contents of the message? I set up signing&#x2F;encrypting on my mail clients, but have yet to see anyone, or any company, use it.",
        "time": 1413912494,
        "type": "comment"
    },
    {
        "by": "lnanek2",
        "id": 8488483,
        "parent": 8487905,
        "text": "I really despise opening Google Maps nowadays on my phone. There have been so many updates that cripple it and make it worse. Really hope someone comes along and puts a good replacement out. Recently it won&#x27;t even show results on the map easily.<p>My search results come up as cards with a tiny sliver of map, then I click on the map and they all disappear, sometimes if I scroll around desperately some will load eventually. But all I wanted in the first place was a full screen map with some icons, not one by one cards to click, also with tiny slivers in them.<p>Not even an isolated incident. I takes half a dozen clicks when getting directions now as well and several other tasks. I don&#x27;t think the Google graphics designers are being forced to perform usability studies like they should be. If they were, they would realize some level of 3D actually helps users determine what is clickable or not.",
        "time": 1413912509,
        "type": "comment"
    },
    {
        "by": "freehunter",
        "id": 8488484,
        "parent": 8485924,
        "text": "Really? I haven&#x27;t read the book, but I did look up a book review. Please tell me if the review is inaccurate, because... wow. I thought <i>Freud</i> was a little off his rocker.<p><i>Dr. Sarno&#x27;s theory can be stated simply: Most muscular&#x2F; skeletel pain is usually the result of early infantile and childhood trauma which has been repressed. The emotion involved is invariably that of profound anger and rage.</i><p>So repressed childhood trauma causes RSI. I&#x27;m not saying that body pains can&#x27;t be psychosomatic, but that&#x27;s a heck of a conclusion there. It sounds like some serious placebo effect. I&#x27;d love to see it tested against a similar but different explanation (a belief in your brainwaves being blocked by the lizardmen who run the government, for example).<p><a href=\"http://primal-page.com/sarno.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;primal-page.com&#x2F;sarno.htm</a>",
        "time": 1413912515,
        "type": "comment"
    },
    {
        "by": "ljk",
        "id": 8488485,
        "parent": 8487964,
        "text": "it get get around this: <a href=\"http://www.skatestoppers.com/Images-Photopage/install09.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skatestoppers.com&#x2F;Images-Photopage&#x2F;install09.jpg</a> :p",
        "time": 1413912534,
        "type": "comment"
    },
    {
        "by": "ultramancool",
        "id": 8488486,
        "parent": 8488187,
        "text": "I&#x27;ve gone to FreeBSD for now on my personal dev box, I&#x27;m a real sucker for a dead simple &#x2F;etc&#x2F;rc.conf like Arch used to have and their system philosophy seems more in line with my own anyways.<p>Very glad to hear we have a major binary distro like Debian committing to init system flexibility this strongly. I just hope it&#x27;s true. The people who are hesitant can experiment and stay where they are for now, moving only when it&#x27;s actually desired rather than forced.",
        "time": 1413912534,
        "type": "comment"
    },
    {
        "by": "fidotron",
        "id": 8488487,
        "kids": [
            8488549,
            8488537
        ],
        "parent": 8488235,
        "text": "It will be very interesting to see how this all plays out in the long run, though the short term is utterly depressing. My hunch is Lennart will be vindicated, on the basis that systemd as it exists right now is not right, but it can be evolved into something much better, and while that may not have occurred to other projects here the stakes are enormous. There is a definite strand to the resistance that any change to something so fundamental must be resisted.<p>The bigger side argument about the Unix philosophy is also intriguing. Rob Pike claimed it was dead and Perl delivered the eulogy, which I can half agree with. The problem is shell scripting is archaic nonsense, but our script languages can&#x27;t do what you can do in shell scripts well enough. The idea of a Unix where you get rid of bash&#x2F;csh&#x2F;whatever and just run a lua&#x2F;python&#x2F;ruby prompt and have your apps implemented largely in that same language (with shell commands being replaced by functions) may make some people squirm, but would make a lot of sense for reducing the overall learning curve.",
        "time": 1413912557,
        "type": "comment"
    },
    {
        "by": "MCRed",
        "id": 8488488,
        "parent": 8487943,
        "text": "This is a feature not a bug-- let me explain:<p>Recruiting is not necessarily easy.  But you can judge a company by how they recruit people. Their hiring process-- given that talent  is so critical-- tells you a great deal about the company.<p>If they do a terrible job, if they are arbitrary or capricious, or if they have discrimination as a policy (e.g.: I was in the room at Startup School when Zuckerberg said &quot;don&#x27;t hire anyone over 30, they just don&#x27;t get it&quot; (paraphrased).... then you know it&#x27;s not a good place to waste your time interviewing.<p>I&#x27;d argue that the company with the puzzle saved you a lot of hassle-- you know they are arbitrary and did not put the effort into producing a competent hiring process, and this likely tells you that they won&#x27;t respect you once you&#x27;re on board as an employee either.<p>There are a great many of these &quot;smells&quot;.<p>As I&#x27;ve gotten more experienced, and more in a position to be picky, here&#x27;s my current gauntlet:<p>-- If they locate themselves in a place that guarantees a 2 hour commute for most employees, but don&#x27;t allow working from home 3 days a week, or remote employees, that&#x27;s a bad sign.  Why pay for downtown office space-- as a startup, no less! -- when there&#x27;s a lot of cheap offices out in the periphery where most people live? (That&#x27;s the case in this town, maybe not in others.)<p>-- Asking for references.  First off this is a legal minefield.  A reference that isn&#x27;t glowing is going to open themselves up to liability.  Any well run business is only going to say you worked there for some period of time.  And who is going to give people they think will give a bad reference?  This one shows naivety.<p>-- Having a preference for ivy league.  Google impeaches itself with this one in my mind.",
        "time": 1413912572,
        "type": "comment"
    },
    {
        "by": "mercurialshark",
        "id": 8488489,
        "parent": 8488468,
        "text": "It loves long form writing too... It&#x27;s designed for article to book length summarization.",
        "time": 1413912575,
        "type": "comment"
    },
    {
        "by": "swartkrans",
        "id": 8488490,
        "parent": 8488425,
        "text": "Actually I think graph theory is pretty important. For example many programming contexts have to deal with dependencies, and often dependencies form a directed acyclic graph. Understanding that will aid in writing better, more reliable code. Path finding is also pretty important, especially if you want to make a game.",
        "time": 1413912585,
        "type": "comment"
    },
    {
        "by": "treehau5",
        "id": 8488491,
        "parent": 8487943,
        "text": "This isn&#x27;t the only industry this happens.<p>In restaurants you have line cooks, prep cooks, and then occasionally if you are a &quot;fancy&quot; enough of a place you have a sous chef and an executive chef.<p>The one common thread here is, they are all cooks.<p>Now most line cooks will have never have actually &quot;created&quot; a dish, just like most of us have never &quot;created&quot; an algorithm, (having the vision for something new, knowing which ingredients sourced from what region will work the best, knowing how the various intricacies of spices, how they interact with each other, what temperature is optimal for meats, ect), but I am sure they know how to put something new together.",
        "time": 1413912596,
        "type": "comment"
    },
    {
        "by": "jenmcewen",
        "id": 8488492,
        "parent": 8486656,
        "text": "Nope, you can use it lots of other messaging, like marketing, newsletters, and notifications.",
        "time": 1413912613,
        "type": "comment"
    },
    {
        "by": "dangrossman",
        "id": 8488493,
        "parent": 8488477,
        "text": "Lots of people on HN develop web apps but aren&#x27;t great designers, and nifty little libraries like this make our work look better than our own design skill would normally allow. I think it&#x27;s that simple -- they&#x27;re not being upvoted for any deep reason relating to UX best practices.",
        "time": 1413912639,
        "type": "comment"
    },
    {
        "by": "ladytron",
        "id": 8488494,
        "parent": 8485662,
        "text": "Human cloning + surrogacy + suspended animation ( theraputic hypothermia ) + nerve regeneration + microsurgery = immortality. Theoretically this now seems possible.",
        "time": 1413912643,
        "type": "comment"
    },
    {
        "by": "erhardm",
        "id": 8488495,
        "parent": 8488472,
        "text": "At least one of each side of the debate. Preferable there should be two, one on each side which implements the good&#x2F;novel ideas and others where aggressive experimentation takes part.",
        "time": 1413912645,
        "type": "comment"
    },
    {
        "by": "nkozyra",
        "id": 8488496,
        "parent": 8488256,
        "text": "Just to summarize, I entered because the concern was about cleartext passwords being sent via SMS.  This is almost never the case, typically it&#x27;s a token.<p>As a mitigation tactic for full MTM, 2FA is basically without teeth.  Same applies for the new item Google is trumpeting.<p>I&#x27;m not saying someone couldn&#x27;t do a MTM with both SMS and full network, I&#x27;m saying it&#x27;s overkill and redundant.  There&#x27;s no advantage.  If you&#x27;re already funneling the data, you have what you want.",
        "time": 1413912665,
        "type": "comment"
    },
    {
        "by": "amluto",
        "id": 8488497,
        "parent": 8487777,
        "text": "Yubico doesn&#x27;t allow firmware updates.  They do, however, support the GlobalPlatform standard for uploading new JavaCard applets, and, if the NFC bindings were designed such that a JavaCard applet could implement it, then a U2F applet could be uploaded to an existing YKNeo.",
        "time": 1413912667,
        "type": "comment"
    },
    {
        "by": "emillon",
        "id": 8488498,
        "parent": 8488463,
        "text": "That&#x27;s exactly how vcsh works too.",
        "time": 1413912670,
        "type": "comment"
    },
    {
        "by": "uptown",
        "id": 8488499,
        "score": 6,
        "text": "",
        "time": 1413912678,
        "title": "Google Acquires Firebase to Help Developers Build Better Real-Time Apps",
        "type": "story",
        "url": "http://techcrunch.com/2014/10/21/google-acquires-firebase-to-help-developers-build-better-realtime-apps/"
    },
    {
        "by": "vladstoick",
        "id": 8488500,
        "kids": [
            8488527,
            8488530,
            8488547
        ],
        "score": 71,
        "text": "",
        "time": 1413912686,
        "title": "Firebase is Joining Google",
        "type": "story",
        "url": "https://www.firebase.com/blog/2014-10-21-firebase-joins-google.html"
    },
    {
        "by": "ka4tik",
        "id": 8488501,
        "score": 1,
        "text": "",
        "time": 1413912699,
        "title": "Microsoft will replace its Nokia brand with ‘Microsoft Lumia’",
        "type": "story",
        "url": "http://thenextweb.com/microsoft/2014/10/21/microsoft-will-replace-nokia-brand-microsoft-lumia/"
    },
    {
        "deleted": true,
        "id": 8488502,
        "parent": 8488428,
        "time": 1413912706,
        "type": "comment"
    },
    {
        "by": "lostcolony",
        "id": 8488503,
        "parent": 8488436,
        "text": "Agreed. I can write a regex the (very) few times I need one, but it generally entails me looking up a cheat sheet to get the appropriate character classes. If you were to put me in front of a whiteboard I would flub the most simple of tasks (from the original post, &quot;{(.*)}&quot;, I think? Did we mean to include whitespace, and does . translate properly? Because that&#x27;s partly language dependent when it comes to white space, newlines, etc, and how the regex parser works. Did we mean to capture empty cases? Did we intend for it to be greedy?).<p>Does that mean I can&#x27;t program? Ha ha ha, no. Does that mean I can&#x27;t manipulate strings like a boss? Ha ha ha, no. I first reach for the language&#x27;s tools, before I reach for regular expressions (the OP, I would first reach for doing a string search for {, and then one for }, from the rear if you want it greedy, and substringing what is in the middle; it&#x27;s far less ambiguous, and any dev will know exactly what it does). Even when something ~technically~ takes a regex, if what I&#x27;m looking for is just a literal (as it often is; does this string contain X or not?), I don&#x27;t need to &#x27;know&#x27; regexes. So there&#x27;s a LOT I can do without knowing regular expressions.<p>Meanwhile, I -have- needed to be able to recognize that something was running in O(n^2) time, and what I could do to optimize it to O(n). I -have- needed to implement my own search and bucket sort routines.<p>EDIT: Oh, wait, no, for the regex I&#x27;d need to escape the brackets, too. Etc. See? Now I have two problems.",
        "time": 1413912710,
        "type": "comment"
    },
    {
        "by": "zvanness",
        "id": 8488504,
        "score": 1,
        "text": "",
        "time": 1413912741,
        "title": "What If America Had Canada's Healthcare System?",
        "type": "story",
        "url": "http://www.theatlantic.com/health/archive/2014/10/what-if-america-had-canadas-healthcare-system/381662/"
    },
    {
        "by": "Daishiman",
        "id": 8488505,
        "parent": 8487934,
        "text": "I&#x27;m not talking strictly about a PhD, but about PhD <i>level</i> work, some of which can&#x27;t really be done on your own unless you&#x27;re a supremely talented individual.<p>You can look at some of the modern ML algorithms and see what I mean; many people that I know have worked with Latent Dirichlet Allocation, but they have no idea how the model works, and there&#x27;s no way they could extend to work online or under certain performance or storage constraints without havin spent months and years working on that problem.<p>That&#x27;s not a realistic expectation for anyone in the field. Yes, the algorithms you find in Weka and other ML toolkits are useful, but the actual &quot;Big Data&quot; problems have their own performance and algorithmic constraints that are far, <i>far</i> beyond dedicated self-learners.",
        "time": 1413912767,
        "type": "comment"
    },
    {
        "by": "odonnellryan",
        "id": 8488506,
        "parent": 8488026,
        "text": "I had Lyme disease (tested positive, treated.) I&#x27;ve felt &quot;like shit&quot; for probably at least the last year.",
        "time": 1413912768,
        "type": "comment"
    },
    {
        "by": "japhyr",
        "id": 8488507,
        "parent": 8488298,
        "text": "You are certainly correct in identifying one of the challenges to implementing this kind of model. But the reality is, that students in most classes are at different stages of understanding. We&#x27;re just used to a model where everyone is expected to be at the same place all the time, and tend to bore the students who are &quot;ahead&quot; and frustrate the students who are &quot;behind&quot;. There are other models, which address this issue of pacing and differentiation effectively.<p>Sorry to not give a more complete answer at the moment.",
        "time": 1413912771,
        "type": "comment"
    },
    {
        "by": "harperlee",
        "id": 8488508,
        "parent": 8488425,
        "text": "This is very similar to the behaviour that Keynes described in the equity markets: <a href=\"http://en.wikipedia.org/wiki/Keynesian_beauty_contest\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Keynesian_beauty_contest</a>",
        "time": 1413912775,
        "type": "comment"
    },
    {
        "by": "wxm",
        "id": 8488509,
        "score": 5,
        "text": "",
        "time": 1413912779,
        "title": "Google acquires Firebase",
        "type": "story",
        "url": "http://googlecloudplatform.blogspot.com/2014/10/welcome-firebase-to-google-cloud-platform.html"
    },
    {
        "by": "joelle",
        "id": 8488510,
        "score": 1,
        "text": "",
        "time": 1413912780,
        "title": "Looking Beyond the Blog Entry",
        "type": "story",
        "url": "http://rocketship.fm/episodes/ep-72-eliot-peper/"
    },
    {
        "by": "DenisM",
        "id": 8488511,
        "parent": 8487809,
        "text": "There&#x27;s market here for training corporate users over the internet to use line of business iPad apps.<p>I&#x27;d pay for it, if it actually made training easier...",
        "time": 1413912782,
        "type": "comment"
    }
]